{"Metadata": {"spec": "25.501", "CR": "6230", "revision": "-", "Impacted Version": "18.6.0", "Target Release": "Rel-18", "CR status at WG": "revised", "Title": "Clarification on EURP during initial registration procedure", "Source to WG": "CATT", "Source to TSG": "C1", "Work item code": "", "Category": "F", "Reason for change": "When the UE performs initial registration procedure and the AMF is\nable to determine a UE out-of-coverage period based on satellite\ncoverage availability information, it is unclear that the AMF shall\ndetermine whether the UE is required to perform the registration\nprocedure in NG-RAN satellite access when the unavailability period has\nended.", "Summary of change": "Clarify that the AMF can determine whether the UE is required to\nperform the registration procedure in NG-RAN satellite access when the\nunavailability period has ended during initial registration\nprocedure.", "Consequences if not approved": "It is unclear that the AMF shall determine whether the UE is required\nto perform the registration procedure in NG-RAN satellite access when\nthe unavailability period has ended during initial registration\nprocedure.", "Clauses affected": "5.5.1.2.4", "N": "", "Other specs": "", "X": "O&M Specifications", "affected": "", "(show related CRs)": "", "Other comments": "", "This CR's revision history": ""}, "titles_list": [{"Header 5": "5.5.1.2.4 Initial registration accepted by the network"}], "contents_list": ["During a registration procedure with 5GS registration type IE set to\n\\\"emergency registration\\\", the AMF shall not check for mobility and\naccess restrictions, regional restrictions or subscription restrictions,\nor CAG restrictions when processing the REGISTRATION REQUEST message.  \nIf the initial registration request is accepted by the network, the AMF\nshall send a REGISTRATION ACCEPT message to the UE.  \nNOTE 0: If the AMF receives the initial registration request over\nnon-3GPP access and detects that the N3IWF used by the UE is compatible\nwith only part of the allowed NSSAI and the UE has not indicated its\nsupport for slice-based N3IWF selection in the REGISTRATION REQUEST\nmessage, the AMF accepts the initial registration request.  \nNOTE 0A: If the AMF receives the initial registration request over\nnon-3GPP access and detects that the TNGF used by the UE is compatible\nwith only part of the allowed NSSAI and the UE has not indicated its\nsupport for slice-based TNGF selection in the REGISTRATION REQUEST\nmessage, the AMF accepts the initial registration request.  \nFor each of the information elements: 5GMM capability, S1 UE network\ncapability, and UE security capability, the AMF shall store all octets\nreceived from the UE in the REGISTRATION REQUEST message, up to the\nmaximum length defined for the respective information element.  \nNOTE 1: This information is forwarded to the new AMF during inter-AMF\nhandover or to the new MME during inter-system handover to S1 mode.  \nThe AMF shall assign and include a TAI list as a registration area the\nUE is registered to in the REGISTRATION ACCEPT message. The AMF shall\nnot assign a TAI list containing both tracking areas in NB-N1 mode and\ntracking areas not in NB-N1 mode. The UE, upon receiving a REGISTRATION\nACCEPT message, shall delete its old TAI list and store the received TAI\nlist. If the REGISTRATION REQUEST message was received over non-3GPP\naccess, the AMF shall include a single TAI in the TAI list.  \nNOTE 2: For non-3GPP access, the operator can allocate a TAI per N3IWF,\nTNGF, TWIF or W-AGF. Each N3IWF, TNGF, TWIF or W-AGF is locally\nconfigured with a TAI. Each N3IWF, TNGF, TWIF or W-AGF can be configured\nwith its own TAI value, or with the same TAI value as other N3IWFs,\nTNGFs, TWIFs or W-AGFs.  \nNOTE 3: When assigning the TAI list, the AMF can take into account the\neNodeB\\'s capability of support of CIoT 5GS optimization.  \nThe AMF may include service area restrictions in the Service area list\nIE in the REGISTRATION ACCEPT message. The UE, upon receiving a\nREGISTRATION ACCEPT message with the service area restrictions shall act\nas described in subclause 5.3.5.  \nThe AMF may also include a list of equivalent PLMNs in the REGISTRATION\nACCEPT message. Each entry in the list contains a PLMN code (MCC+MNC).\nThe UE shall store the list as provided by the network, and if the\ninitial registration procedure is not for emergency services, the UE\nshall remove from the list any PLMN code that is already in the\nforbidden PLMN list as specified in subclause 5.3.13A. In addition, the\nUE shall add to the stored list the PLMN code of the registered PLMN\nthat sent the list. The UE shall replace the stored list on each receipt\nof the REGISTRATION ACCEPT message. If the REGISTRATION ACCEPT message\ndoes not contain a list, then the UE shall delete the stored list. The\nAMF of a PLMN shall not include a list of equivalent SNPNs.  \nIf the ESI bit of the 5GMM capability IE of the REGISTRATION REQUEST\nmessage is set to \\\"equivalent SNPNs supported\\\", the AMF of a SNPN may\ninclude a list of equivalent SNPNs in the REGISTRATION ACCEPT message.\nIf the initial registration request is for onboarding services in SNPN,\nthe AMF shall not include a list of equivalent SNPNs in the REGISTRATION\nACCEPT message. Each entry in the list contains an SNPN identity. The UE\nshall store the list as provided by the network. If the initial\nregistration procedure is not for emergency services and is not the\ninitial registration for onboarding services in SNPN, the UE shall\nremove from the list any SNPN identity that is already in:  \n\\- the \\\"permanently forbidden SNPNs\\\" list or the \\\"temporarily\nforbidden SNPNs\\\" list, if the SNPN is not an SNPN selected for\nlocalized services in SNPN (see 3GPP TS 23.122 \\[5\\]); or  \n\\- the \\\"permanently forbidden SNPNs for access for localized services\nin SNPN\\\" list or the \\\"temporarily forbidden SNPNs for access for\nlocalized services in SNPN\\\" list, if the SNPN is an SNPN selected for\nlocalized services in SNPN (see 3GPP TS 23.122 \\[5\\]).  \nThe UE shall add to the stored list the SNPN identity of the registered\nSNPN that sent the list. The UE shall replace the stored list on each\nreceipt of the REGISTRATION ACCEPT message. If the REGISTRATION ACCEPT\nmessage does not contain a list, then the UE shall delete the stored\nlist. The AMF of an SNPN shall not include a list of equivalent PLMNs.  \nNOTE 3A: If N1 mode was disabled for an SNPN due to reception of 5GMM\ncause #27 or #62, the UE implementation ensures that it does not\nregister to this SNPN due to being part of the list of \\\"equivalent\nSNPNs\\\" received while registered in another SNPN.  \nIf the initial registration procedure is not for emergency services, the\nUE is not registered for disaster roaming services, and if the PLMN\nidentity of the registered PLMN is a member of the forbidden PLMN list\nas specified in subclause 5.3.13A, any such PLMN identity shall be\ndeleted from the corresponding list(s).  \nIf the Service area list IE is not included in the REGISTRATION ACCEPT\nmessage, any tracking area in the registered PLMN and its equivalent\nPLMN(s) in the registration area, or in the registered SNPN, is\nconsidered as an allowed tracking area as described in subclause 5.3.5.  \nIf the REGISTRATION REQUEST message contains the LADN indication IE,\nbased on the LADN indication IE, UE subscription information, UE\nlocation and local configuration about LADN and:  \n\\- if the LADN indication IE includes requested LADN DNNs, the UE\nsubscribed DNN list includes the requested LADN DNNs or the wildcard\nDNN, and the LADN service area of the requested LADN DNN has an\nintersection with the current registration area, the AMF shall determine\nthe requested LADN DNNs included in the LADN indication IE as LADN DNNs\nfor the UE;  \n\\- if no requested LADN DNNs included in the LADN indication IE and the\nwildcard DNN is included in the UE subscribed DNN list, the AMF shall\ndetermine the LADN DNN(s) configured in the AMF whose LADN service area\nhas an intersection with the current registration area as LADN DNNs for\nthe UE; or  \n\\- if no requested LADN DNNs included in the LADN indication IE and the\nwildcard DNN is not included in the UE subscribed DNN list, or if the UE\nsubscribed DNN list does not include any of the DNN\\'s in the LADN\nindication IE, the AMF shall determine the LADN DNN(s) included in the\nUE subscribed DNN list whose LADN service area has an intersection with\nthe current registration area as LADN DNNs for the UE.  \nIf the LADN indication IE is not included in the REGISTRATION REQUEST\nmessage, the AMF shall determine the LADN DNN(s) included in the UE\nsubscribed DNN list whose service area has an intersection with the\ncurrent registration area as LADN DNNs for the UE, except for the\nwildcard DNN included in the UE subscribed DNN list.  \nIf the UE supports WUS assistance information and the AMF supports and\naccepts the use of WUS assistance information for the UE, then the AMF\nshall determine the negotiated UE paging probability information for the\nUE, store it in the 5GMM context of the UE, and if the UE is not\nperforming the initial registration for emergency services, the AMF\nshall include it in the Negotiated WUS assistance information IE in the\nREGISTRATION ACCEPT message. The AMF may consider the UE paging\nprobability information received in the Requested WUS assistance\ninformation IE when determining the negotiated UE paging probability\ninformation for the UE.  \nNOTE 4: Besides the UE paging probability information requested by the\nUE, the AMF can take local configuration or previous statistical\ninformation for the UE into account when determining the negotiated UE\npaging probability information for the UE.  \nIf the UE sets the NR-PSSI bit to \\\"NR paging subgrouping supported\\\" in\nthe 5GMM capability IE in the REGISTRATION REQUEST message and the AMF\nsupports and accepts the use of PEIPS assistance information for the UE,\nthen the AMF shall determine the Paging subgroup ID for the UE, store it\nin the 5GMM context of the UE, and shall include it in the Negotiated\nPEIPS assistance information IE in the REGISTRATION ACCEPT message or in\nthe Updated PEIPS assistance information IE in the CONFIGURATION UPDATE\nCOMMAND message as part of the registration procedure. The AMF may\nconsider the UE paging probability information received in the Requested\nPEIPS assistance information IE when determining the Paging subgroup ID\nfor the UE.  \nNOTE 5: Besides the UE paging probability information when provided by\nthe UE, the AMF can also take local configuration, whether the UE is\nlikely to receive IMS voice over PS session calls, UE mobility pattern\nor previous statistical information for the UE or information provided\nby the NG-RAN into account when determining the Paging subgroup ID for\nthe UE.  \nIf the UE set the UN-PER bit to \\\"unavailability period supported\\\" in\nthe 5GMM capability IE in the REGISTRATION REQUEST message and the AMF\nsupports and accepts the use of unavailability period for the UE, then\nthe AMF shall set the UN-PER bit to \\\"unavailability period supported\\\"\nin the 5GS network feature support IE in the REGISTRATION ACCEPT\nmessage. Furthermore, if the AMF is able to determine a UE\nout-of-coverage period based on satellite coverage availability\ninformation, the AMF:  \na\\) shall store the determined unavailability period duration;  \nb\\) may store the start of the unavailability period; and  \nc\\) shall determine whether the UE is required to perform the\nregistration procedure in NG-RAN satellite access when the\nunavailability period has ended and set the EURP bit to \\\"UE needs to\nreport end of unavailability period \\\" or \\\"UE does not need to report\nend of unavailability period\\\" in the Unavailability configuration IE;\nand  \nprovide them to the UE by including the Unavailability configuration IE\nin the REGISTRATION ACCEPT message. When the unavailability period\nstarts, the AMF shall consider the UE as unreachable until the UE\nregisters for normal service again.The AMF may determine the periodic\nregistration update timer value based on a network determined\nunavailability period duration.  \nThe AMF shall include the LADN information which consists of the\ndetermined LADN DNNs for the UE and LADN service area(s) available in\nthe current registration area in the LADN information IE of the\nREGISTRATION ACCEPT message.  \nIf the UE has set the LADN-DS bit to \\\"LADN per DNN and S-NSSAI\nsupported\\\" in the 5GMM capability IE of the REGISTRATION REQUEST\nmessage and the extended LADN information is available for the UE, the\nAMF shall include the extended LADN information which consists of the\ndetermined LADN DNNs for the UE, the S-NSSAIs associated with the\ndetermined LADN DNNs for the UE and in the allowed NSSAI, and LADN\nservice area(s) available in the current registration area in the\nExtended LADN information IE in the Registration accept type 6 IE\ncontainer IE of the REGISTRATION ACCEPT message.  \nIf:  \n\\- the UE does not support LADN per DNN and S-NSSAI;  \n\\- the UE is subscribed to the LADN DNN for a single S-NSSAI only; and  \n\\- the AMF only has the extended LADN information;  \nthe AMF may decide to provide the LADN service area for that LADN DNN of\nthe extended LADN information as the LADN information and include the\nLADN information in the LADN information IE of the CONFIGURATION UPDATE\nCOMMAND message.  \nNOTE 5A: If the LADN service area is configured per DNN and S-NSSAI, in\norder to serve the UEs that do not support LADN per DNN and S-NSSAI, it\nis recommended that the LADN DNN is only served by a single S-NSSAI.  \nNOTE 5B: In case of the UE is subscribed to the LADN DNN for multiple\nS-NSSAIs, the AMF can treat this as no extended LADN information is\navailable.  \nIf the UE does not support LADN per DNN and S-NSSAI and the AMF has\nneither the LADN information nor the extended LADN information, the AMF\nshall not provide any LADN information to the UE.  \nThe UE, upon receiving the REGISTRATION ACCEPT message with the LADN\ninformation, shall store the received LADN information. The UE, upon\nreceiving the REGISTRATION ACCEPT message with the Extended LADN\ninformation, shall store the received extended LADN information. If\nthere exists one or more LADN DNNs which are included in the LADN\nindication IE of the REGISTRATION REQUEST message and are not included\nin the LADN information IE and Extended LADN information IE in the\nRegistration accept type 6 IE container IE of the REGISTRATION ACCEPT\nmessage, the UE considers such LADN DNNs as not available in the current\nregistration area.  \nThe 5G-GUTI reallocation shall be part of the initial registration\nprocedure. During the initial registration procedure, if the AMF has not\nallocated a new 5G-GUTI by the generic UE configuration update\nprocedure, the AMF shall include in the REGISTRATION ACCEPT message the\nnew assigned 5G-GUTI together with the assigned TAI list.  \nIf the UE has set the CAG bit to \\\"CAG supported\\\" in the 5GMM\ncapability IE of the REGISTRATION REQUEST message and the AMF needs to\nupdate the \\\"CAG information list\\\" stored in the UE, the AMF shall\ninclude the CAG information list IE or the Extended CAG information list\nIE in the REGISTRATION ACCEPT message.  \nNOTE 6: The \\\"CAG information list\\\" can be provided by the AMF and\ninclude no entry if no \\\"CAG information list\\\" exists in the\nsubscription.  \nNOTE 7: If the UE supports extended CAG information list, the CAG\ninformation list can be included either in the CAG information list IE\nor Extended CAG information list IE.  \nIf the UE does not support extended CAG information list, the CAG\ninformation list shall not be included in the Extended CAG information\nlist IE.  \nIf a 5G-GUTI or the SOR transparent container IE is included in the\nREGISTRATION ACCEPT message, the AMF shall start timer T3550 and enter\nstate 5GMM-COMMON-PROCEDURE-INITIATED as described in\nsubclause 5.1.3.2.3.3.  \nIf the Operator-defined access category definitions IE, the Extended\nemergency number list IE, the CAG information list IE or the Extended\nCAG information list IE are included in the REGISTRATION ACCEPT message,\nthe AMF shall start timer T3550 and enter state\n5GMM-COMMON-PROCEDURE-INITIATED as described in subclause 5.1.3.2.3.3.  \nIf the UE has set the RCMAP bit to \\\"Sending of REGISTRATION COMPLETE\nmessage for negotiated PEIPS assistance information supported\\\" in the\n5GMM capability IE of the REGISTRATION REQUEST message and if the\nNegotiated PEIPS assistance information IE is included in the\nREGISTRATION ACCEPT message, the AMF shall start timer T3550 and enter\nstate 5GMM-COMMON-PROCEDURE-INITIATED as described in\nsubclause 5.1.3.2.3.3.  \nIf the UE is not in NB-N1 mode and the UE has set the RACS bit to \\\"RACS\nsupported\\\" in the 5GMM Capability IE of the REGISTRATION REQUEST\nmessage, the AMF may include either a UE radio capability ID IE or a UE\nradio capability ID deletion indication IE in the REGISTRATION ACCEPT\nmessage. If the UE radio capability ID IE or the UE radio capability ID\ndeletion indication IE is included in the REGISTRATION ACCEPT message,\nthe AMF shall start timer T3550 and enter state\n5GMM-COMMON-PROCEDURE-INITIATED as described in subclause 5.1.3.2.3.3.  \nThe AMF shall include the MICO indication IE in the REGISTRATION ACCEPT\nmessage only if the MICO indication IE was included in the REGISTRATION\nREQUEST message, the AMF supports and accepts the use of MICO mode. If\nthe AMF supports and accepts the use of MICO mode, the AMF may indicate\n\\\"all PLMN registration area allocated\\\" in the MICO indication IE in\nthe REGISTRATION ACCEPT message. If \\\"all PLMN registration area\nallocated\\\" is indicated in the MICO indication IE, the AMF shall not\nassign and include the TAI list in the REGISTRATION ACCEPT message. If\nthe REGISTRATION ACCEPT message included an MICO indication IE\nindicating \\\"all PLMN registration area allocated\\\", the UE shall treat\nall TAIs in the current PLMN as a registration area and delete its old\nTAI list. If \\\"strictly periodic registration timer supported\\\" is\nindicated in the MICO indication IE in the REGISTRATION REQUEST message,\nthe AMF may indicate \\\"strictly periodic registration timer supported\\\"\nin the MICO indication IE in the REGISTRATION ACCEPT message.  \nThe AMF shall include an active time value in the T3324 IE in the\nREGISTRATION ACCEPT message if the UE requested an active time value in\nthe REGISTRATION REQUEST message and the AMF accepts the use of MICO\nmode and the use of active time.  \nIf the AMF supports and accepts the use of MICO, and the UE included the\nRequested T3512 value IE in the REGISTRATION REQUEST message, then the\nAMF shall take into account the T3512 value requested when providing the\nT3512 value IE in the REGISTRATION ACCEPT message.  \nNOTE 7A: The T3512 value assigned to the UE by AMF can be different from\nthe T3512 value requested by the UE. AMF can take several factors into\naccount when assigning the T3512 value, e.g. local configuration,\nexpected UE behaviour, UE requested T3512 value, UE subscription data,\nnetwork policies.  \nThe AMF shall include the T3512 value IE in the REGISTRATION ACCEPT\nmessage only if the REGISTRATION REQUEST message was sent over the 3GPP\naccess.  \nThe AMF shall include the non-3GPP de-registration timer value IE in the\nREGISTRATION ACCEPT message only if the REGISTRATION REQUEST message was\nsent over the non-3GPP access.  \nIf the UE requests \\\"control plane CIoT 5GS optimization\\\" in the 5GS\nupdate type IE, indicates support of control plane CIoT 5GS optimization\nin the 5GMM capability IE and the AMF decides to accept the requested\nCIoT 5GS optimization and the registration request, the AMF shall\nindicate \\\"control plane CIoT 5GS optimization supported\\\" in the 5GS\nnetwork feature support IE of the REGISTRATION ACCEPT message.  \nThe AMF may include the T3447 value IE set to the service gap time value\nin the REGISTRATION ACCEPT message if:  \n\\- the UE has indicated support for service gap control in the\nREGISTRATION REQUEST message; and  \n\\- a service gap time value is available in the 5GMM context.  \nIf there is a running T3447 timer in the AMF and the Follow-on request\nindicator is set to \\\"Follow-on request pending\\\" in the REGISTRATION\nREQUEST message, the AMF shall ignore the flag and proceed as if the\nflag was not received except for the following cases:  \na\\) the UE is configured for high priority access in the selected PLMN;\nor  \nb\\) the 5GS registration type IE in the REGISTRATION REQUEST message is\nset to \\\"emergency registration\\\".  \nIf the UE has indicated support for the control plane CIoT 5GS\noptimizations, and the AMF decides to activate the congestion control\nfor transport of user data via the control plane, then the AMF shall\ninclude the T3448 value IE in the REGISTRATION ACCEPT message.  \nIf:  \n\\- the UE in NB-N1 mode is using control plane CIoT 5GS optimization;\nand  \n\\- the network is configured to provide the truncated 5G-S-TMSI\nconfiguration for control plane CIoT 5GS optimizations;  \nthe AMF shall include the Truncated 5G-S-TMSI configuration IE in the\nREGISTRATION ACCEPT message and set the \\\"Truncated AMF Set ID value\\\"\nand the \\\"Truncated AMF Pointer value\\\" in the Truncated 5G-S-TMSI\nconfiguration IE based on network policies. The AMF shall start timer\nT3550 and enter state 5GMM-COMMON-PROCEDURE-INITIATED as described in\nsubclause 5.1.3.2.3.3.  \nIf the UE has included the service-level device ID set to the CAA-level\nUAV ID in the Service-level-AA container IE of the REGISTRATION REQUEST\nmessage, and if:  \n> \\- the UE has a valid aerial UE subscription information;\n>\n> \\- the UUAA procedure is to be performed during the registration\n> procedure according to operator policy;\n>\n> \\- there is no valid successful UUAA result for the UE in the UE 5GMM\n> context; and\n>\n> \\- the REGISTRATION REQUEST message was not received over non-3GPP\n> access,  \nthen the AMF shall initiate the UUAA-MM procedure with the UAS-NF as\nspecified in 3GPP TS 23.256 \\[6AB\\] and shall include a service-level-AA\npending indication in the Service-level-AA container IE of the\nREGISTRATION ACCEPT message. The AMF shall store in the UE 5GMM context\nthat a UUAA procedure is pending. The AMF shall start timer T3550 and\nenter state 5GMM-COMMON-PROCEDURE-INITIATED as described in\nsubclause 5.1.3.2.3.3. If the REGISTRATION REQUEST message was received\nover non-3GPP access, the AMF shall not initiate UUAA-MM procedure.  \nIf the UE has included the service-level device ID set to the CAA-level\nUAV ID in the Service-level-AA container IE of the REGISTRATION REQUEST\nmessage, and if:  \n> \\- the UE has a valid aerial UE subscription information;\n>\n> \\- the UUAA procedure is to be performed during the registration\n> procedure according to operator policy; and\n>\n> \\- there is a valid successful UUAA result for the UE in the UE 5GMM\n> context,  \nthen the AMF shall include a service-level-AA response in the\nService-level-AA container IE of the REGISTRATION ACCEPT message and set\nthe SLAR field in the service-level-AA response to \\\"Service level\nauthentication and authorization was successful\\\".  \nIf the AMF determines that the UUAA-MM procedure needs to be performed\nfor a UE, the AMF has not received the service-level device ID set to\nthe CAA-level UAV ID in the Service-level-AA container IE of the\nREGISTRATION REQUEST message from the UE and the AMF decides to accept\nthe UE to be registered for other services than UAS services based on\nthe user\\'s subscription data and the operator policy, the AMF shall\naccept the initial registration request and shall mark in the UE\\'s 5GMM\ncontext that the UE is not allowed to request UAS services.  \nIf the UE supports MINT, the AMF may include the List of PLMNs to be\nused in disaster condition IE in the REGISTRATION ACCEPT message.  \nIf the UE supports MINT, the AMF may include the Disaster roaming wait\nrange IE in the REGISTRATION ACCEPT message.  \nIf the UE supports MINT, the AMF may include the Disaster return wait\nrange IE in the REGISTRATION ACCEPT message.  \nNOTE 8: The AMF can determine the contents of the \\\"list of PLMN(s) to\nbe used in disaster condition\\\", the value of the disaster roaming wait\nrange and the value of the disaster return wait range based on the\nnetwork local configuration.  \nIf the AMF received the list of TAIs from the satellite NG-RAN as\ndescribed in 3GPP TS 23.501 \\[8\\], and determines that, by UE\nsubscription and operator\\'s preferences, any but not all TAIs in the\nreceived list of TAIs is forbidden for roaming or for regional provision\nof service, the AMF shall include the TAI(s) in:  \na\\) the Forbidden TAI(s) for the list of \\\"5GS forbidden tracking areas\nfor roaming\\\" IE; or  \nb\\) the Forbidden TAI(s) for the list of \\\"5GS forbidden tracking areas\nfor regional provision of service\\\" IE; or  \nc\\) both;  \nin the REGISTRATION ACCEPT message.  \nNOTE 9: Void.  \nIf the UE has set the Reconnection to the network due to RAN timing\nsynchronization status change (RANtiming) bit to \\\"Reconnection to the\nnetwork due to RAN timing synchronization status change supported\\\" in\nthe 5GMM capability IE of the REGISTRATION REQUEST message, the AMF may\ninclude the RAN timing synchronization IE with the RecReq bit set to\n\\\"Reconnection requested\\\" in the REGISTRATION ACCEPT message.  \nIf the AMF receives the initial registration request along with the\nmobile IAB-indication over N2 reference point (see TS 38.413 \\[31\\])\nfrom UE and the UE is authorized to operate as an MBSR based on the\nsubscription information and local policy (see 3GPP TS 23.501 \\[8\\]),\nthe AMF shall include the Feature authorization indication IE in the\nREGISTRATION ACCEPT message and shall set the MBSRAI field to\n\\\"authorized to operate as MBSR\\\". If the AMF receives the initial\nregistration request along with the mobile IAB-indication over N2\nreference point (see TS 38.413 \\[31\\]) from UE and the UE is not\nauthorized to operate as an MBSR based on the subscription information\nand local policy but can operate as a UE, the AMF shall include the\nFeature authorization indication IE in the REGISTRATION ACCEPT message\nand shall set the MBSRAI field to \\\"not authorized to operate as MBSR\nbut allowed to operate as a UE\\\".  \nIf the UE supports user plane positioning using LCS-UPP, SUPL, or both,\nthe AMF shall set the LCS-UPP bit, the SUPL bit, or both in the 5GS\nnetwork feature support IE of the REGISTRATION ACCEPT message as\nspecified in 3GPP TS 24.572 \\[64\\].  \nUpon receipt of the REGISTRATION ACCEPT message, the UE shall reset the\nregistration attempt counter, enter state 5GMM-REGISTERED and set the\n5GS update status to 5U1 UPDATED.  \nIf the UE receives the REGISTRATION ACCEPT message from a PLMN, then the\nUE shall reset the PLMN-specific attempt counter for that PLMN for the\nspecific access type for which the message was received. The UE shall\nalso reset the PLMN-specific N1 mode attempt counter for that PLMN for\nthe specific access type for which the message was received. If the\nmessage was received via 3GPP access, the UE shall reset the counter for\n\\\"SIM/USIM considered invalid for GPRS services\\\" events and the counter\nfor \\\"SIM/USIM considered invalid for non-GPRS services\\\" events, if\nany. If the message was received via non-3GPP access, the UE shall reset\nthe counter for \\\"USIM considered invalid for 5GS services over\nnon-3GPP\\\" events.  \nIf the UE receives the REGISTRATION ACCEPT message from an SNPN, then\nthe UE shall reset the SNPN-specific attempt counter for the current\nSNPN for the specific access type for which the message was received. If\nthe message was received via 3GPP access, the UE shall reset the counter\nfor \\\"the entry for the current SNPN considered invalid for 3GPP\naccess\\\" events. If the message was received via non-3GPP access, the UE\nshall reset the counter for \\\"the entry for the current SNPN considered\ninvalid for non-3GPP access\\\" events.  \nIf the REGISTRATION ACCEPT message included a T3512 value IE, the UE\nshall use the value in the T3512 value IE as periodic registration\nupdate timer (T3512).  \nIf the REGISTRATION ACCEPT message include a T3324 value IE, the UE\nshall use the value in the T3324 value IE as active timer (T3324).  \nIf the REGISTRATION ACCEPT message included a non-3GPP de-registration\ntimer value IE, the UE shall use the value in non-3GPP de-registration\ntimer value IE as non-3GPP de-registration timer.  \nIf the REGISTRATION ACCEPT message contains  \na\\) the Network slicing indication IE with the Network slicing\nsubscription change indication set to \\\"Network slicing subscription\nchanged\\\";  \nb\\) a Configured NSSAI IE with a new configured NSSAI for the current\nPLMN or SNPN and optionally the mapped S-NSSAI(s) for the configured\nNSSAI for the current PLMN or SNPN;  \nc\\) an NSSRG information IE with a new NSSRG information;  \nd\\) an Alternative NSSAI IE with a new alternative NSSAI;  \ne\\) an S-NSSAI location validity information in the Registration accept\ntype 6 IE container IE with a new S-NSSAI location validity information;\nor  \nf\\) an S-NSSAI time validity information IE with a new S-NSSAI time\nvalidity information,  \nthe UE shall return a REGISTRATION COMPLETE message to the AMF to\nacknowledge the successful update of the network slicing information. If\nthe UE has set the RCMAN bit to \\\"Sending of REGISTRATION COMPLETE\nmessage for NSAG information supported\\\" in the 5GMM capability IE of\nthe REGISTRATION REQUEST message and if REGISTRATION ACCEPT message\ncontains the NSAG information IE, the UE shall return REGISTRATION\nCOMPLETE message to the AMF to acknowledge the reception of the NSAG\ninformation IE.  \nNOTE 9A: When the UE receives the NSSRG information IE, the UE may\nprovide the NSSRG information to lower layers for the purpose of\nNSAG-aware cell reselection.  \nIf the REGISTRATION ACCEPT message contains the CAG information list IE\nor the Extended CAG information list IE and the UE had set the CAG bit\nto \\\"CAG supported\\\" in the 5GMM capability IE of the REGISTRATION\nREQUEST message, the UE shall:  \na\\) replace the \\\"CAG information list\\\" stored in the UE with the\nreceived CAG information list IE or the Extended CAG information list IE\nwhen received in the HPLMN or EHPLMN;  \nNOTE 10: When the UE receives the CAG information list IE or the\nExtended CAG information list IE in the HPLMN whose PLMN code is derived\nfrom the IMSI, the EHPLMN list is present and is not empty and the HPLMN\nis not present in the EHPLMN list, the UE behaves as if it receives the\nCAG information list IE or the Extended CAG information list IE in a\nVPLMN.  \nb\\) replace the serving VPLMN\\'s entry of the \\\"CAG information list\\\"\nstored in the UE with the serving VPLMN\\'s entry of the received CAG\ninformation list IE or the Extended CAG information list IE when the UE\nreceives the CAG information list IE or the Extended CAG information\nlist IE in a serving PLMN other than the HPLMN or EHPLMN; or  \nNOTE 11: When the UE receives the CAG information list IE or the\nExtended CAG information list IE in a serving PLMN other than the HPLMN\nor EHPLMN, entries of a PLMN other than the serving VPLMN, if any, in\nthe received CAG information list IE or the Extended CAG information\nlist IE are ignored.  \nc\\) remove the serving VPLMN\\'s entry of the \\\"CAG information list\\\"\nstored in the UE when the UE receives the CAG information list IE or the\nExtended CAG information list IE in a serving PLMN other than the HPLMN\nor EHPLMN and the CAG information list IE or the Extended CAG\ninformation list IE does not contain the serving VPLMN\\'s entry.  \nThe UE shall store the \\\"CAG information list\\\" received in the CAG\ninformation list IE or the Extended CAG information list IE as specified\nin annex C.  \nIf the received \\\"CAG information list\\\" includes an entry containing\nthe identity of the registered PLMN, the UE shall operate as follows:  \na\\) if the UE receives the REGISTRATION ACCEPT message via a CAG cell,\nnone of the CAG-ID(s) supported by the current CAG cell is authorized\nbased on the \\\"Allowed CAG list\\\" of the entry for the registered PLMN\nin the received \\\"CAG information list\\\", and:  \n1\\) the entry for the registered PLMN in the received \\\"CAG information\nlist\\\" does not include an \\\"indication that the UE is only allowed to\naccess 5GS via CAG cells\\\", then the UE shall enter the state\n5GMM-REGISTERED.LIMITED-SERVICE and shall search for a suitable cell\naccording to 3GPP TS 38.304 \\[28\\] or 3GPP TS 36.304 \\[25C\\] with the\nupdated \\\"CAG information list\\\"; or  \n2\\) the entry for the registered PLMN in the received \\\"CAG information\nlist\\\" includes an \\\"indication that the UE is only allowed to access\n5GS via CAG cells\\\" and:  \ni\\) if one or more CAG-ID(s) are authorized based on the \\\"Allowed CAG\nlist\\\" of the entry for the registered PLMN in the received \\\"CAG\ninformation list\\\", the UE shall enter the state\n5GMM-REGISTERED.LIMITED-SERVICE and shall search for a suitable cell\naccording to 3GPP TS 38.304 \\[28\\] with the updated \\\"CAG information\nlist\\\"; or  \nii\\) if no CAG-ID is authorized based on the \\\"Allowed CAG list\\\" of the\nentry for the registered PLMN in the received \\\"CAG information list\\\",\nthe UE has not set the 5GS registration type IE in the REGISTRATION\nREQUEST message to \\\"emergency registration\\\", and the initial\nregistration was not initiated to perform handover of an existing\nemergency PDU session from the non-current access to the current access,\nthen the UE shall enter the state 5GMM-REGISTERED.PLMN-SEARCH and shall\napply the PLMN selection process defined in 3GPP TS 23.122 \\[5\\] with\nthe updated \\\"CAG information list\\\"; or  \nb\\) if the UE receives the REGISTRATION ACCEPT message via a non-CAG\ncell and the entry for the registered PLMN in the received \\\"CAG\ninformation list\\\" includes an \\\"indication that the UE is only allowed\nto access 5GS via CAG cells\\\" and:  \n1\\) if one or more CAG-ID(s) are authorized based on the \\\"allowed CAG\nlist\\\" for the registered PLMN in the received \\\"CAG information list\\\",\nthe UE shall enter the state 5GMM-REGISTERED.LIMITED-SERVICE and shall\nsearch for a suitable cell according to 3GPP TS 38.304 \\[28\\] with the\nupdated \\\"CAG information list\\\"; or  \n2\\) if no CAG-ID is authorized based on the \\\"Allowed CAG list\\\" of the\nentry for the registered PLMN in the received \\\"CAG information list\\\",\nthe UE has not set the 5GS registration type IE in the REGISTRATION\nREQUEST message to \\\"emergency registration\\\", and the initial\nregistration was not initiated to perform handover of an existing\nemergency PDU session from the non-current access to the current access,\nthen the UE shall enter the state 5GMM-REGISTERED.PLMN-SEARCH and shall\napply the PLMN selection process defined in 3GPP TS 23.122 \\[5\\] with\nthe updated \\\"CAG information list\\\".  \nIf the received \\\"CAG information list\\\" does not include an entry\ncontaining the identity of the registered PLMN and the UE receives the\nREGISTRATION ACCEPT message via a CAG cell, the UE shall enter the state\n5GMM-REGISTERED.LIMITED-SERVICE and shall search for a suitable cell\naccording to 3GPP TS 38.304 \\[28\\] or 3GPP TS 36.304 \\[25C\\] with the\nupdated \\\"CAG information list\\\".  \nIf the REGISTRATION ACCEPT message contains the Operator-defined access\ncategory definitions IE, the Extended emergency number list IE ,the CAG\ninformation list IE or the Extended CAG information list IE, the UE\nshall return a REGISTRATION COMPLETE message to the AMF to acknowledge\nreception of the operator-defined access category definitions, the\nextended local emergency numbers list or the \\\"CAG information list\\\".  \nIf the UE has set the RCMAP bit to \\\"Sending of REGISTRATION COMPLETE\nmessage for negotiated PEIPS parameters supported\\\" in the 5GMM\ncapability IE of the REGISTRATION REQUEST message and if REGISTRATION\nACCEPT message contains the Negotiated PEIPS assistance information IE,\nthe UE shall return REGISTRATION COMPLETE message to the AMF to\nacknowledge the reception of the Negotiated PEIPS assistance information\nIE.  \nIf the REGISTRATION ACCEPT message contains the UE radio capability ID\nIE or the UE radio capability ID deletion indication IE, the UE shall\nreturn a REGISTRATION COMPLETE message to the AMF to acknowledge\nreception of the UE radio capability ID IE or the UE radio capability ID\ndeletion indication IE.  \nUpon receiving a REGISTRATION COMPLETE message, the AMF shall stop timer\nT3550 and change to state 5GMM-REGISTERED. The 5G-GUTI, if sent in the\nREGISTRATION ACCEPT message, shall be considered as valid, the PEIPS\nassistance information, if sent in the REGISTRATION ACCEPT message,\nshall be considered as valid, and the UE radio capability ID, if sent in\nthe REGISTRATION ACCEPT, shall be considered as valid.  \nIf the 5GS update type IE was included in the REGISTRATION REQUEST\nmessage with the SMS requested bit set to \\\"SMS over NAS supported\\\",\nand SMSF selection is successful, then the AMF shall send the\nREGISTRATION ACCEPT message after the SMSF has confirmed that the\nactivation of the SMS service was successful. When sending the\nREGISTRATION ACCEPT message, the AMF shall:  \na\\) set the SMS allowed bit of the 5GS registration result IE to \\\"SMS\nover NAS allowed\\\" in the REGISTRATION ACCEPT message, if the UE has set\nthe SMS requested bit of the 5GS update type IE to \\\"SMS over NAS\nsupported\\\" in the REGISTRATION REQUEST message and the network allows\nthe use of SMS over NAS for the UE; and  \nb\\) store the SMSF address and the value of the SMS allowed bit of the\n5GS registration result IE in the UE 5GMM context and consider the UE\navailable for SMS over NAS.  \nIf:  \na\\) the SMSF selection in the AMF is not successful;  \nb\\) the SMS activation via the SMSF is not successful;  \nc\\) the AMF does not allow the use of SMS over NAS;  \nd\\) the SMS requested bit of the 5GS update type IE was set to \\\"SMS\nover NAS not supported\\\" in the REGISTRATION REQUEST message; or  \ne\\) the 5GS update type IE was not included in the REGISTRATION REQUEST\nmessage;  \nthen the AMF shall set the SMS allowed bit of the 5GS registration\nresult IE to \\\"SMS over NAS not allowed\\\" in the REGISTRATION ACCEPT\nmessage.  \nWhen the UE receives the REGISTRATION ACCEPT message, if the UE is also\nregistered over another access to the same PLMN, the UE considers the\nvalue indicated by the SMS allowed bit of the 5GS registration result IE\nas applicable for both accesses over which the UE is registered.  \nThe AMF shall include the 5GS registration result IE in the REGISTRATION\nACCEPT message. If the 5GS registration result value in the 5GS\nregistration result IE indicates:  \na\\) \\\"3GPP access\\\", the UE:  \n\\- shall consider itself as being registered to 3GPP access; and  \n\\- if in 5GMM-REGISTERED state over non-3GPP access and on the same PLMN\nor SNPN as 3GPP access, shall enter state\n5GMM-DEREGISTERED.ATTEMPTING-REGISTRATION over non-3GPP access and set\nthe 5GS update status to 5U2 NOT UPDATED over non-3GPP access; or  \nb\\) \\\"Non-3GPP access\\\", the UE:  \n\\- shall consider itself as being registered to non-3GPP access; and  \n\\- if in the 5GMM-REGISTERED state over 3GPP access and is on the same\nPLMN or SNPN as non-3GPP access, shall enter the state\n5GMM-DEREGISTERED.ATTEMPTING-REGISTRATION over 3GPP access and set the\n5GS update status to 5U2 NOT UPDATED over 3GPP access; or  \nc\\) \\\"3GPP access and non-3GPP access\\\", the UE shall consider itself as\nbeing registered to both 3GPP access and non-3GPP access.  \nIn roaming scenarios, the AMF shall provide mapped S-NSSAI(s) for the\nconfigured NSSAI, the allowed NSSAI, the partially allowed NSSAI, the\nrejected NSSAI (if Extended rejected NSSAI IE is used) , the partially\nrejected NSSAI, the pending NSSAI or NSSRG information when included in\nthe REGISTRATION ACCEPT message.  \nThe AMF shall include the allowed NSSAI for the current PLMN or SNPN and\nshall include the mapped S-NSSAI(s) for the allowed NSSAI contained in\nthe requested NSSAI from the UE if available, in the REGISTRATION ACCEPT\nmessage if the UE included the requested NSSAI in the REGISTRATION\nREQUEST message and the AMF allows one or more S-NSSAIs in the requested\nNSSAI. Additionally, if the AMF allows one or more subscribed S-NSSAIs\nfor the UE, the AMF may include the allowed subscribed S-NSSAI(s) in the\nallowed NSSAI in the REGISTRATION ACCEPT message.  \nThe AMF may also include rejected NSSAI in the REGISTRATION ACCEPT\nmessage if the initial registration request is not for onboarding\nservices in SNPN. If the UE has set the ER-NSSAI bit to \\\"Extended\nrejected NSSAI supported\\\" in the 5GMM capability IE of the REGISTRATION\nREQUEST message, the rejected NSSAI shall be included in the Extended\nrejected NSSAI IE in the REGISTRATION ACCEPT message; otherwise the\nrejected NSSAI shall be included in the Rejected NSSAI IE in the\nREGISTRATION ACCEPT message. If the initial registration request is for\nonboarding services in SNPN, the AMF shall not include rejected NSSAI in\nthe REGISTRATION ACCEPT message.  \nIf the UE has indicated the support for partial network slice and the\nAMF determines one or more S-NSSAI(s) in the requested NSSAI are to be\nincluded in the partially rejected NSSAI as specified in\nsubclause 4.6.2.11, the AMF shall include the Partially rejected NSSAI\nIE in the Registration accept type 6 IE container IE of the REGISTRATION\nACCEPT message.  \nIf the UE receives the Partially rejected NSSAI IE in the Registration\naccept type 6 IE container IE of the REGISTRATION ACCEPT message, the UE\nshall store the partially rejected NSSAI as specified in\nsubclause 4.6.2.2.  \nIf the UE has set the ER-NSSAI bit to \\\"Extended rejected NSSAI\nsupported\\\" in the 5GMM capability IE of the REGISTRATION REQUEST\nmessage, the rejected NSSAI contains S-NSSAI(s) which was included in\nthe requested NSSAI but rejected by the network associated with\nrejection cause(s); otherwise the rejected NSSAI contains S-NSSAI(s)\nwhich was included in the requested NSSAI but rejected by the network\nassociated with rejection cause(s) with the following restrictions:  \na\\) rejected NSSAI for the current PLMN or SNPN shall not include an\nS-NSSAI for the current PLMN or SNPN which is associated to multiple\nmapped S-NSSAIs and some of these but not all mapped S-NSSAIs are not\nallowed; and  \nb\\) rejected NSSAI for the current registration area shall not include\nan S-NSSAI for the current PLMN or SNPN which is associated to multiple\nmapped S-NSSAIs and some of these but not all mapped S-NSSAIs are not\nallowed.  \nNOTE 12: The UE that does not support extended rejected NSSAI can avoid\nrequesting an S-NSSAI associated with a mapped S-NSSAI, which was\nincluded in the previous requested NSSAI but neither in the allowed\nNSSAI nor in the rejected NSSAI in the consequent registration\nprocedures.  \nIf the UE indicated the support for network slice-specific\nauthentication and authorization, and if the Requested NSSAI IE includes\none or more S-NSSAIs subject to network slice-specific authentication\nand authorization, the AMF shall in the REGISTRATION ACCEPT message\ninclude:  \na\\) the allowed NSSAI containing the S-NSSAI(s) or the mapped\nS-NSSAI(s), if any:  \n1\\) which are not subject to network slice-specific authentication and\nauthorization and are allowed by the AMF; or  \n2\\) for which the network slice-specific authentication and\nauthorization has been successfully performed;  \naa) the partially allowed NSSAI containing the S-NSSAI(s) or the mapped\nS-NSSAI(s), if any:  \n1\\) which are not subject to network slice-specific authentication and\nauthorization and are allowed by the AMF; or  \n2\\) for which the network slice-specific authentication and\nauthorization has been successfully performed;  \nb\\) optionally, the rejected NSSAI;  \nba) optionally, the partially rejected NSSAI;  \nc\\) pending NSSAI containing one or more S-NSSAIs for which network\nslice-specific authentication and authorization (except for re-NSSAA)\nwill be performed or is ongoing, and one or more S-NSSAIs from the\npending NSSAI which the AMF provided to the UE during the previous\nregistration procedure for which network slice-specific authentication\nand authorization will be performed or is ongoing, if any; and  \nd\\) the \\\"NSSAA to be performed\\\" indicator in the 5GS registration\nresult IE set to indicate that the network slice-specific authentication\nand authorization procedure will be performed by the network, if the\nallowed NSSAI is not included in the REGISTRATION ACCEPT message.  \nIf the initial registration request is not for onboarding services in\nSNPN, the UE indicated the support for network slice-specific\nauthentication and authorization, and:  \na\\) the UE did not include the requested NSSAI in the REGISTRATION\nREQUEST message or none of the S-NSSAIs in the requested NSSAI in the\nREGISTRATION REQUEST message are allowed;  \nb\\) all default S-NSSAIs are subject to network slice-specific\nauthentication and authorization; and  \nc\\) the network slice-specific authentication and authorization\nprocedure has not been successfully performed for any of the default\nS-NSSAIs,  \nthe AMF shall in the REGISTRATION ACCEPT message include:  \na\\) the \\\"NSSAA to be performed\\\" indicator in the 5GS registration\nresult IE to indicate that the network slice-specific authentication and\nauthorization procedure will be performed by the network;  \nb\\) pending NSSAI containing one or more default S-NSSAIs for which\nnetwork slice-specific authentication and authorization will be\nperformed or is ongoing and one or more S-NSSAIs from the pending NSSAI\nwhich the AMF provided to the UE during the previous registration\nprocedure for which network slice-specific authentication and\nauthorization will be performed or is ongoing (if any);  \nc\\) optionally, the rejected NSSAI; and  \ne\\) optionally, the partially rejected NSSAI.  \nIf the initial registration request is not for onboarding services in\nSNPN, the UE indicated the support for network slice-specific\nauthentication and authorization, and:  \na\\) the UE did not include the requested NSSAI in the REGISTRATION\nREQUEST message or none of the S-NSSAIs in the requested NSSAI in the\nREGISTRATION REQUEST message are allowed; and  \nb\\) one or more default S-NSSAIs are not subject to network\nslice-specific authentication and authorization or the network\nslice-specific authentication and authorization procedure has been\nsuccessfully performed for one or more default S-NSSAIs;  \nthe AMF shall in the REGISTRATION ACCEPT message include:  \na\\) pending NSSAI containing one or more default S-NSSAIs for which\nnetwork slice-specific authentication and authorization will be\nperformed or is ongoing (if any) and one or more S-NSSAIs from the\npending NSSAI which the AMF provided to the UE during the previous\nregistration procedure for which network slice-specific authentication\nand authorization will be performed or is ongoing (if any);  \nb\\) allowed NSSAI containing S-NSSAI(s) for the current PLMN each of\nwhich corresponds to a default S-NSSAI which are not subject to network\nslice-specific authentication and authorization or for which the network\nslice-specific authentication and authorization has been successfully\nperformed;  \nc\\) allowed NSSAI containing one or more default S-NSSAIs, as the mapped\nS-NSSAI(s) for the allowed NSSAI in roaming scenarios, which are not\nsubject to network slice-specific authentication and authorization or\nfor which the network slice-specific authentication and authorization\nhas been successfully performed; and  \nd\\) optionally, the rejected NSSAI.  \nIf the UE did not include the requested NSSAI in the REGISTRATION\nREQUEST message or none of the S-NSSAIs in the requested NSSAI in the\nREGISTRATION REQUEST message are allowed, the allowed NSSAI shall not\ncontain default S-NSSAI(s) that are subject to NSAC. If the subscription\ninformation includes the NSSRG information, the S-NSSAIs of the allowed\nNSSAI shall be associated with at least one common NSSRG value.  \nWhen the REGISTRATION ACCEPT message includes a pending NSSAI, the\npending NSSAI shall contain all S-NSSAIs for which network\nslice-specific authentication and authorization (except for re-NSSAA)\nwill be performed or is ongoing from the requested NSSAI of the\nREGISTRATION REQUEST message that was received over the 3GPP access,\nnon-3GPP access, or both the 3GPP access and non-3GPP access.  \nIf the UE supports extended rejected NSSAI and the AMF determines that\nmaximum number of UEs reached for one or more S-NSSAI(s) in the\nrequested NSSAI as specified in subclause 4.6.2.5, the AMF shall include\nthe rejected NSSAI containing one or more S-NSSAIs with the rejection\ncause \\\"S-NSSAI not available due to maximum number of UEs reached\\\" in\nthe Extended rejected NSSAI IE in the REGISTRATION ACCEPT message. In\naddition, the AMF may include a back-off timer value for each S-NSSAI\nwith the rejection cause \\\"S-NSSAI not available due to maximum number\nof UEs reached\\\" included in the Extended rejected NSSAI IE of the\nREGISTRATION ACCEPT message. To avoid that large numbers of UEs\nsimultaneously initiate deferred requests, the network should select the\nvalue for the backoff timer for each S-NSSAI for the informed UEs so\nthat timeouts are not synchronised.  \nIf the UE does not indicate support for extended rejected NSSAI and the\nmaximum number of UEs has been reached, the AMF should include the\nrejected NSSAI containing one or more S-NSSAIs with the rejection cause\n\\\"S-NSSAI not available in the current registration area\\\" in the\nRejected NSSAI IE and should not include these S-NSSAIs in the allowed\nNSSAI in the REGISTRATION ACCEPT message.  \nNOTE 13: Based on network policies, the AMF can include the S-NSSAI(s)\nfor which the maximum number of UEs has been reached in the rejected\nNSSAI with rejection causes other than \\\"S-NSSAI not available in the\ncurrent registration area\\\".  \nIf the UE indicates the support for the network slice usage control and\nthe AMF determines to provide on-demand NSSAI, the AMF shall include the\nOn-demand NSSAI IE in the REGISTRATION ACCEPT message.  \nIf the UE supports network slice usage control and the AMF determines to\nprovide on-demand NSSAI, the AMF shall include the On-demand NSSAI IE in\nthe REGISTRATION ACCEPT message.  \nIf the UE receives the On-demand NSSAI IE in the REGISTRATION ACCEPT\nmessage, the UE shall store the on-demand NSSAI as specified in\nsubclause 4.6.2.2.  \nIf the AMF has a new configured NSSAI for the current PLMN or SNPN, the\nAMF shall include the configured NSSAI for the current PLMN or SNPN in\nthe REGISTRATION ACCEPT message.  \nNOTE 13A: A new configured NSSAI can be available at the AMF following\nan indication that the subscription data for network slicing has\nchanged.  \nThe AMF may include a new configured NSSAI for the current PLMN or SNPN\nin the REGISTRATION ACCEPT message if:  \na\\) the REGISTRATION REQUEST message did not include the requested NSSAI\nand the initial registration request is not for onboarding services in\nSNPN;  \nb\\) the REGISTRATION REQUEST message included the requested NSSAI\ncontaining an S-NSSAI that is not valid in the serving PLMN or SNPN;  \nc\\) the REGISTRATION REQUEST message included the requested NSSAI\ncontaining S-NSSAI(s) with incorrect mapped S-NSSAI(s);  \nd\\) the REGISTRATION REQUEST message included the Network slicing\nindication IE with the Default configured NSSAI indication bit set to\n\\\"Requested NSSAI created from default configured NSSAI\\\";  \ne\\) the S-NSSAIs of the requested NSSAI in the REGISTRATION REQUEST\nmessage are not associated with any common NSSRG value, except for the\ncase that the AMF, based on the indication received from the UDM as\nspecified in 3GPP TS 23.501 \\[8\\], has provided all subscribed S-NSSAIs\nin the configured NSSAI to a UE who does not support NSSRG; or  \nNOTE 14: If the S-NSSAIs of the requested NSSAI in the REGISTRATION\nREQUEST message are not associated with any common NSSRG value, it is\npossible that at least one of the S-NSSAIs is not included in any of new\nallowed NSSAI, new (extended) rejected NSSAI (if applicable), and new\npending NSSAI (if applicable).  \nf\\) the UE is in 5GMM-REGISTERED state over the other access and the\nS-NSSAIs of the requested NSSAI in the REGISTRATION REQUEST message over\nthe current access and the allowed NSSAI over the other access are not\nassociated with any common NSSRG value.  \nThe AMF may include a new configured NSSAI for the current PLMN or SNPN\nin the REGISTRATION ACCEPT message if the REGISTRATION REQUEST message\nincludes a requested NSSAI containing an S-NSSAI and the S-NSSAI time\nvalidity information, if available, indicates that the S-NSSAI is not\navailable (see 3GPP TS 23.501 \\[8\\]). In this case, if the TempNS bit of\nthe 5GMM capability IE in the REGISTRATION REQUEST message is set to:  \na\\) \\\"S-NSSAI time validity information supported\\\" and the S-NSSAI time\nvalidity information indicates that the S-NSSAI will:  \n1\\) become available again, then the AMF shall also send S-NSSAI time\nvalidity information; or  \n2\\) not become available again, then the AMF shall not include the\nS-NSSAI in the new configured NSSAI; or  \nb\\) \\\"S-NSSAI time validity information not supported\\\" and the AMF\nsends a new configured NSSAI, then the AMF shall not include the S-NSSAI\nin the new configured NSSAI.  \nIf a new configured NSSAI for the current PLMN is included in the\nREGISTRATION ACCEPT message, the subscription information includes the\nNSSRG information, and the NSSRG bit in the 5GMM capability IE of the\nREGISTRATION REQUEST message is set to:  \na\\) \\\"NSSRG supported\\\", then the AMF shall include the NSSRG\ninformation in the REGISTRATION ACCEPT message; or  \nb\\) \\\"NSSRG not supported\\\", then the configured NSSAI shall include one\nor more S-NSSAIs each of which is associated with all the NSSRG value(s)\nof the default S-NSSAI(s), or the configured NSSAI shall include, based\non the indication received from the UDM as specified in\n3GPP TS 23.501 \\[8\\], all subscribed S-NSSAIs even if these S-NSSAIs do\nnot share any common NSSRG value.  \nIf the AMF needs to update the NSSRG information and the UE has set the\nNSSRG bit to \\\"NSSRG supported\\\" in the 5GMM capability IE of the\nREGISTRATION REQUEST message, then the AMF shall include the new NSSRG\ninformation in the REGISTRATION ACCEPT message. In addition, the AMF\nshall start timer T3550 and enter state 5GMM-COMMON-PROCEDURE-INITIATED\nas described in subclause 5.1.3.2.3.3.  \nIf the UE supports S-NSSAI time validity information and the AMF needs\nto update the S-NSSAI time validity information, then the AMF shall\ninclude the S-NSSAI time validity information IE in the REGISTRATION\nACCEPT message. In addition, the AMF shall start timer T3550 and enter\nstate 5GMM-COMMON-PROCEDURE-INITIATED as described in\nsubclause 5.1.3.2.3.3.  \nIf the UE supports S-NSSAI location validity information and the AMF\nneeds to update the S-NSSAI location validity information, then the AMF\nshall include the new S-NSSAI location validity information in the\nRegistration accept type 6 IE container IE of the REGISTRATION ACCEPT\nmessage. In addition, the AMF shall start timer T3550 and enter state\n5GMM-COMMON-PROCEDURE-INITIATED as described in subclause 5.1.3.2.3.3.  \nIf the UE has set the NSAG bit to \\\"NSAG supported\\\" in the 5GMM\ncapability IE of the REGISTRATION REQUEST message over 3GPP access, the\nAMF may include the NSAG information IE in the REGISTRATION ACCEPT\nmessage. Up to 4 NSAG entries are allowed to be associated with a TAI\nlist in the NSAG information IE. If the UE has set the RCMAN bit to\n\\\"Sending of REGISTRATION COMPLETE message for NSAG information\nsupported\\\" in the 5GMM capability IE of the REGISTRATION REQUEST\nmessage and if the NSAG information IE is included in the REGISTRATION\nACCEPT message, the AMF shall start timer T3550 and enter state\n5GMM-COMMON-PROCEDURE-INITIATED as described in subclause 5.1.3.2.3.3.  \nNOTE 14a: How the AMF selects NSAG entries to be included in the NSAG\ninformation IE is implementation specific, e.g. take the NSAG priority\nand the current registration area into account.  \nNOTE 14b: If the NSAG for the PLMN and its equivalent PLMN(s) have\ndifferent associations with S-NSSAIs, then the AMF includes a TAI list\nfor the NSAG entry in the NSAG information IE.  \nIf the UE receives the NSAG information IE in the REGISTRATION ACCEPT\nmessage, the UE shall store the NSAG information as specified in\nsubclause 4.6.2.2.  \nIf the UE supports network slice replacement and the AMF determines to\nprovide the mapping information between the S-NSSAI to be replaced and\nthe alternative S-NSSAI to the UE, then the AMF shall include the\nAlternative NSSAI IE, the Allowed NSSAI IE including the alternative\nS-NSSAI, if not included in the current allowed NSSAI, and the\nConfigured NSSAI IE including the alternative S-NSSAI, if not included\nin the current configured NSSAI, in the REGISTRATION ACCEPT message. If\nthe AMF determines that the S-NSSAI which has been replaced is\navailable, then the AMF shall provide the updated alternative NSSAI\nexcluding the S-NSSAI which has been replaced and the corresponding\nalternative S-NSSAI in the Alternative NSSAI IE in the REGISTRATION\nACCEPT message. If the AMF determines that all the S-NSSAI(s) which have\nbeen replaced are available, then the AMF shall provide the Alternative\nNSSAI IE with Length of Alternative NSSAI contents set to 0 in the\nREGISTRATION ACCEPT message. In addition, the AMF shall start timer\nT3550 and enter state 5GMM-COMMON-PROCEDURE-INITIATED as described in\nsubclause 5.1.3.2.3.3. If the AMF determines that the S-NSSAI which has\nbeen replaced is not supported due to the UE moving outside of NS-AoS of\nthe S-NSSAI while the alternative S-NSSAI is available, then the AMF\nshall provide the updated allowed NSSAI excluding the S-NSSAI which has\nbeen replaced in the REGISTRATION ACCEPT message.  \nIf the UE receives the Alternative NSSAI IE in the REGISTRATION ACCEPT\nmessage, the UE shall store the alternative NSSAI as specified in\nsubclause 4.6.2.2.  \nIf the UE has indicated the support for partial network slice and the\nAMF determines one or more S-NSSAI(s) in the requested NSSAI are to be\nincluded in the partially allowed NSSAI as specified in\nsubclause 4.6.2.11, the AMF shall include the Partially allowed NSSAI IE\nin the Registration accept type 6 IE container IE of the REGISTRATION\nACCEPT message.  \nIf the UE receives the Partially allowed NSSAI IE in the Registration\naccept type 6 IE container IE of the REGISTRATION ACCEPT message, the UE\nshall store the partially allowed NSSAI as specified in\nsubclause 4.6.2.2.  \nIf the UE requests ciphering keys for ciphered broadcast assistance data\nin the REGISTRATION REQUEST message and the AMF has valid ciphering key\ndata applicable to the UE\\'s subscription and current tracking area,\nthen the AMF shall include the ciphering key data in the Ciphering key\ndata IE of the REGISTRATION ACCEPT message.  \nThe AMF shall include the Network slicing indication IE with the Network\nslicing subscription change indication set to \\\"Network slicing\nsubscription changed\\\" in the REGISTRATION ACCEPT message if the UDM has\nindicated that the subscription data for network slicing has changed. In\nthis case the AMF shall start timer T3550 and enter state\n5GMM-COMMON-PROCEDURE-INITIATED as described in subclause 5.1.3.2.3.3.  \nThe UE that has indicated the support for network slice-specific\nauthentication and authorization receiving the pending NSSAI in the\nREGISTRATION ACCEPT message shall store the S-NSSAI(s) in the pending\nNSSAI as specified in subclause 4.6.2.2. If the registration area\ncontains TAIs belonging to different PLMNs, which are equivalent PLMNs,\nthe UE shall store the received pending NSSAI for each of the equivalent\nPLMNs as specified in subclause 4.6.2.2. If the pending NSSAI is not\nincluded in the REGISTRATION ACCEPT message and the \\\"NSSAA to be\nperformed\\\" indicator is not set to \\\"Network slice-specific\nauthentication and authorization is to be performed\\\" in the 5GS\nregistration result IE of the REGISTRATION ACCEPT message, then the UE\nshall delete the pending NSSAI for the current PLMN and its equivalent\nPLMN(s) or SNPN, if existing, as specified in subclause 4.6.2.2.  \nThe UE receiving the rejected NSSAI in the REGISTRATION ACCEPT message\ntakes the following actions based on the rejection cause in the rejected\nS-NSSAI(s):  \n\\\"S-NSSAI not available in the current PLMN or SNPN\\\"  \nThe UE shall add the rejected S-NSSAI(s) in the rejected NSSAI for the\ncurrent PLMN or SNPN as specified in subclause 4.6.2.2 and shall not\nattempt to use this S-NSSAI(s) in the current PLMN or SNPN over any\naccess until switching off the UE, the UICC containing the USIM is\nremoved, the entry of the \\\"list of subscriber data\\\" with the SNPN\nidentity of the current SNPN is updated, or the rejected S-NSSAI(s) are\nremoved as described in subclause 4.6.2.2.  \n\\\"S-NSSAI not available in the current registration area\\\"  \nThe UE shall add the rejected S-NSSAI(s) in the rejected NSSAI for the\ncurrent registration area as specified in subclause 4.6.2.2 and shall\nnot attempt to use this S-NSSAI(s) in the current registration area over\nthe current until switching off the UE, the UE moving out of the current\nregistration area, the UICC containing the USIM is removed, the entry of\nthe \\\"list of subscriber data\\\" with the SNPN identity of the current\nSNPN is updated, or the rejected S-NSSAI(s) are removed as described in\nsubclause 4.6.2.2.  \n\\\"S-NSSAI not available due to the failed or revoked network\nslice-specific authentication and authorization\\\"  \nThe UE shall store the rejected S-NSSAI(s) in the rejected NSSAI for the\nfailed or revoked NSSAA as specified in subclause 4.6.2.2 and shall not\nattempt to use this S-NSSAI in the current PLMN or SNPN over any access\nuntil switching off the UE, the UICC containing the USIM is removed, the\nentry of the \\\"list of subscriber data\\\" with the SNPN identity of the\ncurrent SNPN is updated, or the rejected S-NSSAI(s) are removed as\ndescribed in subclause 4.6.1 and 4.6.2.2.  \n\\\"S-NSSAI not available due to maximum number of UEs reached\\\"  \nUnless the back-off timer value received along with the S-NSSAI is zero,\nthe UE shall add the rejected S-NSSAI(s) in the rejected NSSAI for the\nmaximum number of UEs reached as specified in subclause 4.6.2.2 and\nshall not attempt to use this S-NSSAI in the current PLMN or SNPN over\nthe current access until switching off the UE, the UICC containing the\nUSIM is removed, the entry of the \\\"list of subscriber data\\\" with the\nSNPN identity of the current SNPN is updated, or the rejected S-NSSAI(s)\nare removed as described in subclauses 4.6.1 and 4.6.2.2.  \nNOTE 15: If the back-off timer value received along with the S-NSSAI in\nthe rejected NSSAI for the maximum number of UEs reached is zero as\nspecified in subclause 10.5.7.4a of 3GPP TS 24.008 \\[12\\], the UE does\nnot consider the S-NSSAI as the rejected S-NSSAI.  \nIf there is one or more S-NSSAIs in the rejected NSSAI with the\nrejection cause \\\"S-NSSAI not available due to maximum number of UEs\nreached\\\", then for each S-NSSAI, the UE shall behave as follows:  \na\\) stop the timer T3526 associated with the S-NSSAI, if running;  \nb\\) start the timer T3526 with:  \n1\\) the back-off timer value received along with the S-NSSAI, if a\nback-off timer value is received along with the S-NSSAI that is neither\nzero nor deactivated; or  \n2\\) an implementation specific back-off timer value, if no back-off\ntimer value is received along with the S-NSSAI; and  \nc\\) remove the S-NSSAI from the rejected NSSAI for the maximum number of\nUEs reached when the timer T3526 associated with the S-NSSAI expires.  \nIf the UE sets the NSSAA bit in the 5GMM capability IE to \\\"Network\nslice-specific authentication and authorization not supported\\\", and:  \na\\) if the Requested NSSAI IE only includes the S-NSSAI(s) subject to\nnetwork slice-specific authentication and authorization and one or more\ndefault S-NSSAIs (containing one or more S-NSSAIs each of which may be\nassociated with a new S-NSSAI) which are not subject to network\nslice-specific authentication and authorization are available, the AMF\nshall in the REGISTRATION ACCEPT message include:  \n1\\) the allowed NSSAI or the partially allowed NSSAI containing\nS-NSSAI(s) for the current PLMN or SNPN each of which corresponds to a\ndefault S-NSSAI which are not subject to network slice-specific\nauthentication and authorization;  \n2\\) the allowed NSSAI or the partially allowed NSSAI containing the\ndefault S-NSSAIs, as the mapped S-NSSAI(s) for the allowed NSSAI in\nroaming scenarios, which are not subject to network slice-specific\nauthentication and authorization; and  \n3\\) the rejected NSSAI containing the S-NSSAI(s) subject to network\nslice specific authentication and authorization with the rejection cause\nindicating \\\"S-NSSAI not available in the current PLMN or SNPN\\\", except\nif the UE has not set the ER-NSSAI bit to \\\"Extended rejected NSSAI\nsupported\\\" in the 5GMM capability IE of the REGISTRATION REQUEST\nmessage and the S-NSSAI(s) is associated to multiple mapped S-NSSAIs and\nsome of these but not all mapped S-NSSAIs are subject to NSSAA; or  \nb\\) if the Requested NSSAI IE includes one or more S-NSSAIs subject to\nnetwork slice-specific authentication and authorization, the AMF shall\nin the REGISTRATION ACCEPT message include:  \n1\\) the allowed NSSAI or the partially allowed NSSAI containing the\nS-NSSAI(s) or the mapped S-NSSAI(s) which are not subject to network\nslice-specific authentication and authorization; and  \n2\\) the rejected NSSAI containing:  \ni\\) the S-NSSAI(s) subject to network slice specific authentication and\nauthorization with the rejection cause indicating \\\"S-NSSAI not\navailable in the current PLMN or SNPN\\\", except if the UE has not set\nthe ER-NSSAI bit to \\\"Extended rejected NSSAI supported\\\" in the 5GMM\ncapability IE of the REGISTRATION REQUEST message and the S-NSSAI is\nassociated to multiple mapped S-NSSAIs and some of these but not all\nmapped S-NSSAIs are subject to NSSAA; and  \nii\\) the S-NSSAI(s) which was included in the requested NSSAI but\nrejected by the network associated with the rejection cause indicating\n\\\"S-NSSAI not available in the current PLMN or SNPN\\\" or the rejection\ncause indicating \\\"S-NSSAI not available in the current registration\narea\\\", if any.  \nIf the UE does not indicate support for network slice-specific\nauthentication and authorization, the initial registration request is\nnot for onboarding services in SNPN, and if:  \na\\) the UE did not include the requested NSSAI in the REGISTRATION\nREQUEST message; or  \nb\\) none of the S-NSSAIs in the requested NSSAI in the REGISTRATION\nREQUEST message are allowed;  \nand one or more default S-NSSAIs (containing one or more S-NSSAIs each\nof which may be associated with a new S-NSSAI) which are not subject to\nnetwork slice-specific authentication and authorization are available,\nthe AMF shall:  \na\\) put the allowed S-NSSAI(s) for the current PLMN or SNPN each of\nwhich corresponds to a default S-NSSAI and not subject to network\nslice-specific authentication and authorization in the allowed NSSAI of\nthe REGISTRATION ACCEPT message;  \nb\\) put the default S-NSSAIs and not subject to network slice-specific\nauthentication and authorization, as the mapped S-NSSAI(s) for the\nallowed NSSAI in roaming scenarios, in the allowed NSSAI of the\nREGISTRATION ACCEPT message; and  \nc\\) determine a registration area such that all S-NSSAIs of the allowed\nNSSAI are available in the registration area.  \nIf the REGISTRATION ACCEPT message contains the Network slicing\nindication IE with the Network slicing subscription change indication\nset to \\\"Network slicing subscription changed\\\", the UE shall delete the\nnetwork slicing information for each and every PLMN or SNPN except for\nthe current PLMN or SNPN as specified in subclause 4.6.2.2 and remove\nall tracking areas from the list of \\\"5GS forbidden tracking areas for\nroaming\\\" which were added due to rejection of S-NSSAI due to \\\"S-NSSAI\nnot available in the current registration area\\\".  \nIf the REGISTRATION ACCEPT message contains the allowed NSSAI, then the\nUE shall store the included allowed NSSAI together with the PLMN\nidentity of the registered PLMN or the SNPN identity of the registered\nSNPN and the registration area as specified in subclause 4.6.2.2. If the\nregistration area contains TAIs belonging to different PLMNs, which are\nequivalent PLMNs, the UE shall store the received allowed NSSAI in each\nof allowed NSSAIs which are associated with each of the PLMNs.  \nIf the REGISTRATION ACCEPT message contains a configured NSSAI IE with a\nnew configured NSSAI for the current PLMN or SNPN and optionally the\nmapped S-NSSAI(s) for the configured NSSAI for the current PLMN or SNPN,\nthe UE shall store the contents of the configured NSSAI IE as specified\nin subclause 4.6.2.2. In addition, if the REGISTRATION ACCEPT message\ncontains:  \na\\) an NSSRG information IE, the UE shall store the contents of the\nNSSRG information IE as specified in subclause 4.6.2.2. If the UE\nreceives a new configured NSSAI in the REGISTRATION ACCEPT message and\nno NSSRG information IE, the UE shall delete any stored NSSRG\ninformation, if any, as specified in subclause 4.6.2.2;  \nb\\) an S-NSSAI location validity information in the Registration accept\ntype 6 IE container IE, the UE shall store the contents of the S-NSSAI\nlocation validity information as specified in subclause 4.6.2.2. If the\nUE receives a Configured NSSAI IE in the REGISTRATION ACCEPT message and\nno S-NSSAI location validity information, the UE shall delete any stored\nS-NSSAI location validity information as specified in subclause 4.6.2.2;  \nc\\) an S-NSSAI time validity information IE, the UE shall store the\ncontents of the S-NSSAI time validity information IE as specified in\nsubclause 4.6.2.2. If the UE receives a Configured NSSAI IE in the\nREGISTRATION ACCEPT message and no S-NSSAI time validity information IE,\nthe UE shall delete any stored S-NSSAI time validity information as\nspecified in subclause 4.6.2.2; or  \nd\\) an On-demand NSSAI IE, the UE shall store the contents of the\nOn-demand NSSAI IE as specified in subclause 4.6.2.2. If the UE receives\na Configured NSSAI IE in the REGISTRATION ACCEPT message and no\nOn-demand NSSAI IE, the UE shall delete any stored on-demand NSSAI as\nspecified in subclause 4.6.2.2. The UE shall stop slice deregistration\ninactivity timer, if running for the S-NSSAI which is deleted from the\non-demand NSSAI.  \nIf the REGISTRATION ACCEPT message:  \na\\) includes the 5GS registration result IE with the \\\"NSSAA to be\nperformed\\\" indicator set to \\\"Network slice-specific authentication and\nauthorization is to be performed\\\";  \nb\\) includes a pending NSSAI;  \nc\\) does not include an allowed NSSAI; and  \nd\\) does not include an partially allowed NSSAI,  \nthe UE shall delete the stored allowed NSSAI, if any, as specified in\nsubclause 4.6.2.2, and the UE:  \na\\) shall not initiate a 5GSM procedure except for emergency services ;\nand  \nb\\) shall not initiate a service request procedure except for cases f),\ni), m) and o) in subclause 5.6.1.1;  \nc\\) shall not initiate an NAS transport procedure except for sending\nSMS, an LPP message, a UPP-CMI container, an SLPP message, a location\nservice message, an SOR transparent container, a UE policy container, a\nUE parameters update transparent container or a CIoT user data\ncontainer;  \nuntil the UE receives an allowed NSSAI, a partially allowed NSSAI, or\nboth.  \nIf the UE included S1 mode supported indication in the REGISTRATION\nREQUEST message, the AMF supporting interworking with EPS shall set the\nIWK N26 bit to either:  \na\\) \\\"interworking without N26 interface not supported\\\" if the AMF\nsupports N26 interface; or  \nb\\) \\\"interworking without N26 interface supported\\\" if the AMF does not\nsupport N26 interface  \nin the 5GS network feature support IE in the REGISTRATION ACCEPT\nmessage.  \nThe UE supporting S1 mode shall operate in the mode for interworking\nwith EPS as follows:  \na\\) if the IWK N26 bit in the 5GS network feature support IE is set to\n\\\"interworking without N26 interface not supported\\\", the UE shall\noperate in single-registration mode;  \nb\\) if the IWK N26 bit in the 5GS network feature support IE is set to\n\\\"interworking without N26 interface supported\\\" and the UE supports\ndual-registration mode, the UE may operate in dual-registration mode; or  \nNOTE 16: The registration mode used by the UE is implementation\ndependent.  \nc\\) if the IWK N26 bit in the 5GS network feature support IE is set to\n\\\"interworking without N26 interface supported\\\" and the UE only\nsupports single-registration mode, the UE shall operate in\nsingle-registration mode.  \nThe UE shall store the received interworking without N26 interface\nindicator for interworking with EPS as specified in annex C.1 and treat\nit as valid in the entire PLMN and its equivalent PLMN(s).  \nThe network informs the UE about the support of specific features, such\nas IMS voice over PS session, location services (5G-LCS), emergency\nservices, emergency services fallback, ATSSS and non-3GPP access path\nswitching, in the 5GS network feature support information element. In a\nUE with IMS voice over PS session capability, the IMS voice over PS\nsession indicator, the Emergency services support indicator, and the\nEmergency services fallback indicator shall be provided to the upper\nlayers. The upper layers take the IMS voice over PS session indicator\ninto account when selecting the access domain for voice sessions or\ncalls. In a UE with LCS capability, location services indicator (5G-LCS)\nshall be provided to the upper layers. When initiating an emergency\ncall, the upper layers also take the IMS voice over PS session\nindicator, the Emergency services support indicator, and the Emergency\nservices fallback indicator into account for the access domain\nselection. In a UE with the capability for ATSSS, the network support\nfor ATSSS shall be provided to the upper layers. If the UE receives the\n5GS network feature support IE with the ATSSS support indicator set to\n\\\"ATSSS not supported\\\", the UE shall perform a local release of the MA\nPDU session, if any. In a UE that supports non-3GPP access path\nswitching, the network support for non-3GPP access path switching shall\nbe provided to the upper layers. If the UE receives the 5GS network\nfeature support IE with the non-3GPP access path switching bit set to\n\\\"non-3GPP access path switching not supported\\\", the UE shall not\nperform the registration procedure for mobility registration update for\nnon-3GPP access path switching.  \nNOTE 17: If the UE is registered to different PLMNs over 3GPP and\nnon-3GPP accesses, the UE uses the capability received over non-3GPP\naccess to determine whether to initiate the registration procedure for\nmobility registration update for non-3GPP path switching.  \nThe AMF shall set the EMF bit in the 5GS network feature support IE to:  \na\\) \\\"Emergency services fallback supported in NR connected to 5GCN and\nE-UTRA connected to 5GCN\\\" if the network supports the emergency\nservices fallback procedure when the UE is in an NR cell connected to\n5GCN or an E-UTRA cell connected to 5GCN;  \nb\\) \\\"Emergency services fallback supported in NR connected to 5GCN\nonly\\\" if the network supports the emergency services fallback procedure\nwhen the UE is in an NR cell connected to 5GCN and does not support the\nemergency services fallback procedure when the UE is in an E-UTRA cell\nconnected to 5GCN;  \nc\\) \\\"Emergency services fallback supported in E-UTRA connected to 5GCN\nonly\\\" if the network supports the emergency services fallback procedure\nwhen the UE is in an E-UTRA cell connected to 5GCN and does not support\nthe emergency services fallback procedure when the UE is in an NR cell\nconnected to 5GCN; or  \nd\\) \\\"Emergency services fallback not supported\\\" if network does not\nsupport the emergency services fallback procedure when the UE is in any\ncell connected to 5GCN.  \nNOTE 18: If the emergency services are supported in neither the EPS nor\nthe 5GS homogeneously, based on operator policy, the AMF will set the\nEMF bit in the 5GS network feature support IE to \\\"Emergency services\nfallback not supported\\\".  \nNOTE 19: Even though the AMF\\'s support of emergency services fallback\nis indicated per RAT, the UE\\'s support of emergency services fallback\nis not per RAT, i.e. the UE\\'s support of emergency services fallback is\nthe same for both NR connected to 5GCN and E-UTRA connected to 5GCN.  \nAccess identity 1 is only applicable while the UE is in N1 mode. Access\nidentity 2 is only applicable while the UE is in N1 mode.  \nWhen the UE is registered to the same PLMN or SNPN over 3GPP and\nnon-3GPP access, the UE and the AMF maintain one MPS indicator and one\nMCS indicator that are common to both 3GPP and non-3GPP access. When the\nUE is registered to different PLMNs or SNPNs over 3GPP access and\nnon-3GPP access, the UE maintains two MPS indicators and two MCS\nindicators separately for different accesses i.e., an MPS indicator and\nan MCS indicator for the 3GPP access and another MPS indicator and an\nMCS indicator for the non-3GPP access. For both 3GPP and non-3GPP\naccess, the access identity is determined according to subclause 4.5.2:  \n\\- if the UE is not operating in SNPN access operation mode:  \na\\) the network informs the UE that the use of access identity 1 is\nvalid in the RPLMN or equivalent PLMN by setting the MPS indicator bit\nof the 5GS network feature support IE to \\\"Access identity 1 valid\\\", in\nthe REGISTRATION ACCEPT message. Based on operator policy, the AMF sets\nthe MPS indicator bit in the REGISTRATION ACCEPT message based on the\nMPS priority information in the user\\'s subscription context obtained\nfrom the UDM;  \nb\\) upon receiving a REGISTRATION ACCEPT message with the MPS indicator\nbit set to \\\"Access identity 1 valid\\\":  \n\\- via 3GPP access; or  \n\\- via non-3GPP access if the UE is registered to the same PLMN over\n3GPP access and non-3GPP access;  \nthe UE shall act as a UE with access identity 1 configured for MPS, as\ndescribed in subclause 4.5.2, in all NG-RAN of the registered PLMN and\nits equivalent PLMNs. The MPS indicator bit in the 5GS network feature\nsupport IE provided in the REGISTRATION ACCEPT message is valid in all\nNG-RAN of the registered PLMN and its equivalent PLMNs until the UE\nreceives a REGISTRATION ACCEPT message or a CONFIGURATION UPDATE COMMAND\nmessage with the MPS indicator bit set to \\\"Access identity 1 not\nvalid\\\":  \n\\- via 3GPP access; or  \n\\- via non-3GPP access if the UE is registered to the same PLMN over\n3GPP access and non-3GPP access; or  \nuntil the UE selects a non-equivalent PLMN over 3GPP access;  \nb1) upon receiving a REGISTRATION ACCEPT message with the MPS indicator\nbit set to \\\"Access identity 1 valid\\\":  \n\\- via non-3GPP access; or  \n\\- via 3GPP access if the UE is registered to the same PLMN over 3GPP\naccess and non-3GPP access;  \nthe UE shall act as a UE with access identity 1 configured for MPS, as\ndescribed in subclause 4.5.2, in non-3GPP access of the registered PLMN\nand its equivalent PLMNs. The MPS indicator bit in the 5GS network\nfeature support IE provided in the REGISTRATION ACCEPT message is valid\nin non-3GPP access of the registered PLMN and its equivalent PLMNs until\nthe UE receives a REGISTRATION ACCEPT message or a CONFIGURATION UPDATE\nCOMMAND message with the MPS indicator bit set to \\\"Access identity 1\nnot valid\\\":  \n\\- via non-3GPP access; or  \n\\- via 3GPP access if the UE is registered to the same PLMN over 3GPP\naccess and non-3GPP access; or  \nuntil the UE selects a non-equivalent PLMN over non-3GPP access;  \nc\\) the network informs the UE that the use of access identity 2 is\nvalid in the RPLMN or equivalent PLMN by setting the MCS indicator bit\nof the 5GS network feature support IE to \\\"Access identity 2 valid\\\", in\nthe REGISTRATION ACCEPT message. Based on operator policy, the AMF sets\nthe MCS indicator bit in the REGISTRATION ACCEPT message based on the\nMCS priority information in the user\\'s subscription context obtained\nfrom the UDM;  \nd\\) upon receiving a REGISTRATION ACCEPT message with the MCS indicator\nbit set to \\\"Access identity 2 valid\\\":  \n\\- via 3GPP access; or  \n\\- via non-3GPP access if the UE is registered to the same PLMN over\n3GPP access and non-3GPP access;  \nthe UE shall act as a UE with access identity 2 configured for MCS, as\ndescribed in subclause 4.5.2, in all NG-RAN of the registered PLMN and\nits equivalent PLMNs. The MCS indicator bit in the 5GS network feature\nsupport IE provided in the REGISTRATION ACCEPT message is valid in all\nNG-RAN of the registered PLMN and its equivalent PLMNs until the UE\nreceives a REGISTRATION ACCEPT message or a CONFIGURATION UPDATE COMMAND\nmessage with the MCS indicator bit set to \\\"Access identity 2 not\nvalid\\\":  \n\\- via 3GPP access; or  \n\\- via non-3GPP access if the UE is registered to the same PLMN over\n3GPP access and non-3GPP access; or  \nuntil the UE selects a non-equivalent PLMN over 3GPP access; and  \nd1) upon receiving a REGISTRATION ACCEPT message with the MCS indicator\nbit set to \\\"Access identity 2 valid\\\":  \n\\- via non-3GPP access; or  \n\\- via 3GPP access if the UE is registered to the same PLMN over 3GPP\naccess and non-3GPP access;  \nthe UE shall act as a UE with access identity 2 configured for MCS, as\ndescribed in subclause 4.5.2, in non-3GPP access of the registered PLMN\nand its equivalent PLMNs. The MCS indicator bit in the 5GS network\nfeature support IE provided in the REGISTRATION ACCEPT message is valid\nin non-3GPP access of the registered PLMN and its equivalent PLMNs until\nthe UE receives a REGISTRATION ACCEPT message or a CONFIGURATION UPDATE\nCOMMAND message with the MCS indicator bit set to \\\"Access identity 2\nnot valid\\\":  \n\\- via non-3GPP access; or  \n\\- via 3GPP access if the UE is registered to the same PLMN over 3GPP\naccess and non-3GPP access; or  \nuntil the UE selects a non-equivalent PLMN over non-3GPP access; or  \n\\- if the UE is operating in SNPN access operation mode:  \na\\) the network informs the UE that the use of access identity 1 is\nvalid in the RSNPN or equivalent SNPN by setting the MPS indicator bit\nof the 5GS network feature support IE to \\\"Access identity 1 valid\\\", in\nthe REGISTRATION ACCEPT message. Based on operator policy, the AMF sets\nthe MPS indicator bit in the REGISTRATION ACCEPT message based on the\nMPS priority information in the user\\'s subscription context obtained\nfrom the UDM;  \nb\\) upon receiving a REGISTRATION ACCEPT message with the MPS indicator\nbit set to \\\"Access identity 1 valid\\\":  \n\\- via 3GPP access; or  \n\\- via non-3GPP access if the UE is registered to the same SNPN over\n3GPP access and non-3GPP access;  \nthe UE shall act as a UE with access identity 1 configured for MPS, as\ndescribed in subclause 4.5.2A, in all NG-RAN of the registered SNPN and\nits equivalent SNPNs. The MPS indicator bit in the 5GS network feature\nsupport IE provided in the REGISTRATION ACCEPT message is valid in all\nNG-RAN of the registered SNPN and its equivalent SNPNs until the UE\nreceives a REGISTRATION ACCEPT message or a CONFIGURATION UPDATE COMMAND\nmessage with the MPS indicator bit set to \\\"Access identity 1 not\nvalid\\\":  \n\\- via 3GPP access; or  \n\\- via non-3GPP access if the UE is registered to the same SNPN over\n3GPP access and non-3GPP access; or  \nuntil the UE selects a non-equivalent SNPN over 3GPP access;  \nb1) upon receiving a REGISTRATION ACCEPT message with the MPS indicator\nbit set to \\\"Access identity 1 valid\\\":  \n\\- via non-3GPP access; or  \n\\- via 3GPP access if the UE is registered to the same SNPN over 3GPP\naccess and non-3GPP access;  \nthe UE shall act as a UE with access identity 1 configured for MPS, as\ndescribed in subclause 4.5.2A, in non-3GPP access of the registered SNPN\nand its equivalent SNPNs. The MPS indicator bit in the 5GS network\nfeature support IE provided in the REGISTRATION ACCEPT message is valid\nin non-3GPP access of the registered SNPN and its equivalent SNPNs until\nthe UE receives a REGISTRATION ACCEPT message or a CONFIGURATION UPDATE\nCOMMAND message with the MPS indicator bit set to \\\"Access identity 1\nnot valid\\\";  \n\\- via non-3GPP access; or  \n\\- via 3GPP access if the UE is registered to the same SNPN over 3GPP\naccess and non-3GPP access; or  \nuntil the UE selects a non-equivalent SNPN over non-3GPP access;  \nc\\) the network informs the UE that the use of access identity 2 is\nvalid in the RSNPN or equivalent SNPN by setting the MCS indicator bit\nof the 5GS network feature support IE to \\\"Access identity 2 valid\\\", in\nthe REGISTRATION ACCEPT message. Based on operator policy, the AMF sets\nthe MCS indicator bit in the REGISTRATION ACCEPT message based on the\nMCS priority information in the user\\'s subscription context obtained\nfrom the UDM;  \nd\\) upon receiving a REGISTRATION ACCEPT message with the MCS indicator\nbit set to \\\"Access identity 2 valid\\\":  \n\\- via 3GPP access; or  \n\\- via non-3GPP access if the UE is registered to the same SNPN over\n3GPP access and non-3GPP access;  \nthe UE shall act as a UE with access identity 2 configured for MCS, as\ndescribed in subclause 4.5.2A, in all NG-RAN of the registered SNPN and\nits equivalent SNPNs. The MCS indicator bit in the 5GS network feature\nsupport IE provided in the REGISTRATION ACCEPT message is valid in all\nNG-RAN of the registered SNPN and its equivalent SNPNs until the UE\nreceives a REGISTRATION ACCEPT message or a CONFIGURATION UPDATE COMMAND\nmessage with the MCS indicator bit set to \\\"Access identity 2 not\nvalid\\\":  \n\\- via 3GPP access; or  \n\\- via non-3GPP access if the UE is registered to the same SNPN over\n3GPP access and non-3GPP access; or  \nuntil the UE selects a non-equivalent SNPN over 3GPP access; and  \nd1) upon receiving a REGISTRATION ACCEPT message with the MCS indicator\nbit set to \\\"Access identity 2 valid\\\":  \n\\- via non-3GPP access; or  \n\\- via 3GPP access if the UE is registered to the same SNPN over 3GPP\naccess and non-3GPP access;  \nthe UE shall act as a UE with access identity 2 configured for MCS, as\ndescribed in subclause 4.5.2A, in non-3GPP access of the registered SNPN\nand its equivalent SNPNs. The MCS indicator bit in the 5GS network\nfeature support IE provided in the REGISTRATION ACCEPT message is valid\nin non-3GPP access of the registered SNPN and its equivalent SNPNs until\nthe UE receives a REGISTRATION ACCEPT message or a CONFIGURATION UPDATE\nCOMMAND message with the MCS indicator bit set to \\\"Access identity 2\nnot valid\\\":  \n\\- via non-3GPP access; or  \n\\- via 3GPP access if the UE is registered to the same SNPN over 3GPP\naccess and non-3GPP access; or  \nuntil the UE selects a non-equivalent SNPN over non-3GPP access.  \nIf the UE indicates support for restriction on use of enhanced coverage\nin the REGISTRATION REQUEST message and:  \na\\) in WB-N1 mode, the AMF decides to restrict the use of CE mode B for\nthe UE, then the AMF shall set the RestrictEC bit to \\\"CE mode B is\nrestricted\\\";  \nb\\) in WB-N1 mode, the AMF decides to restrict the use of both CE mode A\nand CE mode B for the UE, then the AMF shall set the RestrictEC bit to\n\\\" Both CE mode A and CE mode B are restricted\\\"; or  \nc\\) in NB-N1 mode, the AMF decides to restrict the use of enhanced\ncoverage for the UE, then the AMF shall set the RestrictEC bit to \\\"Use\nof enhanced coverage is restricted\\\",  \nin the 5GS network feature support IE in the REGISTRATION ACCEPT\nmessage.  \nIf the UE indicates support of the N1 NAS signalling connection release\nin the REGISTRATION REQUEST message and the network decides to accept\nthe N1 NAS signalling connection release, then the AMF shall set the N1\nNAS signalling connection release bit to \\\"N1 NAS signalling connection\nrelease supported\\\" in the 5GS network feature support IE of the\nREGISTRATION ACCEPT message.  \nIf the UE indicates support of the paging indication for voice services\nin the REGISTRATION REQUEST message and the network decides to accept\nthe paging indication for voice services, then the AMF shall set the\npaging indication for voice services bit to \\\"paging indication for\nvoice services supported\\\" in the 5GS network feature support IE of the\nREGISTRATION ACCEPT message. Upon receipt of REGISTRATION ACCEPT message\nwith the paging indication for voice services bit set to \\\"paging\nindication for voice services supported\\\", the UE NAS layer informs the\nlower layers that paging indication for voice services is supported.\nOtherwise, the UE NAS layer informs the lower layers that paging\nindication for voice services is not supported.  \nIf the UE indicates support of the reject paging request in the\nREGISTRATION REQUEST message and the network decides to accept the\nreject paging request, then the AMF shall set the reject paging request\nbit to \\\"reject paging request supported\\\" in the 5GS network feature\nsupport IE of the REGISTRATION ACCEPT message.  \nIf the UE indicates support of the paging restriction in the\nREGISTRATION REQUEST message, and the AMF sets:  \n\\- the reject paging request bit to \\\"reject paging request supported\\\";  \n\\- the N1 NAS signalling connection release bit to \\\"N1 NAS signalling\nconnection release supported\\\"; or  \n\\- both of them;  \nin the 5GS network feature support IE of the REGISTRATION ACCEPT\nmessage, and the network decides to accept the paging restriction, then\nthe AMF shall set the paging restriction bit to \\\"paging restriction\nsupported\\\" in the 5GS network feature support IE of the REGISTRATION\nACCEPT message.  \nIf the UE indicates support of ranging and sidelink positioning in the\nREGISTRATION REQUEST message and the network supports and accepts the\nuse of ranging and sidelink positioning, the AMF shall set the ranging\nand sidelink positioning supported bit to \\\"Ranging and sidelink\npositioning supported\\\" in the 5GS network feature support IE of the\nREGISTRATION ACCEPT message.  \nIf the UE has set the Follow-on request indicator to \\\"Follow-on request\npending\\\" in the REGISTRATION REQUEST message, or the network has\ndownlink signalling pending, the AMF shall not immediately release the\nNAS signalling connection after the completion of the registration\nprocedure.  \nIf the UE is authorized to use V2X communication over PC5 reference\npoint based on:  \na\\) at least one of the following bits in the 5GMM capability IE of the\nREGISTRATION REQUEST message set by the UE, or already stored in the\n5GMM context in the AMF during the previous registration procedure as\nfollows:  \n1\\) the V2XCEPC5 bit to \\\"V2X communication over E-UTRA-PC5 supported\\\";\nor  \n2\\) the V2XCNPC5 bit to \\\"V2X communication over NR-PC5 supported\\\"; and  \nb\\) the user\\'s subscription context obtained from the UDM as defined in\n3GPP TS 23.287 \\[6C\\];  \nthe AMF should not immediately release the NAS signalling connection\nafter the completion of the registration procedure.  \nIf the UE is authorized to use A2X communication over PC5 reference\npoint based on:  \na\\) at least one of the following bits in the 5GMM capability IE of the\nREGISTRATION REQUEST message set by the UE, or already stored in the\n5GMM context in the AMF during the previous registration procedure as\nfollows:  \n1\\) the A2XEPC5 bit to \\\"A2X over E-UTRA-PC5 supported\\\"; or  \n2\\) the A2XNPC5 bit to \\\"A2X over NR-PC5 supported\\\"; and  \nb\\) the user\\'s subscription context obtained from the UDM as defined in\n3GPP TS 23.256 \\[6C\\];  \nthe AMF should not immediately release the NAS signalling connection\nafter the completion of the registration procedure.  \nIf the UE is authorized to use 5G ProSe services based on:  \na\\) at least one of the following bits in the 5GMM capability IE of the\nREGISTRATION REQUEST message set by the UE, or already stored in the\n5GMM context in the AMF during the previous registration procedure as\nfollows:  \n1\\) the 5G ProSe direct discovery bit to \\\"5G ProSe direct discovery\nsupported\\\"; or  \n2\\) the 5G ProSe direct communication bit to \\\"5G ProSe direct\ncommunication supported\\\"; and  \nb\\) the user\\'s subscription context obtained from the UDM as defined in\n3GPP TS 23.304 \\[6E\\];  \nthe AMF should not immediately release the NAS signalling connection\nafter the completion of the registration procedure.  \nIf the Requested DRX parameters IE was included in the REGISTRATION\nREQUEST message, the AMF shall include the Negotiated DRX parameters IE\nin the REGISTRATION ACCEPT message and replace any stored Negotiated DRX\nparameter and use it for the downlink transfer of signalling and user\ndata. The AMF may set the Negotiated DRX parameters IE based on the\nreceived Requested DRX parameters IE and operator policy if available.  \nIf the Requested NB-N1 mode DRX parameters IE was included in the\nREGISTRATION REQUEST message, the AMF shall include the Negotiated NB-N1\nmode DRX parameters IE in the REGISTRATION ACCEPT message and replace\nany stored Negotiated NB-N1 mode DRX parameters and use it for the\ndownlink transfer of signalling and user data in NB-N1 mode. The AMF may\nset the Negotiated NB-N1 mode DRX parameters IE based on the received\nRequested NB-N1 mode DRX parameters IE and operator policy if available.  \nThe AMF shall include the Negotiated extended DRX parameters IE in the\nREGISTRATION ACCEPT message only if the Requested extended DRX\nparameters IE was included in the REGISTRATION REQUEST message, and the\nAMF supports and accepts the use of eDRX. The AMF may set the Negotiated\nextended DRX parameters IE based on the received Requested extended DRX\nparameters IE, operator policy, information from NG-RAN and the user\\'s\nsubscription context obtained from the UDM if available.  \nIf:  \na\\) the UE\\'s USIM is configured with indication that the UE is to\nreceive the SOR transparent container IE, the SOR transparent container\nIE included in the REGISTRATION ACCEPT message does not successfully\npass the integrity check (see 3GPP TS 33.501 \\[24\\]); and  \nb\\) if the UE attempts obtaining service on another PLMNs as specified\nin 3GPP TS 23.122 \\[5\\] annex C;  \nthen the UE shall locally release the established N1 NAS signalling\nconnection after sending a REGISTRATION COMPLETE message.  \nIf:  \na\\) the UE\\'s USIM is configured with indication that the UE is to\nreceive the SOR transparent container IE, the SOR transparent container\nIE is not included in the REGISTRATION ACCEPT message; and  \nb\\) the UE attempts obtaining service on another PLMNs as specified in\n3GPP TS 23.122 \\[5\\] annex C;  \nthen the UE shall locally release the established N1 NAS signalling\nconnection.  \nIf:  \na\\) the UE operates in SNPN access operation mode;  \nb\\) the ME is configured to indicate that the UE shall expect to receive\nthe steering of roaming information during initial registration\nprocedure for the selected entry of the \\\"list of subscriber data\\\" or\nthe selected PLMN subscription;  \nc\\) the SOR transparent container IE included in the REGISTRATION ACCEPT\nmessage does not successfully pass the integrity check (see\n3GPP TS 33.501 \\[24\\]); and  \nd\\) the UE attempts obtaining service on another SNPN as specified in\n3GPP TS 23.122 \\[5\\] annex C;  \nthen the UE shall locally release the established N1 NAS signalling\nconnection after sending a REGISTRATION COMPLETE message.  \nIf:  \na\\) the UE operates in SNPN access operation mode;  \nb\\) the ME is configured to indicate that the UE shall expect to receive\nthe steering of roaming information during initial registration\nprocedure for the selected entry of the \\\"list of subscriber data\\\" or\nthe selected PLMN subscription;  \nc\\) the SOR transparent container IE is not included in the REGISTRATION\nACCEPT message; and  \nd\\) the UE attempts obtaining service on another SNPN as specified in\n3GPP TS 23.122 \\[5\\] annex C;  \nthen the UE shall locally release the established N1 NAS signalling\nconnection.  \nIf the REGISTRATION ACCEPT message includes the SOR transparent\ncontainer IE and the SOR transparent container IE successfully passes\nthe integrity check (see 3GPP TS 33.501 \\[24\\]), the ME shall store the\nreceived SOR counter as specified in annex C and proceed as follows:  \na\\) the UE shall proceed with the behaviour as specified in\n3GPP TS 23.122 \\[5\\] annex C; and  \nb\\) if the registration procedure is performed over 3GPP access and the\nUE attempts obtaining service on another PLMNs or SNPNs as specified in\n3GPP TS 23.122 \\[5\\] annex C, then the UE may locally release the\nestablished N1 NAS signalling connection after sending a REGISTRATION\nCOMPLETE message. Otherwise the UE shall send a REGISTRATION COMPLETE\nmessage and not release the current N1 NAS signalling connection\nlocally. If an acknowledgement is requested in the SOR transparent\ncontainer IE of the REGISTRATION ACCEPT message, the UE acknowledgement\nis included in the SOR transparent container IE of the REGISTRATION\nCOMPLETE message. In the SOR transparent container IE carrying the\nacknowledgement, the UE shall set the ME support of SOR-CMCI indicator\nto \\\"SOR-CMCI supported by the ME\\\". Additionally, if the UE supports\naccess to an SNPN using credentials from a credentials holder and the UE\nis not operating in SNPN access operation mode, the UE may set the ME\nsupport of SOR-SNPN-SI indicator to \\\"SOR-SNPN-SI supported by the ME\\\".\nAdditionally, if the UE supports access to an SNPN providing access for\nlocalized services in SNPN, the UE shall set the ME support of\nSOR-SNPN-SI-LS indicator to \\\"SOR-SNPN-SI-LS supported by the ME\\\"  \nIf the SOR transparent container IE successfully passes the integrity\ncheck (see 3GPP TS 33.501 \\[24\\]) and:  \na\\) the list type indicates:  \n1\\) \\\"PLMN ID and access technology list\\\", and the SOR transparent\ncontainer IE indicates a list of preferred PLMN/access technology\ncombinations is provided, then the ME shall replace the highest priority\nentries in the \\\"Operator Controlled PLMN Selector with Access\nTechnology\\\" list stored in the ME and shall proceed with the behaviour\nas specified in 3GPP TS 23.122 \\[5\\] annex C; or  \n2\\) \\\"secured packet\\\", then the ME shall behave as if a SMS is received\nwith protocol identifier set to SIM data download, data coding scheme\nset to class 2 message and SMS payload as secured packet contents of SOR\ntransparent container IE. The SMS payload is forwarded to UICC as\nspecified in 3GPP TS 23.040 \\[4A\\] and the ME shall proceed with the\nbehaviour as specified in 3GPP TS 23.122 \\[5\\] annex C; or  \nb\\) the list type indicates \\\"PLMN ID and access technology list\\\" and\nthe SOR transparent container IE indicates \\\"HPLMN indication that \\'no\nchange of the \\\"Operator Controlled PLMN Selector with Access\nTechnology\\\" list stored in the UE is needed and thus no list of\npreferred PLMN/access technology combinations is provided\\'\\\", the UE\noperates in SNPN access operation mode and the SOR transparent container\nIE includes SOR-SNPN-SI, the ME shall replace SOR-SNPN-SI of the\nselected entry of the \\\"list of subscriber data\\\" or associated with the\nselected PLMN subscription, as specified in 3GPP TS 23.122 \\[5\\] with\nthe received SOR-SNPN-SI. Additionally, if the SOR transparent container\nIE includes SOR-SNPN-SI-LS, the ME shall replace SOR-SNPN-SI-LS of the\nselected entry of the \\\"list of subscriber data\\\" or associated with the\nselected PLMN subscription, as specified in 3GPP TS 23.122 \\[5\\] with\nthe received SOR-SNPN-SI-LS.  \nIf the SOR-CMCI is present and the Store SOR-CMCI in ME indicator is set\nto \\\"Store SOR-CMCI in ME\\\" then the UE shall store or delete the\nSOR-CMCI in the non-volatile memory of the ME as described in annex C.1.  \nThe UE shall proceed with the behaviour as specified in\n3GPP TS 23.122 \\[5\\] annex C.  \nIf the SOR transparent container IE does not pass the integrity check\nsuccessfully, then the UE shall discard the content of the SOR\ntransparent container IE.  \nIf required by operator policy, the AMF shall include the NSSAI\ninclusion mode IE in the REGISTRATION ACCEPT message (see\ntable 4.6.2.3.1 of subclause 4.6.2.3). Upon receipt of the REGISTRATION\nACCEPT message:  \na\\) if the message includes the NSSAI inclusion mode IE, the UE shall\noperate in the NSSAI inclusion mode indicated in the NSSAI inclusion\nmode IE over the current access within the current PLMN and its\nequivalent PLMN(s), if any, or the current SNPN ,in the current\nregistration area; or  \nb\\) otherwise:  \n1\\) if the UE has NSSAI inclusion mode for the current PLMN or SNPN and\naccess type stored in the UE, the UE shall operate in the stored NSSAI\ninclusion mode;  \n2\\) if the UE does not have NSSAI inclusion mode for the current PLMN or\nSNPN and the access type stored in the UE and if the UE is performing\nthe registration procedure over:  \ni\\) 3GPP access, the UE shall operate in NSSAI inclusion mode D in the\ncurrent PLMN or SNPN and the current access type;  \nii\\) untrusted non-3GPP access, the UE shall operate in NSSAI inclusion\nmode B in the current PLMN and the current access type; or  \niii\\) trusted non-3GPP access, the UE shall operate in NSSAI inclusion\nmode D in the current PLMN and the current access type; or  \n3\\) if the 5G-RG does not have NSSAI inclusion mode for the current PLMN\nand wireline access stored in the 5G-RG, and the 5G-RG is performing the\nregistration procedure over wireline access, the 5G-RG shall operate in\nNSSAI inclusion mode B in the current PLMN and the current access type.  \nThe AMF may include operator-defined access category definitions in the\nREGISTRATION ACCEPT message.  \nIf the UE receives Operator-defined access category definitions IE in\nthe REGISTRATION ACCEPT message and the Operator-defined access category\ndefinitions IE contains one or more operator-defined access category\ndefinitions, the UE shall delete any operator-defined access category\ndefinitions stored for the RPLMN and shall store the received\noperator-defined access category definitions for the RPLMN. If the UE\nreceives the Operator-defined access category definitions IE in the\nREGISTRATION ACCEPT message and the Operator-defined access category\ndefinitions IE contains no operator-defined access category definitions,\nthe UE shall delete any operator-defined access category definitions\nstored for the RPLMN. If the REGISTRATION ACCEPT message does not\ncontain the Operator-defined access category definitions IE, the UE\nshall not delete the operator-defined access category definitions stored\nfor the RPLMN.  \nIf the UE has indicated support for service gap control in the\nREGISTRATION REQUEST message and:  \n\\- the REGISTRATION ACCEPT message contains the T3447 value IE, then the\nUE shall store the new T3447 value, erase any previous stored T3447\nvalue if exists and use the new T3447 value with the timer T3447 next\ntime it is started; or  \n\\- the REGISTRATION ACCEPT message does not contain the T3447 value IE,\nthen the UE shall erase any previous stored T3447 value if exists and\nstop the timer T3447 if running.  \nIf the T3448 value IE is present in the received REGISTRATION ACCEPT\nmessage and the value indicates that this timer is neither zero nor\ndeactivated, the UE shall:  \na\\) stop timer T3448 if it is running; and  \nb\\) start timer T3448 with the value provided in the T3448 value IE.  \nIf the UE is using 5GS services with control plane CIoT 5GS\noptimization, the T3448 value IE is present in the REGISTRATION ACCEPT\nmessage and the value indicates that this timer is either zero or\ndeactivated, the UE shall ignore the T3448 value IE and proceed as if\nthe T3448 value IE was not present.  \nIf the REGISTRATION ACCEPT message contains the Truncated 5G-S-TMSI\nconfiguration IE, then the UE shall store the included truncated\n5G-S-TMSI configuration and return a REGISTRATION COMPLETE message to\nthe AMF to acknowledge reception of the truncated 5G-S-TMSI\nconfiguration.  \nNOTE 20: The UE provides the truncated 5G-S-TMSI configuration to the\nlower layers.  \nIf the UE is not in NB-N1 mode, the UE has set the RACS bit to \\\"RACS\nsupported\\\" in the 5GMM Capability IE of the REGISTRATION REQUEST\nmessage and the REGISTRATION ACCEPT message includes:  \na\\) a UE radio capability ID deletion indication IE set to\n\\\"Network-assigned UE radio capability IDs deletion requested\\\", the UE\nshall delete any network-assigned UE radio capability IDs associated\nwith the RPLMN or RSNPN and, if the UE supports access to an SNPN using\ncredentials from a credentials holder, equivalent SNPNs or both, the\nselected entry of the \\\"list of subscriber data\\\" or the selected PLMN\nsubscription stored at the UE, then the UE shall, after the completion\nof the ongoing registration procedure, initiate a registration procedure\nfor mobility and periodic registration update as specified in\nsubclause 5.5.1.3.2 over the existing N1 NAS signalling connection; or  \nb\\) a UE radio capability ID IE, the UE shall store the UE radio\ncapability ID as specified in annex C.  \nIf the UE has included the service-level device ID set to the CAA-level\nUAV ID in the Service-level-AA container IE of the REGISTRATION REQUEST\nmessage and the REGISTRATION ACCEPT message contains the\nservice-level-AA pending indication in the Service-level-AA container\nIE, the UE shall return a REGISTRATION COMPLETE message to the AMF to\nacknowledge reception of the service-level-AA pending indication, and\nthe UE shall not attempt to perform another registration procedure for\nUAS services until the UUAA-MM procedure is completed, or to establish a\nPDU session for USS communication or a PDU session for C2 communication\nuntil the UUAA-MM procedure is completed successfully.  \nIf the UE has included the service-level device ID set to the CAA-level\nUAV ID in the Service-level-AA container IE of the REGISTRATION REQUEST\nmessage and the REGISTRATION ACCEPT message does not contain the\nservice-level-AA pending indication in the Service-level-AA container\nIE, the UE shall consider the UUAA-MM procedure is not triggered.  \nIf the REGISTRATION REQUEST message includes the 5GS registration type\nIE set to \\\"SNPN onboarding registration\\\" or the network determines\nthat the UE\\'s subscription only allows for configuration of SNPN\nsubscription parameters in PLMN via the user plane, the AMF may start an\nimplementation specific timer for onboarding services when the network\nconsiders that the UE is in 5GMM-REGISTERED (i.e. the network receives\nthe REGISTRATION COMPLETE message from UE).  \nNOTE 21: If the AMF considers that the UE is in 5GMM-IDLE, when the\nimplementation specific timer for onboarding services expires and the\nnetwork considers that the UE is still in state 5GMM-REGISTERED, the AMF\ncan locally de-register the UE; or if the UE is in 5GMM-CONNECTED, the\nAMF can initiate the network-initiated de-registration procedure (see\nsubclause 5.5.2.3).  \nNOTE 22: The value of the implementation specific timer for onboarding\nservices needs to be large enough to allow a UE to complete the\nconfiguration of one or more entries of the \\\"list of subscriber data\\\"\ntaking into consideration that configuration of SNPN subscription\nparameters in PLMN via the user plane or onboarding services in SNPN\ninvolves third party entities outside of the operator\\'s network.  \nIf the UE receives the List of PLMNs to be used in disaster condition IE\nin the REGISTRATION ACCEPT message and the UE supports MINT, the UE\nshall delete the \\\"list of PLMN(s) to be used in disaster condition\\\"\nstored in the ME together with the PLMN ID of the RPLMN, if any, and may\nstore the \\\"list of PLMN(s) to be used in disaster condition\\\" included\nin the List of PLMNs to be used in disaster condition IE in the ME\ntogether with the PLMN ID of the RPLMN.  \nIf the UE receives the Disaster roaming wait range IE in the\nREGISTRATION ACCEPT message and the UE supports MINT, the UE shall\ndelete the disaster roaming wait range stored in the ME, if any, and\nstore the disaster roaming wait range included in the Disaster roaming\nwait range IE in the ME.  \nIf the UE receives the Disaster return wait range IE in the REGISTRATION\nACCEPT message and the UE supports MINT, the UE shall delete the\ndisaster return wait range stored in the ME, if any, and store the\ndisaster return wait range included in the Disaster return wait range IE\nin the ME.  \nIf the 5GS registration type IE in the REGISTRATION REQUEST message is\nset to \\\"disaster roaming initial registration\\\" and:  \na\\) the MS determined PLMN with disaster condition IE is included in the\nREGISTRATION REQUEST message, the AMF shall determine the PLMN with\ndisaster condition in the MS determined PLMN with disaster condition IE;  \nb\\) the MS determined PLMN with disaster condition IE is not included in\nthe REGISTRATION REQUEST message and the Additional GUTI IE is included\nin the REGISTRATION REQUEST message and contains 5G-GUTI of a PLMN of\nthe country of the PLMN providing disaster roaming services, the AMF\nshall determine the PLMN with disaster condition in the PLMN identity of\nthe 5G-GUTI;  \nc\\) the MS determined PLMN with disaster condition IE and the Additional\nGUTI IE are not included in the REGISTRATION REQUEST message and:  \n1\\) the 5GS mobile identity IE contains 5G-GUTI of a PLMN of the country\nof the PLMN providing disaster roaming services, the AMF shall determine\nthe PLMN with disaster condition in the PLMN identity of the 5G-GUTI; or  \n2\\) the 5GS mobile identity IE contains SUCI of a PLMN of the country of\nthe PLMN providing disaster roaming services, the AMF shall determine\nthe PLMN with disaster condition in the PLMN identity of the SUCI; or  \nd\\) the MS determined PLMN with disaster condition IE is not included in\nthe REGISTRATION REQUEST message, NG-RAN of the PLMN providing disaster\nroaming services broadcasts disaster roaming indication and:  \n\\- the Additional GUTI IE is included in the REGISTRATION REQUEST\nmessage and contains 5G-GUTI of a PLMN of a country other than the\ncountry of the PLMN providing disaster roaming services; or  \n\\- the Additional GUTI IE is not included and the 5GS mobile identity IE\ncontains 5G-GUTI or SUCI of a PLMN of a country other than the country\nof the PLMN providing disaster roaming services;  \nthe AMF shall determine the PLMN with disaster condition based on the\ndisaster roaming agreement arrangement between mobile network operators.  \nNOTE 23: The disaster roaming agreement arrangement between mobile\nnetwork operators is out scope of 3GPP.  \nIf the AMF determines that a disaster condition applies to the PLMN with\ndisaster condition, and the UE is allowed to be registered for disaster\nroaming services, the AMF shall set the Disaster roaming registration\nresult value bit in the 5GS registration result IE to \\\"no additional\ninformation\\\" in the REGISTRATION ACCEPT message. If the AMF determines\nthat the UE can be registered to the PLMN for normal service, the AMF\nshall set the Disaster roaming registration result value bit in the 5GS\nregistration result IE to \\\"request for registration for disaster\nroaming services accepted as registration not for disaster roaming\nservices\\\" in the REGISTRATION ACCEPT message.  \nIf the UE indicates \\\"disaster roaming initial registration\\\" in the 5GS\nregistration type IE in the REGISTRATION REQUEST message and the 5GS\nregistration result IE value in the REGISTRATION ACCEPT message is set\nto:  \n\\- \\\"request for registration for disaster roaming service accepted as\nregistration not for disaster roaming services\\\", the UE shall consider\nitself registered for normal service. If the PLMN identity of the\nregistered PLMN is a member of the forbidden PLMN list as specified in\nsubclause 5.3.13A, any such PLMN identity shall be deleted from the\ncorresponding list(s). If UE supports S1 mode, the UE shall initiate the\nregistration procedure for mobility and periodic registration update and\nindicate that S1 mode is supported as described in subclause 5.5.1.3.2;\nor  \n\\- \\\"no additional information\\\", the UE shall consider itself\nregistered for disaster roaming services.  \nIf the UE receives the forbidden TAI(s) for the list of \\\"5GS forbidden\ntracking areas for roaming\\\" IE in the REGISTRATION ACCEPT message, the\nUE shall store the TAI(s) belonging to the serving PLMN or equivalent\nPLMN(s) and ignore the TAI(s) which do not belong to the serving PLMN or\nequivalent PLMN(s) included in the IE, if not already stored, into the\nlist of \\\"5GS forbidden tracking areas for roaming\\\".  \nIf the UE receives the forbidden TAI(s) for the list of \\\"5GS forbidden\ntracking areas for regional provision of service\\\" IE in the\nREGISTRATION ACCEPT message, the UE shall store the TAI(s) belonging to\nthe serving PLMN or equivalent PLMN(s) and ignore the TAI(s) which do\nnot belong to the serving PLMN or equivalent PLMN(s) included in the IE,\nif not already stored, into the list of \\\"5GS forbidden tracking areas\nfor regional provision of service\\\".  \nIf the UE supporting the reconnection to the network due to RAN timing\nsynchronization status change receives the RAN timing synchronization IE\nwith the RecReq bit set to \\\"Reconnection requested\\\" in the\nREGISTRATION ACCEPT message, the UE shall operate as specified in\nsubclauses 5.3.1.4, 5.5.1.3.2 and 5.6.1.1.  \nIf the UE supports discontinuous coverage, the AMF may include the\nDiscontinuous coverage maximum time offset IE in the REGISTRATION ACCEPT\nmessage.  \nIf the UE receives, the Discontinuous coverage maximum time offset IE in\nthe REGISTRATION ACCEPT message, the UE shall replace any previously\nreceived discontinuous coverage maximum time offset value on the same\nsatellite NG-RAN RAT type and PLMN with the latest received timer value.  \nIf for discontinuous coverage the AMF includes Unavailability\nconfiguration IE in the REGISTRATION ACCEPT message and sets the End of\nunavailability report bit to \"UE does not need to report end of\nunavailability\", the UE is not required to initiate the registration\nprocedure for mobility registration update when the unavailability\nperiod duration has ended. If the Unavailability configuration IE\nincludes a value of the unavailability period duration, then the UE may\neither:  \na\\) use the received value for unavailability period duration; or  \nb\\) determine another value for unavailability period duration.  \nNOTE 24: The UE can consider the received value from the network when\ndetermining the value for unavailability period duration.  \nIf the UE operating as MBSR receives the MBSRAI field of the Feature\nauthorization indication IE in the REGISTRATION ACCEPT message, the UE\nNAS layer informs the lower layers of the status of MBSR authorization\nas specified in clause 5.35A.4 of 3GPP TS 23.501 \\[8\\].  \n\\* \\* \\* End of Changes \\* \\* \\* \\*"], "summary": ["Change Request 6230 for specification 25.501 in version 18.6.0 aims to provide clarification on the handling of Enhanced User Registration Privacy (EURP) during the initial registration procedure. The issue arises when the AMF needs to determine if a UE, which experienced an out-of-coverage period based on satellite availability, should perform the registration procedure in NG-RAN satellite access once the unavailability period ends. The proposed change seeks to explicitly state that the AMF has the capability to make this determination during the initial registration process. Failure to approve this change could result in ambiguity regarding the AMF's responsibility in directing the UE to perform the registration procedure in NG-RAN satellite access post unavailability period. The affected clause is 5.5.1.2.4."], "embeddings": [[-0.054546166, 0.03076132, -0.0210066, 0.0006279986, -0.013775453, 0.030143933, -0.046705347, 0.06482566, -0.018876616, 0.007836959, -0.0001551909, -0.007879405, 0.0022843329, -0.039543655, -0.0042754067, 0.00345351, -0.017502928, -0.0069687585, 0.042846676, 0.010233194, 0.024294188, 0.010981776, 0.037660625, 0.043988843, 0.035931937, 0.0210066, -0.007817666, 0.0125406785, -0.019895304, 0.029464807, 0.025575267, 0.0138989305, 0.0059192004, 0.034203254, -0.0072311484, 0.0014884821, 0.021176383, 0.006710228, -0.043711018, -0.013181218, -0.00652887, 0.0029460948, -0.0026084613, 0.03392543, -0.0037120408, -0.04158103, -0.05047141, 0.027303953, -0.00022175297, -0.012432636, -0.024078103, -0.0373828, 0.010387541, -0.0012338099, 0.010086564, -0.009831892, 0.005186053, 0.0538053, -0.02495788, -0.04269233, 0.031363275, 0.029788936, -0.020790515, -0.008427336, 0.011992748, 0.03259805, -0.028662203, -0.008218968, -0.04750795, 0.0004531526, -0.038524967, 0.028801115, 0.0024425383, -0.010402976, 0.038617574, 0.011614598, 0.011105253, 0.04905142, 0.04642752, -0.026470479, 0.010881451, 0.03920409, -0.0069687585, -0.002774384, 0.027489169, 0.0044799163, -0.0019553811, -0.079581216, 0.0068645747, 0.00969298, -0.002722292, 0.022009855, -0.004553231, -0.00336669, 0.039543655, 0.01813575, -0.005768712, -0.0024425383, -0.051829662, -0.0044066017, -0.02353789, -0.038679313, 0.033061087, -0.0018714551, 0.02472636, 0.014176755, 0.025822222, 0.006463273, 0.021407904, 0.1045854, -0.009824174, 0.024170712, -0.011653185, 0.0037023942, -0.038926266, -0.041889727, -0.014253928, 0.001030265, 0.0017248257, 0.04513101, 0.0025988144, -0.00412106, 0.023321804, -0.004858066, -0.05331139, 0.00010804277, 0.013073175, -0.00092511624, 0.0026277546, -0.015388378, -0.007917992, -0.011221014, -0.027211344, 0.010287215, -0.019586612, 0.04892794, -0.0115991635, -0.009515481, -0.007655602, 0.009245374, 0.005328824, -0.01773445, 0.042537984, 0.00062558695, 0.017888796, 0.027072432, 0.0071616923, -0.002238029, -0.0232755, 0.020744212, -3.9370498e-05, -0.014940772, -0.016777499, -0.030977406, 0.039852347, 0.0011527778, -0.018969223, -0.022519201, -0.049576197, 0.023460716, 0.004977685, -0.001093933, -0.009654393, 0.004707578, 0.008288424, 0.014331101, 0.007366202, 0.015203161, 0.020481823, 0.026563087, -0.036209762, -0.03398717, -0.021932682, -0.0021434915, 0.030344585, 0.023522455, 0.014902185, 0.0012637145, 0.0040323106, -0.01744119, -0.008388749, 0.026269829, 0.008334728, -0.0021627848, 0.027211344, -0.008110926, 0.014338819, -0.0046072523, 0.0040670387, -0.045285355, 0.007933427, 0.038494095, 0.042846676, 0.004333287, 0.006031102, -0.010410693, 0.020991167, -0.012517527, -0.027782427, -0.0068105534, 0.028430684, -0.013173501, -0.016746629, -0.0014354254, -0.01764184, 0.023352673, 0.01935509, 0.033153698, 0.013543933, -0.0022708275, -0.023368107, -0.041858856, 0.052940957, 0.029912412, 0.022642678, 0.016036633, 0.0043410044, -0.02225681, -0.0062317527, -0.033771083, 0.032443702, -0.03122436, 0.020558996, 0.02713417, -0.025282009, 0.01140623, -0.0033937006, -0.0012289865, -0.013590237, 0.0057918644, -0.011876987, 0.06220177, -0.01720967, 0.002301697, 0.00972385, 0.014825012, 0.012293724, -0.002693352, -0.020667039, -0.008265272, -0.0003943079, 0.035993677, 0.014331101, -0.009500046, -0.022195073, 0.017533798, -0.007987448, 0.059300046, 0.0030830777, 0.018382706, 0.021901812, 0.017286843, -0.015697071, 0.02347615, 0.0010119363, 0.007092236, -0.031702835, -0.012988284, -0.0016872037, -0.008496792, 0.03877192, 0.044884056, 0.016437937, -0.004286983, 0.0108351465, -0.0171788, 0.024201581, 0.011576011, 0.0048387726, -0.046736214, -0.0019312645, 0.022040725, 0.0051474664, -0.0010977917, -0.041457556, 0.026856346, 0.020003347, 0.033554997, 0.028060252, -0.0066176197, -0.02284333, 0.00067285565, -0.04843403, -0.031239796, -0.045038402, 0.0023865877, -0.030344585, -0.007528266, -0.017595537, 0.0069494653, -0.020080522, -0.014562622, 0.017132496, 0.0040786145, -0.001761483, 0.0065365876, 0.006463273, 0.017564667, -0.01700902, -0.027041562, -0.006077406, 0.025667876, -0.032814134, 0.010325802, -0.027936773, 0.024124408, -0.024541143, -0.0073006046, -0.028291771, 0.00031785798, 0.058682658, -0.04068582, -0.0033512553, -0.04991576, 0.005189912, -0.013736866, 0.024973314, 0.024448536, -0.00087302417, -0.038031057, -0.024402231, -0.01592859, 0.012803068, -0.026964389, 0.017364018, -0.01514914, 0.029418504, 0.046396654, 0.008705161, 0.0076054395, -0.0052053463, 0.031764574, 0.043834496, -0.035623245, -0.031070014, -0.004252255, 0.020775082, 0.0034920967, 0.022364853, 0.00484649, 0.019571176, -0.04269233, -0.013489911, 0.028924594, -0.019663785, 0.034048907, 0.039080612, -0.024572013, 0.004638122, 0.02014226, 0.00079633313, -0.034573685, 0.024741795, -0.016144676, 0.04988489, 0.030437192, -0.014871316, -0.030900232, -0.018274663, -0.02162399, 0.04213668, -0.011853836, 0.0017884937, -0.011676337, 0.021268992, -0.012911111, -0.010217759, 0.026516782, 0.0028341934, -0.025035053, -0.026547652, 0.035530638, 0.036148023, -0.005479312, -0.007528266, 0.023661368, -0.0059655043, 0.025930265, 0.03157936, 0.03392543, 0.025791353, -0.003603998, -0.014647513, 0.022827893, 0.03451195, 0.021809205, 0.027566342, 0.03009763, -0.016731195, 0.003470874, -0.03142501, 0.015689354, -0.008419619, -0.029325895, -0.024340494, -0.04037713, -0.020697908, -0.028091121, 0.022611808, -0.02165486, 0.019478569, 0.010225477, -0.027566342, 0.067109995, 0.008682009, -0.0061005577, -0.03784584, -0.0377841, 0.007350767, -0.035191074, 0.0059037656, -0.0056645283, 0.004834914, -0.026316132, 0.006347513, 0.014400558, -0.02449484, 0.042723197, -0.03389456, -0.01700902, 0.0098164575, 0.011197861, 0.013289261, 0.014933054, 0.041982334, 0.014045561, -0.003827801, -0.015218596, 0.015974896, -0.008874942, 0.001404556, -0.0240318, 0.0027917481, -0.03303022, -0.019046398, 0.008257555, -0.02548266, -0.008164947, -0.009801023, -0.0049082288, -0.0043873084, 0.030514365, -0.011321339, 0.016237285, 0.0011257671, 0.0038567411, -0.009592654, -0.030776756, -0.042939283, -0.00065115065, -0.013590237, 0.02910981, -0.024664622, -0.004765458, 0.007211855, -0.05713919, -0.005548768, -0.044822317, 0.027303953, 0.008720595, -0.016314458, 0.014817295, 0.059392653, -0.0047731753, 0.033369783, -0.015565877, -0.052169222, -0.014107299, 0.03772236, 0.020620735, -0.010379824, -0.021701163, -0.017425755, -0.006193166, 0.011761228, 0.014994794, -0.022982242, -0.011190144, -0.02350702, 0.01332013, -0.002907508, 0.0171788, -0.0069919107, 0.028693072, -0.00612371, -0.0027917481, -0.0034670155, 0.0251894, -0.024587449, -0.02687178, 0.020481823, -0.022426592, -0.014207625, 0.0024020222, 0.0037158995, -0.052045748, 0.03522194, 0.00740093, 0.016299024, -0.01285709, -0.029696327, -0.0029364482, -0.020203998, -0.00082141446, -0.010950906, -0.023182891, 0.027658949, -0.0050046956, -0.017950535, 0.02225681, 0.027242213, 0.050564017, -0.019247048, -0.0016910624, -0.013073175, 0.034573685, 0.0043371455, -0.0025930265, 0.0059732217, 0.021978987, 0.012417201, -0.022704417, -0.005220781, 0.02225681, 0.0010177243, -0.0102409115, -0.004753882, 0.005255509, -0.006980335, 0.0025968852, -0.0067758253, 0.013883496, 0.0017759531, -0.012185682, -0.0022592514, -0.0031293817, 0.008682009, -0.0060002324, -0.03389456, -0.010665365, -0.031949792, 0.029186983, -0.03401804, -0.00031062297, 0.0024734077, 0.020512693, -0.029680893, 0.006575174, 0.010665365, 0.0041943747, -0.021083776, -0.0026451186, -0.02165486, -0.0054715946, -0.010356671, -0.013188936, 0.005961646, 0.039667133, -0.00995537, 0.029850675, -0.003850953, -0.04269233, 0.003223919, 0.009253091, -0.018845746, -0.015164575, -0.021608554, 0.0074858204, 0.0035017433, -0.0069108787, 0.007597722, 0.0014412134, -0.011684054, 0.010572757, 0.016082939, -0.007389354, 0.0068066944, 0.0210066, -0.006038819, 0.009121897, 0.0028515575, -0.03537629, 0.0019129359, 0.031764574, 0.022982242, -0.004892794, -0.005054858, -0.03142501, 0.02446397, -0.022704417, 0.003970572, -0.011398512, -0.028739378, -0.0139298, 0.030483495, 0.022225942, 0.0037139703, 0.018182054, -0.0076285913, -0.06420828, -0.030375453, 0.046921432, -0.011228731, -0.013829474, -0.017842492, 0.020497257, 0.005267085, 0.022457462, 0.000664656, -0.0108428635, -0.025899395, -0.0070845187, 0.02812199, -0.0018994305, 0.0015965248, -0.0152571825, 0.024556579, -0.01987987, -0.0094768945, -0.022997675, 0.023630498, -0.0026046026, 0.00033546315, 0.015079684, -0.01599033, 0.03125523, -0.0087128775, -0.011290469, -0.00066320895, 0.008080056, -0.013705998, 0.015774244, -0.011931009, -0.015164575, 0.005301813, 0.022688981, -0.007786797, -0.044822317, 0.010333519, 0.009939935, -0.025050487, 0.013613389, -0.033647604, 0.0873603, -0.023229197, -0.0055063227, 0.01645337, 0.027720688, 0.018552488, 0.009106462, -0.019030962, -0.018490748, 0.013798606, 0.014948489, -0.009878196, -0.01822836, 0.032937612, 0.004553231, 0.013829474, -0.026424175, -0.013543933, 0.00684914, 0.016592283, -0.010881451, 0.0025312877, -0.015735658, 0.01747206, -0.009160483, -0.020697908, 0.014879033, -0.038432356, -0.014585774, 0.009932217, 0.010526453, -0.030251976, -0.010680799, -0.019571176, -0.00020897112, -0.010148304, -0.041550163, 0.008558531, 0.027257647, -0.009044724, -0.005733984, 0.012918829, 0.006613761, -0.0053789867, -0.04642752, -0.006335937, -0.04219842, -0.0015868782, -0.0025428638, 0.0071694097, 0.0021145514, 0.015280335, -0.0011682125, 0.012054486, 0.021407904, 0.0063745235, 0.020358345, -0.025297442, 0.018907486, -0.016638586, 0.009615807, -0.022889633, 0.010117434, 0.0012502092, -0.013636542, -0.035746723, -0.0054021385, -0.0082035335, -0.026393306, -0.026377872, 0.04108712, 0.00673338, -0.013451325, 0.010680799, -0.012417201, -0.020450953, -0.008990702, -0.016144676, 0.007813808, -0.03069958, -0.021469641, -0.01082743, 0.0071848445, 0.029341329, 0.013405021, 0.033771083, 0.020065086, -0.007786797, 0.013196653, 0.0150874015, -0.0068761506, -0.010896885, 0.016870108, -0.0013167713, 0.020265738, 0.029773502, 0.017580103, 0.008095491, 0.01332013, 0.01018689, 0.0062780567, -0.04355667, -0.007339191, 0.018274663, 0.0120159, -0.075382985, 0.0060851234, 0.008157229, -0.028986333, 0.039790608, -0.030221106, -0.009546351, -0.0010852511, 0.010626778, 0.04173538, 0.013868062, 0.003148675, 0.008790052, 0.02884742, -0.0062934915, 0.02963459, 0.034542818, 0.024741795, 0.015133705, -0.0013650047, 0.020744212, -0.02960372, -0.0056953975, -0.0065520224, -0.0012405625, -0.05389791, 0.00083540217, 0.017194236, 0.009353417, -0.0061777313, -0.001962134, -0.009368852, -0.00051850884, 0.013798606, -0.01764184, 0.008697443, -0.042291027, -0.018583357, -0.020775082, -0.01369828, -0.016777499, 0.008612553, -0.00020547419, -0.023352673, -0.0046882844, -0.012725895, 0.023445282, -0.0014595421, -0.0011421664, 0.0362715, -0.03725932, -0.02423245, 0.011892422, 0.021238122, -0.013651976, -0.008087773, -0.010642213, 0.022040725, 0.013837192, -0.021423338, -0.03032915, 0.015071967, -0.0046651326, -0.008913529, 0.004364156, -0.0186914, -0.002187866, -0.011151558, -0.008365598, -0.00054841355, -0.01697815, 0.007385495, 0.00019715395, -0.02446397, -0.002544793, -0.019632915, -0.00049246283, -0.022611808, 0.0011836472, -0.0038181543, 0.031826314, -0.0044567646, 0.0058381683, -0.042507112, 0.016823802, -0.01889205, -0.017657276, 0.007829242, -0.010657648, 0.010233194, -0.010040261, 0.006976476, 0.015774244, -0.024186146, 0.0010717458, 0.005807299, 0.02156225, -0.03478977, -0.016792934, -0.0054986053, -0.008697443, 0.0030406322, 0.032381963, 0.015311204, -0.0010775337, 0.022735287, 0.0035827754, -0.023121154, 0.009947652, 0.011807531, 0.020173129, -0.03438847, -0.0070652254, 0.03290674, -0.017950535, 0.009106462, 0.02347615, -0.018151186, -0.0062124594, -0.06309698, 0.012996002, -0.030005021, -0.007057508, -0.02165486, -0.03877192, -0.00612371, 0.05291009, 0.012471222, 0.0059307762, -0.017765319, 0.023445282, 0.011020362, 0.015110553, 0.039790608, -0.006054254, 0.0066446303, 0.060874384, -0.02690265, 0.034635425, -0.0171788, -0.0038876105, -0.059238307, 0.010881451, 0.024649186, -0.0029846816, -0.017719014, 0.004414319, 0.010472432, -0.017518364, 0.007335332, -0.036703672, 0.022426592, -0.009793306, -0.018830312, 0.012000465, 0.016561413, 0.014608926, -0.010757973, 0.03685802, 0.014315668, -0.029403068, -0.022503765, -0.01320437, -0.004649698, -0.024155276, -0.019632915, -0.01320437, 0.017981404, -0.0039493493, 0.00995537, -0.007836959, 0.030221106, 0.03069958, 0.04469884, -0.010742539, -0.017564667, -0.031888053, -0.036981497, -0.00354033, -0.010511018, 0.014446862, -0.0009318689, 0.0122860065, -0.013296979, -0.007964295, 0.012532962, -0.027411995, 0.018675964, -0.024587449, -0.0034033472, -0.011761228, 0.0056490935, -0.045347095, 0.013111762, -0.009654393, -0.035314552, 0.015866853, 0.009530916, 0.016160112, -0.0290172, 0.009770153, 0.032690655, -0.027041562, -0.020775082, 0.007366202, -0.053249653, 0.019494003, 0.01605207, -0.015565877, -0.036148023, -0.012301441, 0.046026222, -0.03833975, 0.013173501, 0.014817295, -0.009229939, -0.016700326, 0.01744119, -0.0063050673, -0.018953789, -0.035592377, 0.016576849, 0.02255007, -0.0041403533, -0.005996374, 0.0058844723, 0.008342446, -0.010325802, 0.006710228, -0.0021145514, 0.023491586, 0.045316227, -0.008836355, -0.023723105, 0.031054579, 0.022874199, 0.04364928, -0.0072041377, 0.007130823, -0.003930056, 0.010619061, -0.012054486, 0.02832264, -0.0028785681, -0.014655231, -0.021299861, 0.025035053, -0.0019756393, 0.036240634, 0.0058265924, -0.032937612, -0.0022399582, -0.03645672, -0.018814877, 0.019108135, 0.010511018, -0.035715852, -0.009747001, -0.009909065, 0.015704788, -0.01981813, 0.0017711297, -0.02574505, 0.007655602, 0.03821627, 0.008905811, -0.044914924, -0.0278596, -0.015635332, -0.006555881, 0.045470573, -0.034758903, -0.003885681, 0.02202529, 0.017348582, -0.008296141, 0.0033859832, 0.02472636, 0.0072620176, -0.0139838215, -0.011413947, 0.0027010692, 0.024062669, -0.0029538122, -0.010055695, -0.022395723, -0.023661368, 0.020265738, 0.007740493, -0.026948955, -0.031733707, 0.011321339, 0.026316132, 0.014933054, -0.012324593, 0.0063513713, -0.03352413, -0.017719014, -0.017394885, 0.023043979, -0.0060465364, -0.036148023, 0.026223524, 0.015542724, 0.027041562, -0.035098467, -0.0036059276, -0.0035711995, 0.005668387, -0.054546166, 0.04173538, -0.01892292, -0.014084147, -0.009438308, -0.013019154, 0.009260809, 0.0066677826, -0.025637006, 0.022303116, -0.024865272, 0.016360763, 0.005815016, -0.0020393073, 0.014693817, -0.008435054, -0.0032026963, -0.010047978, -0.00690702, -0.0037081824, -0.009384287, -0.036425848, -0.02057443, 0.024788098, -0.004040028, 0.02162399, 0.02225681, -0.024093539, -0.026424175, -0.011213296, -0.007258159, -0.012864807, -0.014223059, -0.016592283, -0.009878196, 0.009006137, -0.018212924, 0.02841525, -0.034758903, -0.013026872, 0.08871855, 0.010642213, -0.020358345, 0.0066330545, 0.007385495, 0.015743375, 0.0286159, -0.021701163, 0.008334728, 0.03029828, 0.024973314, 0.016098373, 0.002849628, -0.00015121164, -0.01592859, 0.002164714, 0.010526453, -0.0097315665, 0.0160212, 0.0063899583, 0.01018689, 0.019030962, -0.006567457, -0.020203998, -0.0018791725, 0.019077266, 0.012378614, -0.006193166, 0.023105718, 0.0065520224, -0.010372106, -0.008195816, 0.024108972, 0.012100791, -0.03877192, 0.036148023, 0.021299861, 0.0339563, 0.017564667, 0.005023989, -0.012563831, 0.035191074, 0.013343282, -0.012779917, -0.025775919, 0.014199907, 0.013381869, 0.010981776, 0.013104045, -0.016731195, 0.0020624592, -0.0018589145, 0.02664026, -0.0026451186, 0.0144931665, 0.0032142724, -0.022442028, -0.008411901, 0.009407438, 0.0047731753, 0.014470014, -0.0073430496, 0.031795446, 0.014632078, 0.0022090888, -0.015735658, 0.005409856, -0.0074896794, -0.0031872618, -0.00016326999, -0.0057995818, -0.013821757, 0.008064621, 0.013073175, -0.004310135, 0.0054021385, 0.042476244, -0.010981776, -0.01994161, 0.0037158995, 0.006042678, -0.006054254, 0.015473268, 0.0070845187, -0.012085356, 0.019370526, 0.0039493493, 0.04994663, 0.025390051, 0.0007862041, -0.013543933, 0.0034400048, -0.016530544, 0.020034216, -0.00931483, -0.010572757, 0.017518364, 0.010333519, -0.011876987, 0.01842901, -0.0062819156, 0.017626407, 0.019540306, 0.002072106, -0.00084746047, -0.014331101, 0.024973314, -0.0011479545, 0.029619154, -0.0036445141, 0.004036169, -0.006594468, -0.010325802, -0.0068298467, -0.012301441, -0.026887216, -0.009855044, -0.0032297072, 0.024217015, -0.025266575, 0.0015753022, -0.0063860994, 0.028770247, -0.00076594605, 0.005463877, 0.0050162715, -0.013034589, -0.009824174, 0.0290172, 0.026655694, -0.0045686658, 0.006088982, -0.007157834, 0.0024097397, 0.037104975, -0.02667113, 0.01862966, -0.0048271967, 0.024325058, -0.006463273, 1.4658425e-05, 0.0073276153, 0.02275072, 0.0070690843, -0.014817295, -0.00081562647, -0.039018877, -0.004167364, 0.0028341934, 0.0094768945, 0.03840149, 0.02954198, 0.023954626, -0.0080106, 0.042229287, 0.0060040914, 0.0030483496, -0.019957043, 0.0029904696, -0.020420084, 0.028600466, -0.020558996, 0.00077414577, 0.012725895, 0.017688146, -0.0018975012, 0.004171223, -0.038370617, -0.032289352, -0.0030425617, 0.032845, -0.011398512, -0.01839814, 0.017194236, 0.033246305, -0.001082357, 0.023568759, -0.016160112, -0.011413947, -0.022133334, -0.016221851, 0.0019515225, 0.012340028, 0.0029885403, 0.029881544, -0.011622315, 0.009175918, -0.01822836, -0.008643421, 0.002164714, 0.017518364, 0.035592377, 0.0030888657, -0.020589866, 0.020497257, -0.0045609483, -0.014331101, -0.006941748, 0.022905068, 0.001369828, 0.026763737, -0.0032181311, 0.0019389819, 0.011614598, -0.0063976757, -0.029387634, 0.005880614, 0.010179172, -0.017055323, -0.012610135, 0.011977313, 0.0020412367, -0.0009130579, -0.008350163, 0.02954198, -0.017364018, 0.009978522, 0.0024541144, -0.013142631, -0.00076546374, 0.0073006046, -0.0036078568, -0.006555881, -0.0018376918, -0.0037197582, 0.01822836, -0.0070304973, -0.005124314, -0.010904603, 0.0054252907, 0.001424814, 0.024355927, -0.0151722925, 0.0144082755, -0.0133046955, 0.0099013485, -0.0018502325, 0.008481357, 0.0025582984, -0.014006973, -0.00751669, -0.016437937, -0.014724687, 0.012062204, -0.016623152, -0.0003578917, 0.028831985, -0.00484649, 0.00051272084, 0.024556579, 0.023815714, -9.158313e-05, 0.023584193, 0.0015945955, -0.005012413, -0.001996862, 0.030174803, 0.018521618, 0.022472896, 0.0040438864, -0.006513436, -0.0029364482, -0.008103208, -0.0069494653, -0.0343576, 0.0007505114, -0.019262483, -0.0039628544, 0.0041635055, -0.014269363, -0.027597211, 0.0024676197, -0.026331566, -0.009939935, -0.02498875, -0.0063089263, 5.1820738e-05, -0.021901812, 0.0044876337, 0.007925709, 0.03398717, 0.040871035, -0.01027178, -0.014014691, 0.0043024174, -0.0053442586, -0.00623947, 0.0024444677, 0.012918829, 0.0071115294, -0.018367272, -0.024633752, 0.016283588, -0.01091232, -0.0049931193, -0.025806788, -0.0115991635, -0.0036850302, 0.008280707, 0.004765458, 0.03988322, 0.007049791, 0.013675128, 0.0020277314, -0.017302278, -0.0045648073, -0.021932682, -0.019308787, -0.01369828, -0.015735658, -0.028461553, 0.015805114, -0.01744119, 0.008674291, 0.021762902, 0.013852627, 0.013713715, -0.015465551, -0.02179377, -0.026979823, -0.003056067, 0.010734821, -0.07272822, -0.0083733145, -0.0021801488, -0.0030251977, 0.006594468, 0.030174803, -0.009654393, -0.020034216, 0.007593863, 0.0070999535, -0.025266575, 0.0030541376, 0.02376941, 0.007809949, -0.011884705, 0.01366741, 0.0022283823, 0.004927522, -0.033215433, -0.019432263, -0.018521618, 0.0013543933, -0.039173223, -0.025297442, 0.005853603, -0.00412106, -0.0007524407, 0.019494003, -0.0056259413, 0.01605207, 0.016175546, -0.0055526267, 0.004151929, -0.007096095, 0.01453947, 0.03241283, 0.008149512, -0.008296141, 0.014292515, -0.0028419108, -0.03732106, 0.025312878, -0.02498875, 0.021284426, -0.009700698, 0.008319293, -0.0026065318, -0.01396067, 0.0028052535, 0.0014180613, -0.004657415, -0.025961135, -0.02083682, -0.009029289, 0.010981776, 0.008774617, -0.0016862389, -0.016329894, 0.0034457927, 0.0048194793, 0.0026779172, -0.031440448, 0.001352464, 0.02011139, -0.008134077, 0.0008050151, -0.012749047, 0.012687309, 0.0171788, -0.006941748, -0.015658485, 0.014462297, -0.015010227, 0.010372106, -0.004391167, -0.0068221292, -0.01102808, -0.0029538122, -0.00333775, 0.022905068, -0.022272246, 0.009507764, 0.017410321, 0.012903394, 0.0020875407, -0.0035750582, 0.022102464, 0.008944398, 0.005351976, -0.007092236, 0.025374617, -0.009075593, -0.0030367735, -0.018598791, -0.017271409, -0.0041133426, 0.010264063, -0.0027087866, 0.021469641, 0.016700326, 0.006447838, -0.042414505, -0.008604835, 0.0034747326, 0.016900977, -0.014084147, -0.009584937, -0.0039493493, -0.02782873, 0.008481357, 0.023877453, 0.018459879, 0.008218968, -0.021160949, -0.03528368, -0.013459043, 0.0015695142, 0.04019191, -0.008604835, -0.018799443, 0.002463761, 0.008188099, -0.004040028, -0.0086279875, 0.00354033, 0.019030962, 0.015311204, 0.0006448803, 0.02733482, -0.019648349, 0.0045455135, 0.0028785681, 0.007948861, -0.014871316, 0.0033338913, -0.017055323, -0.023429846, -0.01343589, 0.011329057, 0.00016170241, 0.015102836, 0.003746769, 0.015882287, 0.0025023478, 0.022380289, 0.02782873, -0.020744212, -0.016654022, -0.0078639705, -0.027751558, 0.0040670387, -0.027257647, 0.009067875, -0.014385124, -0.0025505812, 0.00713854, 0.018567922, 0.0054870294, 0.019401396, 0.001741225, -0.0044529056, 0.00041408357, 0.026748303, 0.05003924, 0.01007113, 0.0060465364, -0.014894468, 0.009237657, -0.024618316, -0.0012704672, 0.0072890283, 0.017996838, 0.014817295, 0.005382845, -0.0028361226, 0.009006137, 0.019555742, -0.005815016, -0.037074104, -0.012702743, -0.015766528, -0.013327847, 0.011043515, 0.0071616923, -0.014145886, 0.012749047, -0.0026624827, -0.023723105, 0.00580344, 0.020219432, -0.011051232, -0.009507764, 0.016746629, 0.023815714, 0.002521641, 0.00583431, 0.002849628, -0.005849744, 0.003810437, 0.026979823, -0.008435054, -0.004090191, -0.026161786, 0.008157229, -0.0060040914, -0.01477099, -0.02472636, 0.013127197, -0.022503765, -0.005595072, -0.0056722453, -0.010348954, 0.013621107, 0.0013235239, -0.016283588, 0.014585774, 0.0011286611, 0.0004538761, 0.012162529, 0.014601209, -0.0034515806, 0.011483403, 0.004028452, 0.0020643887, -0.0151722925, -0.025822222, -0.013096327, -0.015720224, -0.0098164575, -0.009322547, 0.0015974896, 0.010040261, -0.0054484424, 0.027273083, -0.01671576, 0.01862966, -0.011576011, -0.0010997211, -0.018567922, -0.013914365, -0.021917248, 0.02063617, -0.010464714, 0.0012424919, 0.010225477, -0.004858066, 0.013551651, -0.010279498, 0.016206415, 0.029480241, -0.00618159, -0.0004953568, 0.008682009, -0.011004928, 0.019710088, -0.0041943747, 0.0020393073, -0.012100791, -0.0093920035, -0.007829242, -0.030251976, -0.019895304, 0.013690563, 0.0040477454, 0.009947652, -0.0025119944, 0.0033165272, 0.0029518828, -0.001401662, 0.0076671783, 0.0058381683, 0.006945607, -0.010217759, -0.013073175, 0.009029289, -0.0064709904, 0.01825923, 0.011969595, 0.015450116, 0.013621107, 0.0056259413, -0.011591446, -0.002544793, 0.0030174803, 0.017533798, -0.0071694097, 0.004861925, -0.00684914, 0.004375732, -0.00063668063, -0.0004466411, 0.011437099, 0.013945235, 0.0058728964, -0.0017740238, -0.009037006, -0.0097315665, -0.012957416, -0.0072427243, 0.0053249653, 0.012424919, 0.011205579, 0.014076429, 0.0045648073, -0.009237657, -0.012810785, -0.0055063227, -0.0022688983, 0.005155184, -0.017024454, 0.01724054, 0.013212088, -0.03645672, -0.014107299, -0.026609391, -0.00528252, 0.009963087, 0.00873603, 0.005197629, -0.019247048, 0.036549326, -0.00032750465, -0.00079006277, -0.011799814, 0.00972385, 0.01915444, -0.004996978, 0.009268526, 0.005070293, -0.014678382, 0.009237657, 0.014531753, -0.022519201, -0.012702743, -0.0073777777, -0.008898094, -0.015913157, 0.016823802, -0.0036445141, 0.01575881, 0.0028226173, 0.0040593212, -0.0093920035, -0.016468806, 0.00046834612, -0.0009993956, -0.014122734, 0.00862027, 0.014145886, 0.020420084, 0.023908323, 0.0092222225, -0.01671576, 0.0019235472, -0.007319898, -0.005537192, -0.013868062, 0.013196653, 0.009824174, -0.0072774524, 0.008697443, -0.016530544, 0.0074433754, 0.014392841, 0.020034216, -0.019632915, 0.0040631797, 0.009484611, 0.008952116, 0.0026663411, 0.0050664344, 0.0044683404, -0.03026741, -0.038679313, -0.0057918644, 0.007987448, 0.0020335193, -0.023954626, 0.018290097, 0.0050046956, -0.01761097, 0.0011990818, -0.008427336, -0.0023441422, 0.009098745, 0.012926546, -0.004182799, -0.0028284055, 0.00612371, -0.009507764, -0.02202529, 0.0021782194, -0.008952116, -0.00821125, -0.002158926, 0.00057880057, -0.013952952, 0.02225681, 0.0031679685, -0.003787285, -0.011244166, 0.02548266, -0.023074849, -0.02255007, 0.007728917, 0.0054600188, 0.011853836, 0.01056504, 0.015589029, -0.022951372, -0.00041553058, 0.0058111576, -2.8201455e-05, 0.0056452346, -0.016345328, -0.0026566945, -0.022827893, 0.0028110414, -0.0017827058, 0.0031930497, -0.0028341934, -0.0032084845, 0.015396095, 0.015944026, -0.01981813, 0.0060349605, -0.0022804742, 0.027118735, -0.013705998, 0.0053789867, 0.016746629, -0.011097536, 0.011892422, 0.008527662, -0.004587959, -0.008666574, 0.019046398, 0.0057918644, -0.0006579033, -0.017364018, -0.015041097, 0.00911418, -0.0047384473, 0.0066176197, -0.025173966, -0.0059655043, 0.022658113, 0.010480149, -0.014902185, 0.024417667, 0.031440448, 0.02014226, -0.0043217107, 0.0014798001, -0.0020335193, -0.027242213, 0.0013939447, -0.0024714784, 0.0073584844, 0.031888053, -0.011352208, 0.00020487128, 0.008195816, 0.00641311, -0.008149512, 0.003926197, 0.0018888192, -0.007887122, -0.015550442, 0.026377872, 0.010511018, 0.0007509937, -0.029866109, -0.013991538, 0.017348582, 0.01651511, -0.010456997, 0.0032547885, -0.017117063, -0.005926918, -0.016299024, -0.02086769, 0.0111824265, -0.01654598, -0.0024599023, -0.02208703, 0.02011139, -0.014230777, 0.005170618, -0.0027107159, 0.011884705, -0.0073816366, -0.0028997909, 0.0023306368, -0.009716132, -0.028631335, 0.009939935, -0.008975267, -0.020389214, -0.024217015, 0.015720224, 0.009446025, 0.01892292, 0.004344863, 0.011591446, -0.013543933, -0.021978987, -0.010518735, 0.017842492, -0.010356671, 0.020960297, -0.0101560205, 0.002124198, 0.0047615995, 0.009337982, -0.009770153, -0.028523292, -0.0065250117, 0.0034554393, -0.036611065, -0.0122011155, -0.005896048, -0.026439609, -0.017024454, -0.01915444, -0.011907857, -0.0077443514, 0.0014470014, -0.024186146, 0.0016032775, 0.005784147, 0.017425755, 0.00038634936, 0.022040725, 0.01076569, 0.0025081357, -0.0032895165, -0.028646769, 0.0019688865, 4.0455747e-05, -0.014030126, 0.0055989306, -0.020389214, 0.003401418, 0.0024560436, 0.022102464, 0.0023229197, 0.0070227804, -0.010850581, 0.007049791, 0.018413575, -0.01366741, -0.00048763948, -0.0076170154, 0.008527662, 0.012941981, -0.013806323, -0.008157229, 0.009700698, -0.005174477, 0.01442371, 0.021546816, 0.00908331, -0.0021164806, -0.0008706125, 0.006335937, 0.019926174, 0.007319898, -0.0063127847, 0.00027203627, -0.0042098095, 0.00012685379, 0.01935509, 0.015017945, 0.0019196885, -0.0055834963, -0.0160212, 0.024448536, -0.0011518131, 0.0013997327, 0.0071809855, -0.0105804745, 0.010441562, -0.009168201, 0.015913157, -0.005116597, 0.015535007, 0.0010466643, 0.0005522722, -0.004460623, -0.003264435, 0.012077638, 0.036734544, 0.016299024, -0.010279498, 0.0029615297, -0.006332078, 0.019540306, 0.008859507, -0.023167457, 0.0009270456, 0.018938355, -0.02162399, 0.006579033, 0.02040465, 0.01056504, 0.014431427, -0.009754719, 0.0060349605, 0.0037043237, 0.009708415, 0.020034216, 0.016576849, -0.0021608553, -0.0001100324, 0.007539842, -0.03346239, 0.0074742446, -0.0013370293, -0.009268526, 0.020358345, -0.02667113, -0.010788842, -0.0029538122, 0.0122011155, 0.0063860994, -0.012347746, -0.009893631, 0.013952952, -0.008774617, -0.010132869, 0.002124198, 0.019710088, -0.007941144, 0.0029094375, -0.013312413, 0.0015762668, -0.03198066, -0.013590237, -0.004861925, 0.024047233, 0.025143096, 0.0057417015, -0.003740981, 0.008751464, 0.02501962, -0.011676337, -0.007613157, -0.0058227335, -0.011552859, -0.0038741052, -0.020589866, 0.025158532, 0.0020875407, -0.025143096, -0.0077829384, 0.010202325, 0.0049082288, -0.007126964, 0.004649698, 0.026053743, -0.004599535, 0.005494747, -0.024047233, -0.031733707, -0.025992004, -0.028399814, 0.008519944, -0.006934031, -0.008141794, 0.0062703392, 0.01595946, 0.011051232, 0.021901812, 0.026516782, 0.00919907, -0.022905068, -0.007817666, 0.0009603266, -0.008234403, -0.017549234, 0.0122011155, -0.00078089844, -0.014794142, 0.0011170851, 0.007910274, 0.011822966, -0.013412738, 0.0022187354, -0.002405881, 0.0032547885, 0.016669456, 0.00908331, -0.0008807415, -0.0002076447, 0.02393919, 0.0061391448, 0.0018386565, 0.009407438, 0.015434681, 0.004070897, -0.0018637378, -0.014223059, -0.018814877, -0.009492329, 0.013976105, 0.015041097, 0.0024618318, -0.010387541, -0.012525244, -0.017132496, 0.010441562, -0.017626407, 0.020157695, 0.0013187006, -0.0061391448, 0.023784844, -0.0027531614, -0.023290934, -0.022735287, -0.003914621, -0.01027178, -0.004634263, -0.0049198046, 0.004070897, 0.027411995, 0.0036850302, 0.01271046, 0.0007635344, 0.0024772664, 0.00015796431, -0.012934263, 0.012077638, 0.012409484, -0.0070845187, -0.018382706, 0.012154812, -0.0037564156, -0.006590609, 0.02156225, -0.022920502, -0.027658949, 0.010904603, -0.0032779404, -0.0023094143, 0.0007678754, -0.022333985, 0.0020528126, 0.042599723, -0.0048079034, -0.019679219, -0.0021782194, 0.029186983, 0.007883264, 0.011738075, 0.01343589, 0.014585774, 0.017935101, -0.009446025, 0.012031334, 0.014763273, -0.0026123198, 0.00061594025, -0.015766528, -0.014099582, 0.0138989305, 0.016499674, 0.00041577173, -0.0026046026, 0.015133705, -0.010727104, -0.0096466765, -0.014338819, -0.015311204, 0.015573594, -0.029202418, -0.022164203, -0.002803324, -0.00827299, -0.020790515, 0.009754719, 0.00850451, -0.035067596, -0.0024946304, -0.004375732, 0.0033898419, -0.005842027, 0.028662203, 0.026022874, -0.010588191, -0.01457034, -0.00016411407, 0.00024671375, -0.008172664, 0.0030290564, -0.012926546, -0.0021492795, -0.0063513713, 0.0065481635, 0.00031882265, 0.011614598, 0.027705254, 0.006594468, -0.018675964, -0.013721432, 0.0027840307, 0.014562622, -0.024108972, -0.0064208275, -0.0023344955, 0.019169874, 0.017348582, 0.005317248, -0.014477732, -0.0031641098, -0.014963924, -0.01724054, 0.0052439333, -0.019555742, 0.0018627731, 0.0010900744, 0.014655231, 0.014686099, 0.012617853, -0.013844909, -0.006934031, -0.0056838216, 0.030313715, 0.003384054, 0.022982242, 0.00074954674, -0.0008035681, -0.0063899583, 0.005849744, -0.0029962575, -0.008388749, -0.007678754, -0.0022901208, -0.021176383, -0.0025505812, -0.026069177, -0.008342446, -0.022982242, 0.015627615, -0.0032702233, 0.011020362, -0.011166993, -1.1500647e-05, 0.0039281263, 0.017950535, -0.010202325, 0.009446025, 0.002809112, -0.011676337, -0.0012251278, 0.008743747, -0.0037892144, -0.008489075, -0.004090191, -0.01221655, -0.008049186, -0.010032543, -0.008998419, -0.009623524, 0.006521153, -0.0013215946, 0.0023711529, 0.00629735, 0.0077675036, 0.0030927244, 0.0073739192, -4.8444403e-05, -0.017857926, -0.022148767, -0.0004917393, -0.017688146, -0.0077443514, -0.033308044, 0.019463133, -0.0012965132, -0.013381869, 0.0076170154, -0.012525244, 0.012525244, -0.013381869, -0.0051667597, -0.035993677, -0.01137536, -0.019339656, 0.011429382, 0.019277917, 0.004510786, 0.011923292, 0.010819712, -0.0062819156, 0.0059732217, 0.00013348588, 0.009777871, 0.009492329, -0.0018212924, -0.005074152, -0.012231985, 0.002336425, -0.01282622, 0.002849628, -0.012864807, 0.005475453, 0.012208833, -0.0089675505, -0.0049815434, -0.006671641, -0.01816662, -0.006852999, -0.026655694, -0.005934635, -0.012370897, -0.0071192468, -0.0064092516, 0.01308861, -0.010086564, 0.010518735, -0.01140623, -0.015596746, -0.026810043, 0.0101560205, -6.698411e-05, -0.013976105, 0.0037101116, 0.012093073, 0.02162399, -0.0015338215, 0.019771827, 0.009006137, -0.014091864, -0.006802836, -0.01186927, 0.0042213853, -0.018845746, 0.003378266, 0.0015965248, -0.03125523, -0.009847327, 0.012803068, -0.0099013485, 0.0039975825, -0.002486913, -0.012463505, 6.6863526e-05, -0.004831055, 0.027736124, 0.015434681, -0.015141423, 0.008489075, 0.0018155044, -0.0017248257, 0.0015347862, 0.0007432764, -0.00012588913, -0.015604463, -0.0019139005, 0.01082743, 0.0023132728, -0.0018068224, -0.0052246395, 0.023198327, 0.016576849, -0.0021994421, 0.001715179, 0.0010997211, 0.02054356, 0.01935509, -0.011444816, 0.035067596, -0.012069921, 0.0052477918, 0.0077559277, 0.02275072, -0.019632915, 0.0076633194, 0.009106462, -0.008226685, 0.002866992, 0.0045377966, -0.0009815493, 0.02057443, -0.00780609, 0.0003402865, -0.009939935, -0.003189191, 0.0020122966, 0.012803068, 0.0111824265, -0.017086193, -0.003978289, 0.01166862, 0.017518364, 0.0046651326, -0.013829474, 0.0011817178, -0.009909065, -0.013590237, -0.021917248, 0.020435518, -0.0071231057, 0.0050625755, -0.0011875058, -0.020265738, 0.02545179, 0.0063590887, -0.008859507, -0.010734821, 0.015666202, 0.024247885, 0.013852627, -0.014786425, -0.007620874, 0.002998187, 0.014176755, -0.0048426315, -0.002048954, -0.0040207347, 0.00931483, -0.011830684, -0.021423338, 0.011884705, 0.0101560205, 0.00690702, 0.03651846, -0.02281246, -0.028075686, 0.016175546, -0.014732404, -0.009932217, 0.016175546, -0.010588191, -0.014045561, 0.011483403, -0.025976568, 0.005714691, 0.017996838, 0.0015473268, 0.00031737564, -0.014524035, 0.004634263, -0.010711669, -0.0017672711, -0.005201488, 0.013026872, 0.0016611576, 0.024834402, -0.005606648, 0.008435054, 0.00018220159, -0.016468806, -0.021315295, -0.0043410044, -0.0021087634, -0.008790052, 0.026192654, -0.006428545, -0.009337982, -0.009384287, 0.02393919, 0.0035750582, -0.009963087, -0.0014412134, -0.004858066, -0.012980567, 0.014925337, 0.010287215, 0.003476662, 0.0027840307, 0.005336541, -0.0063050673, -0.009600372, -0.024371363, -0.020682473, -0.0083733145, 0.011035797, -0.023954626, -0.027535472, 0.0010437703, 0.013567085, 0.0071346816, -0.01648424, -0.011012645, 0.0012067992, -0.005876755, -0.004391167, -0.005043282, -0.021778336, 0.010557322, 0.009638959, -0.016252719, -0.009260809, 0.0035673408, -0.021515947, -0.0052439333, 0.00995537, -0.0054870294, 0.007200279, 0.0056143655, 0.0031293817, -0.012417201, 0.0044027427, 0.0010862157, 4.488719e-05, -0.0030811483, 0.0012637145, -0.003021339, 0.007995165, -0.00052284985, 0.0011093677, -0.0013235239, -0.018382706, -0.021469641, 0.022997675, -0.00022319997, -0.0064401207, 0.020327475, -0.010981776, -0.008689726, -0.014315668, 0.0054831705, 0.020805951, 0.011969595, -0.0074086473, -0.008774617, 0.025065923, -0.010148304, -0.00132063, -0.006301209, -0.0251894, -0.028214598, 0.015110553, 0.016252719, -0.009824174, -0.0075822873, 0.011722641, 0.020913994, -0.008195816, -0.012733612, -0.01866053, -0.014979359, 0.0045262203, 0.019370526, 0.004395026, 0.0080106, -0.003085007, 0.010480149, -0.019586612, -0.0013100186, 0.019648349, -0.005548768, -0.009600372, -0.020358345, -0.02858503, 0.009747001, -0.0012135518, -0.021732032, -0.014500883, 0.010032543, 0.022797024, -0.015079684, 0.015125988, -0.021145513, -0.0033088098, -0.0006593503, 0.008249837, -0.02159312, 0.006274198, -0.0054523014, 0.011429382, -0.019293353, -0.009986239, 0.006401534, -0.0012550326, 0.0015318921, 0.0037390515, -0.010719386, 0.0038953277, 0.0013013366, 0.0032316365, -0.0060195257, -0.020188564, 0.009839609, -0.017996838, -0.01027178, 0.00496225, -0.009739284, -0.0041133426, -0.004051604, 0.00096611463, -0.035499766, 0.008056904, -0.0034284287, -0.008141794, -0.027026128, -0.028631335, 0.008450489, 0.004800186, -0.017255975, 0.033832822, 0.0030483496, -0.008496792, 0.008103208, 0.010318085, -0.004132636, 0.008342446, 0.0076671783, -0.002940307, -0.010626778, -0.014331101, 0.027550906, -0.01358252, -0.029958718, -0.0015183868, 0.011305904, 0.021160949, -0.020095956, -0.000998431, -0.0105033, -0.007948861, -0.0033454672, -0.0049043703, -0.0068877265, 0.031471316, -0.024186146, 0.013065458, 0.02330637, -0.01430795, 0.0074510924, -0.0065250117, 0.030020455, 0.0028708507, -0.0017518364, 0.0040053, -0.006235611, 0.019401396, 0.00824212, -0.00048812182, -0.010619061, 0.012340028, 0.006478708, -0.03241283, -0.040531475, -0.0055796374, -0.013543933, 0.0040438864, 0.029495677, -0.011560577, 0.011213296, 0.008026035, 0.023059415, 0.006073547, -0.018799443, -0.008319293, 0.004915946, 0.01671576, 0.0011826825, 0.0016042423, 0.001956346, 0.008836355, 0.005818875, 0.023584193, -0.0077211997, 0.023167457, 0.008519944, -0.0071616923, 0.0018126104, 0.002544793, 0.028955463, 0.028986333, 0.012131659, -0.0008556602, -0.0033145978, -0.011838401, -0.00059037656, -0.002963459, 0.0061275684, -0.011514273, 0.0012338099, -0.0011633892, -0.01027178, -0.00054310786, 0.041982334, -0.006382241, 0.023491586, 0.028060252, 0.016206415, 0.005433008, -0.012980567, 0.013235239, -0.0041403533, 0.0074510924, -0.0015724082, 0.014763273, -0.013343282, 0.0017566597, -0.0026528358, 0.037598886, 0.025544398, 0.010256346, 0.019077266, -0.00017653417, -0.0046304045, 0.011846119, 0.003993724, -0.0074086473, 0.012895676, 0.011475686, 0.013111762, -0.0035133194, -0.0021859368, -0.0088826595, 0.031563923, 0.002158926, 0.010788842, -0.025992004, 0.032320224, -0.0019611693, -0.017935101, -0.023584193, 0.016252719, 0.0037139703, -0.026547652, 0.0058844723, 0.030668713, -0.002278545, -0.008751464, -0.009685263, 0.005876755, 0.0028341934, -0.008303858, 0.014446862, 0.010634496, 0.004364156, -0.002077894, -0.01747206, -0.0059732217, -0.01320437, -0.027504602, 0.010024826, -0.00057301257, -0.020188564, -0.017255975, -0.00051850884, -0.015048815, 0.009584937, 0.008558531, -0.016746629, -0.0045841006, 0.0019688865, -0.0053403997, -0.006498001, -0.03914235, 0.011089819, -0.013914365, 0.009121897, 0.0057185497, 0.021268992, -0.010210042, -0.016746629, 0.016237285, 0.014331101, 0.018058578, 0.025266575, 0.0023209902, 0.01274133, -0.006370665, -0.0013891214, 0.009600372, 0.004202092, -0.010464714, 0.0043139937, 0.0171788, 0.010634496, 0.005270944, 0.0122011155, -0.016082939, -0.0011518131, -0.012517527, 0.025822222, -0.0039049746, -0.0102409115, 0.0034322874, -0.028770247, -0.013837192, 0.0040824735, -0.011444816, 0.008597118, -0.01007113, -0.0049468153, 0.0012019759, 0.0056799627, -0.011336774, -0.02202529, 0.002907508, 0.010449279, -0.012170247, 0.014948489, -0.026485914, -0.0076285913, -0.014956206, 0.014724687, 0.021315295, 0.019972477, 0.008682009, 0.000982514, -0.009361135, 0.002417457, 0.011622315, 0.015125988, -0.00048571013, 0.00966211, -0.025158532, 0.0034207113, -0.011730358, 0.007875546, -0.0035750582, 0.010680799, 0.016931845, 0.00047196363, 0.0040091584, -0.002101046, -0.019432263, -0.008218968, 0.0016428289, 0.0044876337, -0.0005296025, 0.013428173, 0.0171788, -0.014138169, -0.029896978, 0.0024444677, 0.006941748, -0.005444584, 0.003970572, 0.007061367, 0.0069378894, 0.015195444, 0.020991167, -0.0017682357, -0.006382241, 0.009878196, -0.014284798, 0.0005160972, -0.01886118, 0.012996002, 0.054978337, -0.031455882, -0.002043166, 0.0115219895, -0.015187726, 0.016221851, 0.014670664, 0.009368852, -0.009276244, 0.011313622, -0.039049745, -0.031733707, 0.01163775, 0.009870479, -0.009361135, -0.014639796, -0.020157695, -0.0050664344, 0.0004943921, -0.0053712693, -0.001375616, -0.0062587634, -0.0067295213, 0.01605207, -0.013891214, 0.031008275, -0.028152859, -0.015280335, -0.008959833, -0.0240318, 0.014331101, -0.006687076, 0.031147188, 0.011498838, 0.0048387726, 0.0028747094, -0.006077406, 0.009893631, 0.006193166, -0.01018689, 0.0033570433, 0.014315668, 0.00078668643, -0.0047384473, -0.014925337, -0.012401767, 0.018043144, -0.012656439, 0.047291864, -0.0073584844, 0.00034728035, -0.011483403, 0.015156858, -0.014979359, -0.006112134, -0.0076363087, -0.0076478845, -0.007925709, -0.0017402604, 0.013536216, -0.014655231, -0.00032774583, -0.0011286611, 0.0058458857, -0.004892794, -0.013590237, -0.021762902, 0.003775709, 0.005382845, 0.004603394, -0.0059076245, -0.021176383, 0.014971641, -0.002687564, 0.008566248, -0.010433845, -0.0007620874, 0.0018145398, 0.018552488, -0.014732404, 0.013790888, -0.013343282, 0.0007259124, 0.0013187006, 0.0035847048, -0.010804277, -0.01886118, 0.0058111576, -0.02350702, 0.008126359, -0.022303116, 0.01320437, 0.008095491, 0.0038876105, -0.013412738, -0.016669456, -0.008226685, 0.016283588, -0.0029306603, -0.025853092, -0.01654598, 0.0017171083, -0.031193491, 0.0037332636, -0.0054600188, 0.020389214, 0.0063629476, 0.0005831416, -0.0056375177, 0.0058227335, 0.0022515343, -0.00082672015, 0.018969223, -0.02057443, 0.0045648073, -0.000978173, -0.0015859136, -0.018459879, -0.0037737796, 0.03729019, -0.0045030685, -0.014130451, -0.01224742, -0.011275035, 0.016623152, 0.010279498, 0.008612553, -0.0105804745, 0.005151325, 0.020358345, 0.0064324033, -0.0044683404, 0.0019746746, 0.0022129475, 0.011537424, 0.008666574, -0.006980335, -0.007223431, -0.0068414225, 0.0054059974, -0.007644026, 0.025559833, -0.015095118, 0.011398512, 0.01599033, 0.016391631, -0.005618224, -0.008782334, -0.007412506, 0.02548266, -0.023630498, -0.002600744, -0.011576011, -0.0063282195, -0.0010746397, 0.00016507875, 0.020481823, 0.014763273, -0.0033165272, 0.021315295, 0.0075900047, 0.007173268, 0.002434821, -0.01082743, 0.007497397, 0.0251894, 0.0020759646, 0.025930265, 0.0067835427, 0.008056904, -0.02278159, 0.013590237, -0.028106555, 0.002423245, 0.02159312, 0.024186146, 0.003978289, 0.024618316, 0.022627244, -0.006154579, 0.014624361, 0.001453754, -0.0011981172, 0.008350163, 0.046828825, -0.007725058, -0.0037776383, -0.010511018, 0.010804277, 0.009507764, 0.011892422, -0.0025235706, -0.01190014, 0.012756764, 0.008666574, 0.03185718, 0.013574802, 0.010588191, 0.014902185, 0.0022013714, 0.02887829, 0.0010601697, 0.012494375, 0.033771083]]}