{"Metadata": {"spec": "25.501", "CR": "6229", "revision": "2", "Impacted Version": "18.6.0", "Target Release": "Rel-18", "CR status at WG": "postponed", "Title": "Update UL PDU Set handling when inter-system change", "Source to WG": "Nokia", "Source to TSG": "C1", "Work item code": "XRM", "Category": "F", "Reason for change": "when the UL PDU session for XR was established in 5GS and\ninter-system mode change happens from N1 mode to S1 mode to EPS, the UE\n(also SMF) needs to remember and maintain the protocol description (if\navailable).\nIf the PDN connection for XR was established in EPS, when the UE\nmoves to 5GS, the network may share share protocol description for the\nPDU sets, if applicable.", "Summary of change": "Stage 3 specification updated to maintain Protocol description\nassociated with PDU sets due to inter-system mode change between N1 and\nS1 mode", "Consequences if not approved": "UL PDU set handling cannot be possible due to inter-system mode\nchange", "Clauses affected": "6.1.4.1, 6.3.2.2", "N": "", "Other specs": "", "X": "O&M Specifications", "affected": "", "(show related CRs)": "", "Other comments": "", "This CR's revision history": ""}, "titles_list": [{"Header 4": "6.1.4.1 Coordination between 5GSM and ESM with N26 interface"}, {"Header 4": "6.3.2.2 Network-requested PDU session modification procedure initiation"}], "contents_list": ["Interworking with EPS is supported for a PDU session, if the PDU session\nincludes the mapped EPS bearer context(s) or has association(s) between\nQoS flow and mapped EPS bearer after inter-system change from S1 mode to\nN1 mode. The SMF shall not include any mapped EPS bearer contexts\nassociated with a PDU session for LADN and with a PDU session which is a\nmulti-homed IPv6 PDU session. If the UE receives any mapped EPS bearer\ncontext for a PDU session for LADN or for a multi-homed IPv6 PDU\nsession, the UE may locally delete the mapped EPS bearer context. See\ncoding of the Mapped EPS bearer contexts IE in subclause 9.11.4.8. In an\nMA PDU session, the UE shall have one set of the mapped EPS bearer\ncontexts. The network can provide the set of the mapped EPS bearer\ncontexts of the MA PDU session via either access of the MA PDU session.\nIn an MA PDU session, the UE shall support modification or deletion via\nan access of a mapped EPS bearer context of the MA PDU session created\nvia the same or the other access.  \nUpon inter-system change from N1 mode to S1 mode, the UE shall create\nthe default EPS bearer context and the dedicated EPS bearer context(s)\nbased on the parameters of the mapped EPS bearer contexts or the\nassociations between QoS flow and mapped EPS bearer in the PDU session,\nif available. The EPS bearer identity assigned for the QoS flow of the\ndefault QoS rule becomes the EPS bearer identity of the default bearer\nin the corresponding PDN connection. If there is no EPS bearer identity\nassigned to the QoS flow of the default QoS rule of a PDU session\nassociated with 3GPP access, or if there is no corresponding mapped EPS\nbearer contexts associated with the EPS bearer identity assigned to the\nQoS flow of the default QoS rule of a PDU session associated with 3GPP\naccess:  \na\\) the PDU session is not an MA PDU session established over both 3GPP\naccess and non-3GPP access, the UE shall perform a local release of the\nPDU session; or  \nb\\) the PDU session is an MA PDU session established over both 3GPP\naccess and non-3GPP access, the UE shall perform a local release of the\nPDU session over 3GPP access and consider that the MA PDU session is\nestablished over non-3GPP access only.  \nIf there is no EPS bearer identity assigned to the QoS flow(s) of a PDU\nsession associated with 3GPP access which is not associated with the\ndefault QoS rule, or if there is no corresponding mapped EPS bearer\ncontexts associated with the EPS bearer identity assigned to the QoS\nflow of the non-default QoS rule of a PDU session associated with 3GPP\naccess, unless the PDU session is an MA PDU session established over\n3GPP access and over non-3GPP access, the UE shall locally delete the\nQoS rules and the QoS flow description(s). The UE uses the parameters\nfrom each PDU session for which interworking with EPS is supported to\ncreate corresponding default EPS bearer context and optionally dedicated\nEPS bearer context(s) as follows:  \na\\) the PDU session type of the PDU session shall be mapped to the PDN\ntype of the default EPS bearer context as follows:  \n1\\) the PDN type shall be set to \\\"non-IP\\\" if the PDU session type is\n\\\"Unstructured\\\";  \n2\\) the PDN type shall be set to \\\"IPv4\\\" if the PDU session type is\n\\\"IPv4\\\";  \n3\\) the PDN type shall be set to \\\"IPv6\\\" if the PDU session type is\n\\\"IPv6\\\";  \n4\\) the PDN type shall be set to \\\"IPv4v6\\\" if the PDU session type is\n\\\"IPv4v6\\\";  \n5\\) the PDN type shall be set to \\\"non-IP\\\" if the PDU session type is\n\\\"Ethernet\\\", and the UE, the network or both of them do not support\nEthernet PDN type in S1 mode; and  \n6\\) the PDN type shall be set to \\\"Ethernet\\\" if the PDU session type is\n\\\"Ethernet\\\" and the UE and the network support Ethernet PDN type in S1\nmode;  \nb\\) the PDU address of the PDU session shall be mapped to the PDN\naddress of the default EPS bearer context as follows:  \n1\\) the PDN address of the default EPS bearer context is set to the PDU\naddress of the PDU session, if the PDU session type is \\\"IPv4\\\",\n\\\"IPv6\\\" or \\\"IPv4v6\\\"; and  \n2\\) the PDN address of the default EPS bearer context is set to zero, if\nthe PDU session type is \\\"Ethernet\\\" or \\\"Unstructured\\\";  \nc\\) the DNN of the PDU session shall be mapped to the APN of the default\nEPS bearer context, unless the PDU session is an emergency PDU session;  \nd\\) the APN-AMBR and extended APN-AMBR received in the parameters of the\ndefault EPS bearer context of the mapped EPS bearer contexts shall be\nmapped to the APN-AMBR and extended APN-AMBR of the default EPS bearer\ncontext;  \ne\\) for each PDU session in state PDU SESSION ACTIVE, PDU SESSION\nMODIFICATION PENDING or PDU SESSION INACTIVE PENDING:  \n1\\) if the UE is performing an inter-system change from N1 mode to WB-S1\nmode, the UE shall set the state of the mapped EPS bearer context(s) to\nBEARER CONTEXT ACTIVE; or  \n2\\) if the UE is performing an inter-system change from N1 mode to NB-S1\nmode, for the mapped EPS bearer context corresponding to the default EPS\nbearer, the UE shall set the state of the mapped EPS bearer context to\nBEARER CONTEXT ACTIVE. Additionally, if the UE is performing an\ninter-system change from WB-N1 mode to NB-S1 mode, for the mapped EPS\nbearer context corresponding to a dedicated EPS bearer, if any, the UE\nshall set the state of the mapped EPS bearer context to BEARER CONTEXT\nINACTIVE; and  \nf\\) for any other PDU session the UE shall set the state of the mapped\nEPS bearer context(s) to BEARER CONTEXT INACTIVE.  \nAdditionally, for each mapped EPS bearer context or the association\nbetween QoS flow and mapped EPS bearer in the PDU session:  \na\\) the EPS bearer identity shall be set to the EPS bearer identity\nreceived in the mapped EPS bearer context, or the EPS bearer identity\nassociated with the QoS flow;  \nb\\) the EPS QoS parameters shall be set to the mapped EPS QoS parameters\nof the EPS bearer received in the mapped EPS bearer context, or the EPS\nQoS parameters associated with the QoS flow;  \nc\\) the extended EPS QoS parameters shall be set to the mapped extended\nEPS QoS parameters of the EPS bearer received in the mapped EPS bearer\ncontext, or the extended EPS QoS parameters associated with the QoS\nflow; and  \nd\\) the traffic flow template shall be set to the mapped traffic flow\ntemplate of the EPS bearer received in the mapped EPS bearer context, or\nthe stored traffic flow template associated with the QoS flow, if\navailable.  \nAfter inter-system change from N1 mode to S1 mode, the UE shall\nassociate the PDU session identity, the S-NSSAI, and the session-AMBR\nwith the default EPS bearer context, and for each EPS bearer context\nmapped from one or more QoS flows, associate the QoS rule(s) for the QoS\nflow(s) and the QoS flow description(s) for the QoS flow(s) with the EPS\nbearer context.  \nIf the PDU session is associated with the control plane only indication\nand supports interworking with EPS, after inter-system change from N1\nmode to S1 mode, the UE shall associate the EPS bearer context(s) of the\nPDN connection corresponding to the PDU session with the control plane\nonly indication.  \nIf the PDU session is associated with a PDU session pair ID, after\ninter-system change from N1 mode to S1 mode, the UE shall associate the\ndefault EPS bearer context of the PDN connection corresponding to the\nPDU session with the PDU session pair ID. If the PDU session is\nassociated with an RSN, after inter-system change from N1 mode to S1\nmode, the UE shall associate the default EPS bearer context of the PDN\nconnection corresponding to the PDU session with the RSN.  \nAfter inter-system change from N1 mode to S1 mode, if:  \na\\) the UE sent the URSP provisioning in EPS support indicator and\nreceived the URSP provisioning in EPS support indicator in the PDU\nsession; or  \nb\\) the PDU session is associated with the URSP provisioning in EPS\nsupport indicators;  \nthe UE shall associate the default EPS bearer context of the PDN\nconnection corresponding to the PDU session with the URSP provisioning\nin EPS support indicators.  \nAfter inter-system change from N1 mode to S1 mode, the UE and the SMF\nshall maintain the PDU session type of the PDU session until the PDN\nconnection corresponding to the PDU session is released if the UE\nsupports non-IP PDN type and the PDU session type is \\\"Ethernet\\\" or\n\\\"Unstructured\\\".  \nAfter inter-system change from N1 mode to S1 mode, the UE and the SMF\nshall maintain the following 5GSM attributions and capabilities\nassociated with the PDU session until the PDN connection corresponding\nto the PDU session is released:  \na\\) the always-on PDU session indication;  \nb\\) the maximum number of supported packet filters;  \nc\\) the support of reflective QoS;  \nd\\) the maximum data rate per UE for user-plane integrity protection\nsupported by the UE for uplink and the maximum data rate per UE for\nuser-plane integrity protection supported by the UE for downlink;  \ne\\) the support of multi-homed IPv6 PDU session; and  \nf\\) if the PDU session is an MA PDU session established over 3GPP\naccess, the PDN connection of the default EPS bearer corresponding to\nthe MA PDU session shall be considered as a user-plane resource of the\nMA PDU session.  \nAfter inter-system change from N1 mode to S1 mode, the UE operating in\nsingle-registration mode in a network supporting N26 interface shall\ndeem that the following features are supported by the network on the PDN\nconnection corresponding to the PDU session:  \na\\) PS data off; and  \nb\\) Local address in TFT.  \nIf there is a QoS flow used for IMS signalling, after inter-system\nchange from N1 mode to S1 mode, the EPS bearer associated with the QoS\nflow for IMS signalling becomes the EPS bearer for IMS signalling.  \nAfter inter-system change from N1 mode to S1 mode, the SMF shall\nmaintain protocol description for UL PDU set handling, if available,\nuntil the PDN connection corresponding to the PDU session is released.  \nWhen the UE is provided with a new session-AMBR in the Protocol\nconfiguration options IE or Extended protocol configuration options IE\nin the MODIFY EPS BEARER CONTEXT REQUEST message, the UE shall discard\nthe corresponding association and associate the new valuewith the\ndefault EPS bearer context.  \nThe network may provide the UE with one or more QoS rules by including\neither one QoS rules parameter, or one QoS rules with the length of two\noctets parameter, but not both, in the Protocol configuration options IE\nor Extended protocol configuration options IE in the MODIFY EPS BEARER\nCONTEXT REQUEST message. The network may provide the UE with one or more\nQoS flow descriptions corresponding to the EPS bearer context being\nmodified, by including either one QoS flow descriptions parameter, or\none QoS flow descriptions with the length of two octets parameter, but\nnot both, in the Protocol configuration options IE or Extended protocol\nconfiguration options IE in the MODIFY EPS BEARER CONTEXT REQUEST\nmessage.  \nWhen the UE is provided with one or more QoS flow descriptions or the\nEPS bearer identity of an existing QoS flow description is modified in\nthe Protocol configuration options IE or Extended protocol configuration\noptions IE in the MODIFY EPS BEARER CONTEXT REQUEST message, the UE\nshall check the EPS bearer identity included in the QoS flow\ndescription; and:  \na\\) if the EPS bearer identity corresponds to the EPS bearer context\nbeing modified or the EPS bearer identity is not included, the UE shall\nstore the QoS flow description and all the associated QoS rules, if any,\nfor the EPS bearer context being modified for use during inter-system\nchange from S1 mode to N1 mode; and  \nb\\) otherwise the UE shall locally delete the QoS flow description and\nall the associated QoS rules, if any, and include a Protocol\nconfiguration options IE or Extended protocol configuration options IE\nwith a 5GSM cause parameter set to 5GSM cause #84 \\\"syntactical error in\nthe QoS operation\\\" in the MODIFY EPS BEARER CONTEXT ACCEPT message.  \nWhen the UE is provided with one or more QoS rules, or one or more QoS\nflow descriptions in the Protocol configuration options IE or Extended\nprotocol configuration options IE in the MODIFY EPS BEARER CONTEXT\nREQUEST message, the UE shall process the QoS rules sequentially\nstarting with the first QoS rule and shall process the QoS flow\ndescriptions sequentially starting with the first QoS flow description.\nThe UE shall check the QoS rules and QoS flow descriptions for different\ntypes of errors as follows:  \nNOTE 1: If an error is detected in a QoS rule or a QoS flow description\nwhich requires sending a Protocol configuration options IE or Extended\nprotocol configuration options IE with a 5GSM cause value, then the QoS\nrules parameter, the QoS rules with the length of two octets parameter,\nthe QoS flow descriptions parameter and the QoS flow descriptions with\nthe length of two octets parameter included in the Protocol\nconfiguration options IE or Extended protocol configuration options IE\nin the MODIFY EPS BEARER CONTEXT REQUEST message are discarded, if any.  \nNOTE 2: If the EPS bearer context modification procedure is rejected,\nthen the QoS rules parameter, the QoS rules with the length of two\noctets parameter, the QoS flow descriptions parameter and the QoS flow\ndescriptions with the length of two octets parameter included in the\nProtocol configuration options IE or Extended protocol configuration\noptions IE in the MODIFY EPS BEARER CONTEXT REQUEST message are\ndiscarded, if any.  \na\\) Semantic errors in QoS operations:  \n1\\) When the rule operation is \\\"Modify existing QoS rule and add packet\nfilters\\\", \\\"Modify existing QoS rule and replace all packet filters\\\",\n\\\"Modify existing QoS rule and delete packet filters\\\" or \\\"Modify\nexisting QoS rule without modifying packet filters\\\" on the default QoS\nrule and the DQR bit is set to \\\"the QoS rule is not the default QoS\nrule\\\".  \n2\\) When the rule operation is \\\"Modify existing QoS rule and add packet\nfilters\\\", \\\"Modify existing QoS rule and replace all packet filters\\\",\n\\\"Modify existing QoS rule and delete packet filters\\\" or \\\"Modify\nexisting QoS rule without modifying packet filters\\\" on a QoS rule which\nis not the default QoS rule and the DQR bit is set to \\\"the QoS rule is\nthe default QoS rule\\\".  \n3\\) When the rule operation is \\\"Create new QoS rule\\\" and the DQR bit\nis set to \\\"the QoS rule is the default QoS rule\\\" when there\\'s already\na default QoS rule with different QoS rule identifier.  \n4\\) When the rule operation is \\\"Delete existing QoS rule\\\" on the\ndefault QoS rule.  \n5\\) When the rule operation is \\\"Create new QoS rule\\\", \\\"Modify\nexisting QoS rule and add packet filters\\\", \\\"Modify existing QoS rule\nand replace all packet filters\\\", \\\"Modify existing QoS rule and delete\npacket filters\\\", or \\\"Modify existing QoS rule without modifying packet\nfilters\\\" and two or more QoS rules associated with this PDU session\nwould have identical precedence values.  \n6\\) When the rule operation is \\\"Modify existing QoS rule and delete\npacket filters\\\", the QoS rule is a QoS rule of a PDU session of IPv4,\nIPv6, IPv4v6 or Ethernet PDU session type, and the packet filter list in\nthe resultant QoS rule is empty.  \n7\\) When the rule operation is \\\"Create new QoS rule\\\", and there is\nalready an existing QoS rule with the same QoS rule identifier and the\nexisting QoS rule is associated with a QoS flow description stored for\nthe EPS bearer context being modified or the existing QoS rule is not\nassociated with any QoS flow description.  \n8\\) When the rule operation is \\\"Modify existing QoS rule and add packet\nfilters\\\", \\\"Modify existing QoS rule and replace all packet filters\\\",\n\\\"Modify existing QoS rule and delete packet filters\\\", or \\\"Modify\nexisting QoS rule without modifying packet filters\\\" and there is no\nexisting QoS rule with the same QoS rule identifier associated with a\nQoS flow description stored for the EPS bearer context being modified.  \n9\\) When the rule operation is \\\"Delete existing QoS rule\\\" and there is\nno existing QoS rule with the same QoS rule identifier associated with a\nQoS flow description stored for the EPS bearer context being modified.  \n10\\) When the flow description operation is \\\"Create new QoS flow\ndescription\\\" and there is already an existing QoS flow description with\nthe same QoS flow identifier stored for the EPS bearer context being\nmodified.  \n11\\) When the flow description operation is \\\"Modify existing QoS flow\ndescription\\\" and there is no existing QoS flow description with the\nsame QoS flow identifier stored for the EPS bearer context being\nmodified.  \n12\\) When the flow description operation is \\\"Delete existing QoS flow\ndescription\\\" and there is no existing QoS flow description with the\nsame QoS flow identifier stored for the EPS bearer context being\nmodified.  \n13\\) When the UE determines that:  \ni\\) the default EPS bearer context is associated with one or more QoS\nflows but the default EPS bearer context is not associated with the\ndefault QoS rule.  \nii\\) a dedicated EPS bearer context is associated with one or more QoS\nflows but the dedicated EPS bearer context is associated with the\ndefault QoS rule.  \n14\\) When the rule operation is \\\"Create new QoS rule\\\" and there is\nalready an existing QoS rule with the same QoS rule identifier\nassociated with a QoS flow description stored for an EPS bearer context\ndifferent from the EPS bearer context being modified and belonging to\nthe same PDN connection as the EPS bearer context being modified.  \n15\\) When the flow description operation is \\\"Create new QoS flow\ndescription\\\", and there is already an existing QoS flow description\nwith the same QoS flow identifier stored for an EPS bearer context\ndifferent from the EPS bearer context being modified and belonging to\nthe same PDN connection as the EPS bearer context being modified.  \n16\\) When the rule operation is \\\"Create new QoS rule\\\", \\\"Modify\nexisting QoS rule and add packet filters\\\", \\\"Modify existing QoS rule\nand replace all packet filters\\\", \\\"Modify existing QoS rule and delete\npacket filters\\\", or \\\"Modify existing QoS rule without modifying packet\nfilters\\\" and the resultant QoS rule is associated with a QoS flow\ndescription stored for an EPS bearer context different from the EPS\nbearer context being modified.  \n17\\) When the rule operation is \\\"Create new QoS rule\\\", the DQR bit is\nset to \\\"the QoS rule is not the default QoS rule\\\", the QoS rule is\nprovided for a PDN connection of PDN type \\\"non-IP\\\" and there is\nlocally available information associated with the PDN connection that is\nset to \\\"Unstructured\\\".  \n18\\) When the flow description operation is \\\"Create new QoS flow\ndescription\\\" or \\\"Modify existing QoS flow description\\\", the QFI\nassociated with the QoS flow description is not the same as the QFI of\nthe default QoS rule, the QoS flow description is provided for a PDN\nconnection of PDN type \\\"non-IP\\\" and there is locally available\ninformation associated with the PDN connection that is set to\n\\\"Unstructured\\\".  \n19\\) When the rule operation is \\\"Modify existing QoS rule and add\npacket filters\\\", the \\\"packet filter list\\\" field contains a match-all\npacket filter, the resultant QoS rule is the default QoS rule and there\nis already an existing match-all packet filter associated with the\ndefault QoS rule.  \n20\\) When the rule operation is \\\"Create new QoS rule\\\" and the DQR bit\nis set to \\\"the QoS rule is not the default QoS rule\\\", or the rule\noperation is \\\"Modify existing QoS rule and add packet filters\\\" on a\nQoS rule which is not the default QoS rule or \\\"Modify existing QoS rule\nand replace all packet filters\\\" on a QoS rule which is not the default\nQoS rule, and one match-all packet filter is to be associated with the\nresultant QoS rule.  \nIn case 5, if the old QoS rule (i.e. the QoS rule that existed before\nthe MODIFY EPS BEARER CONTEXT REQUEST message was received) is not the\ndefault QoS rule and the old QoS rule is associated with a QoS flow\ndescription stored for the EPS bearer context being modified, the UE\nshall not diagnose an error, shall further process the new request and,\nif it was processed successfully, shall delete the old QoS rule which\nhas identical precedence value. Otherwise, the UE shall include a\nProtocol configuration options IE or Extended protocol configuration\noptions IE with a 5GSM cause parameter set to 5GSM cause #83 \\\"semantic\nerror in the QoS operation\\\" in the MODIFY EPS BEARER CONTEXT ACCEPT\nmessage.  \nIn case 6, if the QoS rule is not the default QoS rule, the UE shall\ndelete the QoS rule. If the QoS rule is the default QoS rule, the UE\nshall include a Protocol configuration options IE or Extended protocol\nconfiguration options IE with a 5GSM cause parameter set to 5GSM cause\n#83 \\\"semantic error in the QoS operation\\\" in the MODIFY EPS BEARER\nCONTEXT ACCEPT message.  \nIn case 7, if the existing QoS rule is not the default QoS rule and the\nDQR bit of the new QoS rule is set to \\\"the QoS rule is not the default\nQoS rule\\\", the UE shall not diagnose an error, further process the\ncreate request and, if it was processed successfully, delete the old QoS\nrule (i.e. the QoS rule that existed when case 7 was detected). If the\nexisting QoS rule is the default QoS rule or the DQR bit of the new QoS\nrule is set to \\\"the QoS rule is the default QoS rule\\\", the UE shall\ninclude a Protocol configuration options IE or Extended protocol\nconfiguration options IE with a 5GSM cause parameter set to 5GSM cause\n#83 \\\"semantic error in the QoS operation\\\" in the MODIFY EPS BEARER\nCONTEXT ACCEPT message.  \nIn case 9, the UE shall not diagnose an error, further process the\ndelete request and, if it was processed successfully, consider the\nrespective QoS rule as successfully deleted.  \nIn case 10, the UE shall not diagnose an error, further process the\ncreate request and, if it was processed successfully, delete the old QoS\nflow description (i.e. the QoS flow description that existed when case\n10 was detected.  \nIn case 12, the UE shall not diagnose an error, further process the\ndelete request and, if it was processed successfully, consider the\nrespective QoS flow description as successfully deleted.  \nOtherwise, the UE shall include a Protocol configuration options IE or\nExtended protocol configuration options IE with a 5GSM cause parameter\nset to 5GSM cause #83 \\\"semantic error in the QoS operation\\\" in the\nMODIFY EPS BEARER CONTEXT ACCEPT message.  \nb\\) Syntactical errors in QoS operations:  \n1\\) When the rule operation is \\\"Create new QoS rule\\\", \\\"Modify\nexisting QoS rule and add packet filters\\\", \\\"Modify existing QoS rule\nand replace all packet filters\\\" or \\\"Modify existing QoS rule and\ndelete packet filters\\\", the packet filter list in the QoS rule is\nempty, and the QoS rule is provided for a PDN connection of PDN type\nIPv4, IPv6, IPv4v6 or Ethernet, or for a PDN connection of PDN type\n\\\"non-IP\\\" and there is locally available information associated with\nthe PDN connection that is set to \\\"Ethernet\\\".  \n2\\) When the rule operation is \\\"Delete existing QoS rule\\\" or \\\"Modify\nexisting QoS rule without modifying packet filters\\\" with a non-empty\npacket filter list in the QoS rule.  \n3\\) When the rule operation is \\\"Modify existing QoS rule and delete\npacket filters\\\" and the packet filter to be deleted does not exist in\nthe original QoS rule.  \n4\\) Void.  \n5\\) When there are other types of syntactical errors in the coding of\nthe QoS rules parameter, the QoS rules with the length of two octets\nparameter, the QoS flow descriptions parameter or the QoS flow\ndescriptions with the length of two octets parameter, such as a mismatch\nbetween the number of packet filters subfield, and the number of packet\nfilters in the packet filter list when the rule operation is \\\"delete\nexisting QoS rule\\\" or \\\"create new QoS rule\\\", or the number of packet\nfilters subfield is larger than the maximum possible number of packet\nfilters in the packet filter list (i.e., there is no QoS rule precedence\nsubfield included in the QoS rule IE), the QoS Rule Identifier is set to\n\\\"no QoS rule identifier assigned\\\" when the rule operation is not\n\\\"delete existing QoS rule\\\", or the QoS flow identifier is set to \\\"no\nQoS flow identifier assigned\\\" when the flow description operation is\nnot \\\"Delete existing QoS flow description\\\".  \n6\\) When, the  \nA\\) rule operation is \\\"Create new QoS rule\\\", \\\"Modify existing QoS\nrule and add packet filters\\\", \\\"Modify existing QoS rule and replace\nall packet filters\\\", \\\"Modify existing QoS rule and delete packet\nfilters\\\" or \\\"Modify existing QoS rule without modifying packet\nfilters\\\", the UE determines, by using the QoS rule's QFI as the 5QI,\nthat there is a resulting QoS rule for a GBR QoS flow (as described in\n3GPP TS 23.501 \\[8\\] table 5.7.4-1), and there is no QoS flow\ndescription with a QFI corresponding to the QFI of the resulting QoS\nrule.  \nB\\) flow description operation is \\\"Delete existing QoS flow\ndescription\\\", and the UE determines, by using the QoS rule's QFI as the\n5QI, that there is a resulting QoS rule for a GBR QoS flow (as described\nin 3GPP TS 23.501 \\[8\\] table 5.7.4-1) with a QFI corresponding to the\nQFI of the QoS flow description that is deleted (i.e. there is no\nassociated QoS flow description with the same QFI).  \n7\\) When the flow description operation is \\\"Create new QoS flow\ndescription\\\" or \\\"Modify existing QoS flow description\\\", and the UE\ndetermines that there is a QoS flow description of a GBR QoS flow (as\ndescribed in 3GPP TS 23.501 \\[8\\] table 5.7.4-1) which lacks at least\none of the mandatory parameters (i.e., GFBR uplink, GFBR downlink, MFBR\nuplink and MFBR downlink). If the QoS flow description does not include\na 5QI, the UE determines this by using the QFI as the 5QI.  \n8\\) When the rule operation is \\\"Create new QoS rule\\\", \\\"Modify\nexisting QoS rule and add packet filters\\\" or \\\"Modify existing QoS rule\nand replace all packet filters\\\" with a non-empty packet filter list in\nthe QoS rule, and the DQR bit is set to \\\"the QoS rule is the default\nQoS rule\\\", the QoS rule is provided for a PDN connection of PDN type\n\\\"non-IP\\\" and there is locally available information associated with\nthe PDN connection that is set to \\\"Unstructured\\\".  \nIn case 3 the UE shall not diagnose an error, further process the\ndeletion request and, if no error according to items c and d was\ndetected, consider the respective packet filter as successfully deleted.  \nOtherwise the UE shall include a Protocol configuration options IE or\nExtended protocol configuration options IE with a 5GSM cause parameter\nset to 5GSM cause #84 \\\"syntactical error in the QoS operation\\\" in the\nMODIFY EPS BEARER CONTEXT ACCEPT message.  \nNOTE 3: It is not considered an error if the UE determines that after\nprocessing all QoS operations on QoS rules and QoS flow descriptions\nthere is a QoS flow description that is not associated with any QoS rule\nand the UE is not in NB-N1 mode.  \nNOTE 3a: An implementation that strictly follows QoS rule operation as\ndefined in subclause 9.11.4.13 might not detect case 2).  \nc\\) Semantic errors in packet filters:  \n1\\) When a packet filter consists of conflicting packet filter\ncomponents which would render the packet filter ineffective, i.e. no IP\npacket will ever fit this packet filter. How the UE determines a\nsemantic error in a packet filter is outside the scope of the present\ndocument.  \nThe UE shall include a Protocol configuration options IE or Extended\nprotocol configuration options IE with a 5GSM cause parameter set to\n5GSM cause #44 \\\"semantic errors in packet filter(s)\\\" in the MODIFY EPS\nBEARER CONTEXT ACCEPT message.  \nd\\) Syntactical errors in packet filters:  \n1\\) When the rule operation is \\\"Modify existing QoS rule and add packet\nfilters\\\" or \\\"Modify existing QoS rule and replace all packet\nfilters\\\", and two or more packet filters in the resultant QoS rule\nwould have identical packet filter identifiers.  \n2\\) When the rule operation is \\\"Create new QoS rule\\\", and two or more\npacket filters in the resultant QoS rule would have identical packet\nfilter identifiers.  \n3\\) When there are other types of syntactical errors in the coding of\npacket filters, such as the use of a reserved value for a packet filter\ncomponent identifier.  \n4\\) Void.  \nIn case 1, if two or more packet filters with identical packet filter\nidentifiers are contained in the MODIFY EPS BEARER CONTEXT REQUEST\nmessage, the UE shall include a Protocol configuration options IE or\nExtended protocol configuration options IE with a 5GSM cause parameter\nset to 5GSM cause #45 \\\"syntactical error in packet filter(s)\\\" in the\nMODIFY EPS BEARER CONTEXT ACCEPT message. Otherwise, the UE shall not\ndiagnose an error, further process the MODIFY EPS BEARER CONTEXT REQUEST\nmessage and, if it was processed successfully, delete the old packet\nfilters which have the identical packet filter identifiers.  \nOtherwise the UE shall include a Protocol configuration options IE or\nExtended protocol configuration options IE with a 5GSM cause parameter\nset to 5GSM cause #45 \\\"syntactical error in packet filter(s)\\\" in the\nMODIFY EPS BEARER CONTEXT ACCEPT message.  \nIf the UE detects different errors in the QoS rules and QoS flow\ndescriptions as described in this subclause which requires sending a\n5GSM cause parameter in the MODIFY EPS BEARER CONTEXT ACCEPT message,\nthe UE shall include a single 5GSM cause parameter in the MODIFY EPS\nBEARER CONTEXT ACCEPT message.  \nNOTE 4: The 5GSM cause to use cannot be different from #44 \\\"semantic\nerror in packet filter(s)\\\", #45 \\\"syntactical errors in packet\nfilter(s)\\\", #83 \\\"semantic error in the QoS operation\\\" or #84\n\\\"syntactical error in the QoS operation\\\". The selection of a 5GSM\ncause is up to UE implementation.  \nUpon successful completion of an EPS attach procedure or tracking area\nupdating procedure after inter-system change from N1 mode to S1 mode\n(see 3GPP TS 24.301 \\[15\\]), unless the PDU session is an MA PDU session\nestablished over 3GPP access and over non-3GPP access both connected to\n5GCN,  \na\\) the UE shall delete any UE derived QoS rules of each PDU session\nwhich has been transferred to EPS;  \nb\\) the UE and the SMF shall perform a local release of the PDU\nsession(s) associated with 3GPP access which have not been transferred\nto EPS; and  \nc\\) the UE and the SMF shall perform a local release of QoS flow(s)\nwhich have not been transferred to EPS, of the PDU session(s) which have\nbeen transferred to EPS. The UE and the SMF shall also perform a local\nrelease of any QoS flow description not associated with any QoS rule and\nnot associated with any mapped EPS bearer context. If there is a QoS\nflow description not associated with any QoS rule, but associated with a\nmapped EPS bearer context, and after the inter-system change from N1\nmode to S1 mode the respective EPS bearer context is active, then the UE\nshall associate the QoS flow description with the EPS bearer context.  \nFor PDU session(s) associated with non-3GPP access in 5GS, if present,\nthe UE may:  \na\\) keep some or all of these PDU sessions still associated with\nnon-3GPP access in 5GS, if supported;  \nb\\) release some or all of these PDU sessions explicitly by initiating\nthe UE requested PDU session release procedure(s); or  \nc\\) attempt to transfer some or all of these PDU sessions from N1 mode\nto S1 mode by initiating the UE requested PDN connectivity procedure(s)\nwith the PDN CONNECTIVITY REQUEST message created as follows:  \n1\\) if the PDU session is an emergency PDU session, the request type\nshall be set to \\\"handover of emergency bearer services\\\". Otherwise the\nrequest type shall be set to \\\"handover\\\";  \n2\\) the PDU session type of the PDU session shall be mapped to the PDN\ntype of the default EPS bearer context as follows:  \ni\\) the PDN type shall be set to \\\"non-IP\\\" if the PDU session type is\n\\\"Unstructured\\\";  \nii\\) the PDN type shall be set to \\\"IPv4\\\" if the PDU session type is\n\\\"IPv4\\\";  \niii\\) the PDN type shall be set to \\\"IPv6\\\" if the PDU session type is\n\\\"IPv6\\\";  \niv\\) the PDN type shall be set to \\\"IPv4v6\\\" if the PDU session type is\n\\\"IPv4v6\\\";  \nv\\) the PDN type shall be set to \\\"non-IP\\\" if the PDU session type is\n\\\"Ethernet\\\" and the UE, the network or both of them do not support\nEthernet PDN type in S1 mode; and  \nvi\\) the PDN type shall be set to \\\"Ethernet\\\" if the PDU session type\nis \\\"Ethernet\\\" and the UE and the network support Ethernet PDN type in\nS1 mode;  \n3\\) the DNN of the PDU session shall be mapped to the APN of the default\nEPS bearer context, unless the PDN connection is an emergency PDN\nconnection; and  \n4\\) the PDU session ID parameter in the Protocol configuration options\nIE or the Extended protocol configuration options IE shall be set to the\nPDU session identity of the PDU session.  \nIf a PDU session associated with non-3GPP access is transferred to EPS,\nthe UE shall associate the PDU session identity with the default EPS\nbearer context and shall delete any UE derived QoS rules of such PDU\nsession.  \nInterworking to 5GS is supported for a PDN connection, if the\ncorresponding default EPS bearer context includes a PDU session\nidentity, an S-NSSAI, if the PDN connection is a non-emergency PDN\nconnection, session AMBR and one or more QoS flow descriptions received\nin the Protocol configuration options IE or Extended protocol\nconfiguration options IE (see 3GPP TS 24.301 \\[15\\]), or the default EPS\nbearer context has association with the PDU session identity, the\nS-NSSAI, if the PDU session is a non-emergency PDU session, the\nsession-AMBR and one or more QoS flow descriptions after inter-system\nchange from N1 mode to S1 mode.  \nFor a PDN connection established in S1 mode, to enable the UE to attempt\nto transfer the PDN connection from S1 mode to N1 mode in case of\ninter-system change, the UE shall allocate a PDU session identity,\nindicate the allocated PDU session identity in the PDU session ID\nparameter in the Protocol configuration options IE of the PDN\nCONNECTIVITY REQUEST message and associate the allocated PDU session\nidentity with the default EPS bearer context of the PDN connection. If\nan N5CW device supporting 3GPP access establishes a new PDN connection\nin S1 mode, the N5CW device supporting 3GPP access shall refrain from\nallocating \\\"PDU session identity value 15\\\".  \nFor a PDN connection established in S1 mode, the SMF assigning the QoS\nrules shall consider that the UE supports 16 packet filters for the\ncorresponding PDU session until the UE indicates a higher number (as\nspecified in subclause 6.4.2.2).  \nThe network may provide the UE with one or more QoS rules by including\neither one QoS rules parameter, or one QoS rules with the length of two\noctets parameter, but not both, in the Protocol configuration options IE\nor Extended protocol configuration options IE in the ACTIVATE DEFAULT\nEPS BEARER CONTEXT REQUEST or ACTIVATE DEDICATED EPS BEARER CONTEXT\nREQUEST message. The network may provide the UE with one or more QoS\nflow descriptions corresponding to the EPS bearer context being\nactivated, by including either one QoS flow descriptions parameter, or\none QoS flow descriptions with the length of two octets parameter, but\nnot both, in the Protocol configuration options IE or Extended protocol\nconfiguration options IE in the ACTIVATE DEFAULT EPS BEARER CONTEXT\nREQUEST or ACTIVATE DEDICATED EPS BEARER CONTEXT REQUEST message.  \nWhen the UE is provided with one or more QoS flow descriptions in the\nProtocol configuration options IE or Extended protocol configuration\noptions IE of the ACTIVATE DEFAULT EPS BEARER CONTEXT REQUEST or\nACTIVATE DEDICATED EPS BEARER CONTEXT REQUEST message, the UE shall\ncheck the EPS bearer identity included in the QoS flow description; and:  \na\\) if the EPS bearer identity corresponds to the EPS bearer context\nbeing activated or the EPS bearer identity is not included, the UE shall\nstore the QoS flow description and all the associated QoS rules, if any,\nfor the EPS bearer context being activated for use during inter-system\nchange from S1 mode to N1 mode; and  \nb\\) otherwise the UE shall locally delete the QoS flow description and\nall the associated QoS rules, if any, and include a Protocol\nconfiguration options IE or Extended protocol configuration options IE\nwith a 5GSM cause parameter set to 5GSM cause #84 \\\"syntactical error in\nthe QoS operation\\\" in the ACTIVATE DEFAULT EPS BEARER CONTEXT ACCEPT or\nACTIVATE DEDICATED EPS BEARER CONTEXT ACCEPT message.  \nWhen the UE is provided with one or more QoS rules, or one or more QoS\nflow descriptions in the Protocol configuration options IE or Extended\nprotocol configuration options IE of the ACTIVATE DEFAULT EPS BEARER\nCONTEXT REQUEST or ACTIVATE DEDICATED EPS BEARER CONTEXT REQUEST\nmessage, the UE shall process the QoS rules sequentially starting with\nthe first QoS rule and shall process the QoS flow descriptions\nsequentially starting with the first QoS flow description. The UE shall\ncheck QoS rules and QoS flow descriptions for different types of errors\nas follows:  \nNOTE 5: If an error is detected in a QoS rule or a QoS flow description\nwhich requires sending a Protocol configuration options IE or Extended\nprotocol configuration options IE with a 5GSM cause value, then the QoS\nrules parameter, the QoS rules with the length of two octets parameter,\nthe QoS flow descriptions parameter and the QoS flow descriptions with\nthe length of two octets parameter included in the Protocol\nconfiguration options IE or Extended protocol configuration options IE\nin the ACTIVATE DEFAULT EPS BEARER CONTEXT REQUEST or ACTIVATE DEDICATED\nEPS BEARER CONTEXT REQUEST message are discarded, if any.  \nNOTE 6: If the default EPS bearer context activation procedure or the\ndedicated EPS bearer context activation procedure is rejected, then the\nQoS rules parameter, the QoS rules with the length of two octets\nparameter, the QoS flow descriptions parameter and the QoS flow\ndescriptions with the length of two octets parameter included in the\nProtocol configuration options IE or Extended protocol configuration\noptions IE in the ACTIVATE DEFAULT EPS BEARER CONTEXT REQUEST or\nACTIVATE DEDICATED EPS BEARER CONTEXT REQUEST message are discarded, if\nany.  \na\\) Semantic errors in QoS operations:  \n1\\) When the rule operation is \\\"Create new QoS rule\\\" and the DQR bit\nis set to \\\"the QoS rule is the default QoS rule\\\" when there\\'s already\na default QoS rule.  \n2\\) When the rule operation is received in an ACTIVATE DEFAULT EPS\nBEARER CONTEXT REQUEST message, the rule operation is \\\"Create new QoS\nrule\\\", and there is no rule with the DQR bit set to \\\"the QoS rule is\nthe default QoS rule\\\".  \n3\\) When the rule operation is \\\"Create new QoS rule\\\" and two or more\nQoS rules associated with this PDU session would have identical\nprecedence values.  \n4\\) When the rule operation is an operation other than \\\"Create new QoS\nrule\\\".  \n5\\) When the flow description operation is an operation other than\n\\\"Create new QoS flow description\\\".  \n6\\) When the UE determines that:  \ni\\) the default EPS bearer context is associated with one or more QoS\nflows but the default EPS bearer context is not associated with the\ndefault QoS rules.  \nii\\) a dedicated EPS bearer context is associated with one or more QoS\nflows but the dedicated EPS bearer context is associated with the\ndefault QoS rule.  \n7\\) When the flow description operation is received in an ACTIVATE\nDEDICATED EPS BEARER CONTEXT REQUEST message, the flow description\noperation is \\\"Create new QoS flow description\\\" and there is already an\nexisting QoS flow description with the same QoS flow identifier stored\nfor an EPS bearer context different from the EPS bearer context being\nactivated and belonging to the same PDN connection as the EPS bearer\ncontext being activated.  \n8\\) When the rule operation is received in an ACTIVATE DEDICATED EPS\nBEARER CONTEXT REQUEST message, the rule operation is \\\"Create new QoS\nrule\\\" and there is already an existing QoS rule with the same QoS rule\nidentifier stored for an EPS bearer context different from the EPS\nbearer context being activated and belonging to the same PDN connection\nas the EPS bearer context being activated.  \n9\\) When the rule operation is received in an ACTIVATE DEDICATED EPS\nBEARER CONTEXT REQUEST message, the rule operation is \\\"Create new QoS\nrule\\\" and the resultant QoS rule is associated with a QoS flow\ndescription stored for an EPS bearer context different from the EPS\nbearer context being activated and belonging to the same PDN connection\nas the EPS bearer context being activated.  \n10\\) When the rule operation is \\\"Create new QoS rule\\\" and the DQR bit\nis set to \\\"the QoS rule is not the default QoS rule\\\" and one match-all\npacket filter is to be associated with the QoS rule.  \n11\\) When the flow description operation is \\\"Create new QoS flow\ndescription\\\" and there is already an existing QoS flow description with\nthe same QoS flow identifier stored for the EPS bearer context being\nactivated.  \n12\\) When the rule operation is \\\"Create new QoS rule\\\", and there is\nalready an existing QoS rule with the same QoS rule identifier and the\nexisting QoS rule is associated with a QoS flow description stored for\nthe EPS bearer context being activated or the existing QoS rule is not\nassociated with any QoS flow description.  \nIn case 4, if the rule operation is for a non-default QoS rule, the UE\nshall delete the QoS rule. If the QoS rule is the default QoS rule, the\nUE shall include a Protocol configuration options IE or Extended\nprotocol configuration options IE with a 5GSM cause parameter set to\n5GSM cause #83 \\\"semantic error in the QoS operation\\\" in the ACTIVATE\nDEFAULT EPS BEARER CONTEXT ACCEPT or ACTIVATE DEDICATED EPS BEARER\nCONTEXT ACCEPT message.  \nIn case 11, the UE shall not diagnose an error, further process the\ncreate request and, if it was processed successfully, delete the old QoS\nflow description (i.e. the QoS flow description that existed when case\n11 was detected).  \nIn case 12, if the existing QoS rule is not the default QoS rule and the\nDQR bit of the new QoS rule is set to \\\"the QoS rule is not the default\nQoS rule\\\", the UE shall not diagnose an error, further process the\ncreate request and, if it was processed successfully, delete the old QoS\nrule (i.e. the QoS rule that existed when case 12 was detected). If the\nexisting QoS rule is the default QoS rule or the DQR bit of the new QoS\nrule is set to \\\"the QoS rule is the default QoS rule\\\", the UE shall\ninclude a Protocol configuration options IE or Extended protocol\nconfiguration options IE with a 5GSM cause parameter set to 5GSM cause\n#83 \\\"semantic error in the QoS operation\\\" in the ACTIVATE DEFAULT EPS\nBEARER CONTEXT ACCEPT or ACTIVATE DEDICATED EPS BEARER CONTEXT ACCEPT\nmessage.  \nOtherwise for all the cases above, the UE shall include a Protocol\nconfiguration options IE or Extended protocol configuration options IE\nwith a 5GSM cause parameter set to 5GSM cause #83 \\\"semantic error in\nthe QoS operation\\\" in the ACTIVATE DEFAULT EPS BEARER CONTEXT ACCEPT or\nACTIVATE DEDICATED EPS BEARER CONTEXT ACCEPT message.  \nb\\) Syntactical errors in QoS operations:  \n1\\) When the rule operation is \\\"Create new QoS rule\\\", the packet\nfilter list in the QoS rule is empty, and the QoS rule is provided for a\nPDN connection of PDN type IPv4, IPv6, IPv4v6 or Ethernet, or for a PDN\nconnection of PDN type \\\"non-IP\\\" and there is locally available\ninformation associated with the PDN connection that is set to\n\\\"Ethernet\\\".  \n2\\) Void.  \n3\\) When there are other types of syntactical errors in the coding of\nthe QoS rules parameter, the QoS rules with the length of two octets\nparameter, the QoS flow descriptions parameter or the QoS flow\ndescriptions with the length of two octets parameter, such as a mismatch\nbetween the number of packet filters subfield, and the number of packet\nfilters in the packet filter list when the rule operation is \\\"delete\nexisting QoS rule\\\" or \\\"create new QoS rule\\\", or the number of packet\nfilters subfield is larger than the maximum possible number of packet\nfilters in the packet filter list (i.e., there is no QoS rule precedence\nsubfield included in the QoS rule IE), the QoS Rule Identifier is set to\n\\\"no QoS rule identifier assigned\\\", or the QoS flow identifier is set\nto \\\"no QoS flow identifier assigned.  \n4\\) When, the  \nA\\) rule operation is \\\"Create new QoS rule\\\", the UE determines, by\nusing the QoS rule's QFI as the 5QI, that there is a resulting QoS rule\nfor a GBR QoS flow (as described in 3GPP TS 23.501 \\[8\\] table 5.7.4-1),\nand there is no QoS flow description with a QFI corresponding to the QFI\nof the resulting QoS rule.  \n5\\) When the flow description operation is \\\"Create new QoS flow\ndescription\\\", and the UE determines that there is a QoS flow\ndescription of a GBR QoS flow (as described in 3GPP TS 23.501 \\[8\\]\ntable 5.7.4-1) which lacks at least one of the mandatory parameters\n(i.e., GFBR uplink, GFBR downlink, MFBR uplink and MFBR downlink). If\nthe QoS flow description does not include a 5QI, the UE determines this\nby using the QFI as the 5QI.  \nThe UE shall include a Protocol configuration options IE or Extended\nprotocol configuration options IE with a 5GSM cause parameter set to\n5GSM cause #84 \\\"syntactical error in the QoS operation\\\" in the\nACTIVATE DEFAULT EPS BEARER CONTEXT ACCEPT or ACTIVATE DEDICATED EPS\nBEARER CONTEXT ACCEPT message.  \nNOTE 7: It is not considered an error if the UE determines that after\nprocessing all QoS operations on QoS rules and QoS flow descriptions\nthere is a QoS flow description that is not associated with any QoS rule\nand the UE is not in NB-N1 mode.  \nc\\) Semantic errors in packet filters:  \n1\\) When a packet filter consists of conflicting packet filter\ncomponents which would render the packet filter ineffective, i.e. no IP\npacket will ever fit this packet filter. How the UE determines a\nsemantic error in a packet filter is outside the scope of the present\ndocument.  \nThe UE shall include a Protocol configuration options IE or Extended\nprotocol configuration options IE with a 5GSM cause parameter set to\n5GSM cause #44 \\\"semantic errors in packet filter(s)\\\" in the ACTIVATE\nDEFAULT EPS BEARER CONTEXT ACCEPT or ACTIVATE DEDICATED EPS BEARER\nCONTEXT ACCEPT message.  \nd\\) Syntactical errors in packet filters:  \n1\\) When the rule operation is \\\"Create new QoS rule\\\" and two or more\npacket filters in the resultant QoS rule would have identical packet\nfilter identifiers.  \n2\\) When there are other types of syntactical errors in the coding of\npacket filters, such as the use of a reserved value for a packet filter\ncomponent identifier.  \nThe UE shall delete the QoS rule and include a Protocol configuration\noptions IE or Extended protocol configuration options IE with a 5GSM\ncause parameter set to 5GSM cause #45 \\\"syntactical error in packet\nfilter(s)\\\" in the ACTIVATE DEFAULT EPS BEARER CONTEXT ACCEPT or\nACTIVATE DEDICATED EPS BEARER CONTEXT ACCEPT message.  \nIf the UE detects different errors in the QoS rules and QoS flow\ndescriptions as described in this subclause which requires sending a\n5GSM cause parameter in the ACTIVATE DEFAULT EPS BEARER CONTEXT ACCEPT\nor ACTIVATE DEDICATED EPS BEARER CONTEXT ACCEPT message, the UE shall\ninclude a single 5GSM cause parameter in the ACTIVATE DEFAULT EPS BEARER\nCONTEXT ACCEPT or ACTIVATE DEDICATED EPS BEARER CONTEXT ACCEPT message.  \nNOTE 8: The 5GSM cause to use cannot be different from #44 \\\"semantic\nerror in packet filter(s)\\\", #45 \\\"syntactical errors in packet\nfilter(s)\\\", #83 \\\"semantic error in the QoS operation\\\" or #84\n\\\"syntactical error in the QoS operation\\\". The selection of a 5GSM\ncause is up to UE implementation.  \nUpon inter-system change from S1 mode to N1 mode, the UE uses the\nparameters from the default EPS bearer context of each PDN connection\nfor which interworking to 5GS is supported to create a corresponding PDU\nsession associated with 3GPP access as follows, unless the PDN\nconnection is a user-plane resource of an MA PDU session:  \na\\) the PDN type of the default EPS bearer context shall be mapped to\nthe PDU session type of the PDU session as follows:  \n1\\) if the PDN type is \\\"non-IP\\\":  \n\\- the PDU session type is set to the locally available information\nassociated with the PDN connection (either \\\"Ethernet\\\" or\n\\\"Unstructured\\\"), if available; or  \n\\- otherwise, the PDU session type is set to \\\"Unstructured\\\";  \n2\\) if the PDN type is \\\"IPv4\\\" the PDU session type is set to \\\"IPv4\\\";  \n3\\) if the PDN type is \\\"IPv6\\\", the PDU session type is set to\n\\\"IPv6\\\";  \n4\\) if the PDN type is \\\"IPv4v6\\\", the PDU session type is set to\n\\\"IPv4v6\\\"; and  \n5\\) if the PDN type is \\\"Ethernet\\\", the PDU session type is\n\\\"Ethernet\\\";  \nb\\) the PDN address of the default EPS bearer context shall be mapped to\nPDU address of the PDU session, if the PDN type is \\\"IPv4\\\", \\\"IPv6\\\" or\n\\\"IPv4v6\\\";  \nc\\) the APN of the default EPS bearer context shall be mapped to the DNN\nof the PDU session, unless the PDN connection is an emergency PDN\nconnection;  \nd\\) for each default EPS bearer context in state BEARER CONTEXT ACTIVE\nthe UE shall set the state of the mapped PDU session to PDU SESSION\nACTIVE; and  \ne\\) for any other default EPS bearer context the UE shall set the state\nof the mapped PDU session to PDU SESSION INACTIVE.  \nAdditionally, the UE shall set:  \na\\) the PDU session identity of the PDU session to the PDU session\nidentity included by the UE in the Protocol configuration options IE or\nExtended protocol configuration options IE in the PDN CONNECTIVITY\nREQUEST message, or the PDU session identity associated with the default\nEPS bearer context;  \nb\\) the S-NSSAI of the PDU session to the S-NSSAI included by the\nnetwork in the Protocol configuration options IE or Extended protocol\nconfiguration options IE in the ACTIVATE DEFAULT EPS BEARER REQUEST\nmessage, or the S-NSSAI associated with the default EPS bearer context,\nif the PDN connection is a non-emergency PDN connection;  \nc\\) the session-AMBR of the PDU session to the session-AMBR included by\nthe network in the Protocol configuration options IE or Extended\nprotocol configuration options IE in the ACTIVATE DEFAULT EPS BEARER\nREQUEST message or the MODIFY EPS BEARER CONTEXT REQUEST message, or the\nsession-AMBR associated with the default EPS bearer context;  \nd\\) the SSC mode of the PDU session to \\\"SSC mode 1\\\"; and  \ne\\) the always-on PDU session indication to the always-on PDU session\nindication maintained in the UE, if any.  \nUpon inter-system change from S1 mode to N1 mode, the UE shall locally\nrelease the PDN connection(s) for which interworking to 5GS is not\nsupported.  \nUpon inter-system change from S1 mode to N1 mode, for each PDN\nconnection which is a user-plane resource of MA PDU session and for\nwhich interworking to 5GS is supported, the UE shall consider that the\nMA PDU session is established over 3GPP access and, unless the MA PDU\nsession is established over non-3GPP access too, the UE shall set the\nsession-AMBR of the PDU session to the session-AMBR included by the\nnetwork in the Protocol configuration options IE or Extended protocol\nconfiguration options IE in the ACTIVATE DEFAULT EPS BEARER REQUEST\nmessage or the MODIFY EPS BEARER CONTEXT REQUEST message, or the\nsession-AMBR associated with the default EPS bearer context of the PDN\nconnection.  \nUpon inter-system change from S1 mode to N1 mode, if:  \na\\) the UE sent the URSP provisioning in EPS support indicator and\nreceived the URSP provisioning in EPS support indicator in the PDN\nconnection corresponding to the PDU session; or  \nb\\) the default EPS bearer context of the PDN connection corresponding\nto the PDU session is associated with the URSP provisioning in EPS\nsupport indicators;  \nthen the UE shall associate the PDU session with the URSP provisioning\nin EPS support indicators.  \nAdditionally, for each EPS bearer context of the PDN connection, the UE\nshall create QoS flow(s) each of which is associated with the QoS flow\ndescription received in the Protocol configuration options IE or\nExtended protocol configuration options IE in the ACTIVATE DEFAULT EPS\nBEARER REQUEST message, ACTIVATE DEDICATED EPS BEARER REQUEST message,\nor MODIFY EPS BEARER REQUEST message (see 3GPP TS 24.301 \\[15\\]), or the\nQoS flow description associated with EPS bearer context, unless:  \na\\) the PDU session is an MA PDU session which:  \n1\\) is established over non-3GPP access; and  \n2\\) has a PDN connection as a user-plane resource; and  \nb\\) the QoS flow already exists over the non-3GPP access.  \nAdditionally, for each EPS bearer context of the PDN connection, the UE\nshall create QoS rules(s), if any, each of which is associated with the\nQoS rule received in the Protocol configuration options IE or Extended\nprotocol configuration options IE in the ACTIVATE DEFAULT EPS BEARER\nREQUEST message, ACTIVATE DEDICATED EPS BEARER REQUEST message, or\nMODIFY EPS BEARER CONTEXT REQUEST message (see 3GPP TS 24.301 \\[15\\]),\nor the QoS rules associated with EPS bearer context, unless:  \na\\) the PDU session is an MA PDU session which:  \n1\\) is established over non-3GPP access; and  \n2\\) has a PDN connection as a user-plane resource; and  \nb\\) the QoS rule already exists over the non-3GPP access.  \nNOTE 9: For a QoS rule which does not exist over non-3GPP access, the UE\ndoes not create the QoS rule if the QoS rule is the default QoS rule, or\nthe precedence value of the QoS rule equals to the precedence value of a\nQoS rule exists over the non-3GPP access.  \nAdditionally, for each PDU session which was created at inter-system\nchange from S1 mode to N1 mode from a corresponding PDN connection of\nthe \\\"Ethernet\\\" PDN type, the UE shall consider that Ethernet PDN type\nin S1 mode is supported by the network and the SMF shall consider that\nEthernet PDN type in S1 mode is supported by the UE.  \nThe UE and the network shall locally release the PDN connection(s) and\nEPS bearer context(s) associated with the 3GPP access which have not\nbeen transferred to 5GS.  \nAfter inter-system change from S1 mode to N1 mode, for each QoS flow\nmapped from an EPS bearer context the UE shall associate the EPS bearer\nidentity, the EPS QoS parameters, the extended EPS QoS parameters, and\nthe traffic flow template, if available, of the EPS bearer context with\nthe QoS flow.  \nAfter inter-system change from S1 mode to N1 mode, for each QoS flow of\nan MA PDU session which:  \na\\) is established over non-3GPP access; and  \nb\\) has a PDN connection as a user-plane resource;  \nsuch that the QoS flow was received in the Protocol configuration\noptions IE or Extended protocol configuration options IE in the ACTIVATE\nDEFAULT EPS BEARER REQUEST message, ACTIVATE DEDICATED EPS BEARER\nREQUEST message, MODIFY EPS BEARER CONTEXT REQUEST message, (see\n3GPP TS 24.301 \\[15\\]), or associated with EPS bearer context, the UE\nshall associate the EPS bearer identity, the EPS QoS parameters, the\nextended EPS QoS parameters, and the traffic flow template, if\navailable, of the EPS bearer context with the QoS flow.  \nIf the EPS bearer context(s) of the PDN connection are associated with\nthe control plane only indication, and the PDN connection supports\ninterworking to 5GS, after inter-system change from S1 mode to N1 mode,\nthe UE shall associate the PDU session corresponding to the PDN\nconnection with the control plane only indication.  \nIf the default EPS bearer context of the PDN connection is associated\nwith the PDU session pair ID, and the PDN connection supports\ninterworking to 5GS, after inter-system change from S1 mode to N1 mode,\nthe UE shall associate the PDU session corresponding to the PDN\nconnection with the PDU session pair ID. If the default EPS bearer\ncontext of the PDN connection is associated with the RSN, and the PDN\nconnection supports interworking to 5GS, after inter-system change from\nS1 mode to N1 mode, the UE shall associate the PDU session corresponding\nto the PDN connection with the RSN.  \nIf there is an EPS bearer used for IMS signalling, after inter-system\nchange from S1 mode to N1 mode, the QoS flow of the default QoS rule in\nthe corresponding PDU session is used for IMS signalling.  \nFor a PDN connection established when in S1 mode, upon an inter-system\nchange from S1 mode to N1 mode, if a UE-requested PDU session\nmodification procedure has not been successfully performed yet,the SMF\nshall determine the always-on PDU session indication as specified in\nsubclause 6.3.2.2.  \nWhen the UE is provided with one or more mapped EPS bearer contexts in\nthe Mapped EPS bearer contexts IE of the PDU SESSION MODIFICATION\nCOMMAND message, the UE shall process the mapped EPS bearer contexts\nsequentially starting with the first mapped EPS bearer context.  \nWhen the UE is provided with a new EPS bearer identity, a new EPS QoS\nparameters, a new extended EPS QoS parameters, a new APN-AMBR or a new\nextended APN-AMBR in the Mapped EPS bearer context IE of the PDU SESSION\nMODIFICATION COMMAND message for a QoS flow, the UE shall discard the\ncorresponding association(s) and associate the new value(s) with the QoS\nflow.  \nWhen the UE is provided with a new traffic flow template in the Mapped\nEPS bearer contexts IE of the PDU SESSION MODIFICATION COMMAND message\nfor a QoS flow, the UE shall check the traffic flow template for\ndifferent types of TFT IE errors as specified in subclause 6.3.2.3.  \nWhen a QoS flow is deleted, the associated EPS bearer context\ninformation that are mapped from the deleted QoS flow shall be deleted\nfrom the UE and the network if there is no other existing QoS flow\nassociated with this EPS bearer context. When the EPS bearer identity of\na QoS flow is deleted, the associated EPS bearer context information\nthat are mapped from the deleted EPS bearer identity shall be deleted\nfrom the UE and the network if there is no other existing QoS flow\nassociated with this EPS bearer context. When an EPS bearer is released,\nall the associated QoS flow descriptions and QoS rules that are mapped\nfrom the released EPS bearer shall be deleted from the UE and the\nnetwork.  \nNOTE 10: If T3584 is running or deactivated for the S-NSSAI and\noptionally the DNN combination, the UE is allowed to initate ESM\nprocedures in EPS with or without APN corresponding to that DNN, and if\nthe APN is congested in EPS, the MME can send a back-off timer for the\nAPN to the UE as specified in 3GPP TS 24.301 \\[15\\].  \nUpon inter-system change from N1 mode to S1 mode, if the UE has any PDU\nsessions associated with one or more multicast MBS sessions, the UE\nshall locally leave the associated multicast MBS sessions and the\nnetwork shall consider the UE as removed from the associated MBS\nsessions.  \nFor the case of handover of an existing PDU session from 3GPP access to\nnon-3GPP access,  \n\\- upon receipt of the PDU SESSION ESTABLISHMENT ACCEPT message, the UE\nlocally deletes the EPS bearer identities for the PDU session, if any\n(see subclause 6.4.1.3); and  \n\\- after successful handover, the network shall locally delete the EPS\nbearer identities for the PDU session, if any.  \n\\* \\* \\* \\* Next change \\* \\* \\* \\*", "In order to initiate the network-requested PDU session modification\nprocedure, the SMF shall create a PDU SESSION MODIFICATION COMMAND\nmessage.  \nIf the authorized QoS rules of the PDU session is modified or is marked\nas to be synchronised with the UE, the SMF shall set the Authorized QoS\nrules IE of the PDU SESSION MODIFICATION COMMAND message to the\nauthorized QoS rules of the PDU session. The SMF shall ensure that the\nnumber of the packet filters used in the authorized QoS rules of the PDU\nSession does not exceed the maximum number of packet filters supported\nby the UE for the PDU session. The SMF may bind service data flows for\nwhich the UE has requested traffic segregation to a dedicated QoS flow\nfor the PDU session, if possible. Otherwise the SMF may bind the service\ndata flows to an existing QoS flow. The SMF shall use only one dedicated\nQoS flow for traffic segregation. If the UE has requested traffic\nsegregation for multiple service data flows with different QoS handling,\nthe SMF shall bind all these service data flows to a single QoS flow. If\nthe SMF allows traffic segregation for service data flows in a QoS rule,\nthen the SMF shall create a new authorized QoS rule for these service\ndata flows and shall delete packet filters corresponding to these\nservice data flows from the other authorized QoS rules.  \nIf the authorized QoS flow descriptions of the PDU session is modified\nor is marked as to be synchronised with the UE, the SMF shall set the\nAuthorized QoS flow descriptions IE of the PDU SESSION MODIFICATION\nCOMMAND message to the authorized QoS flow descriptions of the PDU\nsession.  \nIf SMF creates a new authorized QoS rule for a new QoS flow, then SMF\nshall include the authorized QoS flow description for that QoS flow in\nthe Authorized QoS flow descriptions IE of the PDU SESSION MODIFICATION\nCOMMAND message, if:  \na\\) the newly created authorized QoS rules is for a new GBR QoS flow;  \nb\\) the QFI of the new QoS flow is not the same as the 5QI of the QoS\nflow identified by the QFI;  \nc\\) the new QoS flow can be mapped to an EPS bearer as specified in\nsubclause 4.11.1 of 3GPP TS 23.502 \\[9\\]; or  \nd\\) the new QoS flow is established for the PDU session used for\nrelaying, as specified in subclause 5.6.2.1 of 3GPP TS 23.304 \\[6E\\].  \nNOTE 0: In cases other than above listed cases, it is up to the SMF\nimplementation to include the authorized QoS flow description of the new\nQoS flow for the new authorized QoS rule in the Authorized QoS flow\ndescriptions IE of the PDU SESSION MODIFICATION COMMAND message.  \nIf the session-AMBR of the PDU session is modified, the SMF shall set\nthe selected Session-AMBR IE of the PDU SESSION MODIFICATION COMMAND\nmessage to the session-AMBR of the PDU session.  \nIf interworking with EPS is supported for the PDU session and if the\nmapped EPS bearer contexts of the PDU session is modified, the SMF shall\nset the Mapped EPS bearer contexts IE of the PDU SESSION MODIFICATION\nCOMMAND message to the mapped EPS bearer contexts of the PDU session. If\nthe association between a QoS flow and the mapped EPS bearer context is\nchanged, the SMF shall set the EPS bearer identity parameter in\nAuthorized QoS flow descriptions IE of the PDU SESSION MODIFICATION\nCOMMAND message to the new EPS bearer identity associated with the QoS\nflow.  \nNOTE 0A: The SMF can include multiple mapped EPS bearer context fields\nwith the same EPS bearer identity in the Mapped EPS bearer contexts IE\nof the PDU SESSION MODIFICATION COMMAND message in cases, e.g. the\npacket filters need to be modified and the modification requires more\nthan one TFT operation codes or the mapped traffic flow template needs\nto be modified and the modification exceeds the maximum size of the TFT\nIE.  \nIf the network-requested PDU session modification procedure is triggered\nby a UE-requested PDU session modification procedure and the PDU SESSION\nMODIFICATION REQUEST message includes a 5GSM capability IE, the SMF\nshall:  \na\\) if the RQoS bit is set to:  \n1\\) \\\"Reflective QoS supported\\\", consider that the UE supports\nreflective QoS for this PDU session; or  \n2\\) \\\"Reflective QoS not supported\\\", consider that the UE does not\nsupport reflective QoS for this PDU session; and;  \nb\\) if the MH6-PDU bit is set to:  \n1\\) \\\"Multi-homed IPv6 PDU session supported\\\", consider that this PDU\nsession is supported to use multiple IPv6 prefixes; or  \n2\\) \\\"Multi-homed IPv6 PDU session not supported\\\", consider that this\nPDU session is not supported to use multiple IPv6 prefixes.  \nIf the SMF considers that reflective QoS is supported for QoS flows\nbelonging to this PDU session, the SMF may include the RQ timer IE set\nto an RQ timer value in the PDU SESSION MODIFICATION COMMAND message.  \nIf a port management information container needs to be delivered (see\n3GPP TS 23.501 \\[8\\] and 3GPP TS 23.502 \\[9\\]) and the UE has set the\nTPMIC bit to \\\"Transfer of port management information containers\nsupported\\\" in the 5GSM capability IE, the SMF shall include a Port\nmanagement information container IE in the PDU SESSION MODIFICATION\nCOMMAND message.  \nFor a PDN connection established when in S1 mode, upon an inter-system\nchange from S1 mode to N1 mode, if the network-requested PDU session\nmodification procedure is triggered by a UE-requested PDU session\nmodification procedure and a UE-requested PDU session modification\nprocedure has not been successfully performed yet, the PDU session type\nis \\\"IPv4\\\", \\\"IPv6\\\", \\\"IPv4v6\\\" or \\\"Ethernet\\\" and the PDU SESSION\nMODIFICATION REQUEST message includes a Maximum number of supported\npacket filters IE, the SMF shall consider this number as the maximum\nnumber of packet filters that can be supported by the UE for this PDU\nsession. Otherwise the SMF considers that the UE supports 16 packet\nfilters for this PDU session.  \nFor a PDN connection established when in S1 mode, upon an inter-system\nchange from S1 mode to N1 mode, if the network-requested PDU session\nmodification procedure is triggered by a UE-requested PDU session\nmodification procedure and a UE-requested PDU session modification\nprocedure has not been successfully performed yet, the SMF shall\nconsider that the maximum data rate per UE for user-plane integrity\nprotection supported by the UE for uplink and the maximum data rate per\nUE for user-plane integrity protection supported by the UE for downlink\nare valid for the lifetime of the PDU session.  \nFor a PDN connection established when in S1 mode, upon an inter-system\nchange from S1 mode to N1 mode, if the network-requested PDU session\nmodification procedure is triggered by a UE-requested PDU session\nmodification procedure and a UE-requested PDU session modification\nprocedure has not been successfully performed yet, and the SMF\ndetermines, based on local policies or configurations in the SMF and the\nAlways-on PDU session requested IE in the PDU SESSION MODIFICATION\nREQUEST message (if available), that either:  \na\\) the requested PDU session needs to be an always-on PDU session, the\nSMF shall include the Always-on PDU session indication IE in the PDU\nSESSION MODIFICATION COMMAND message and shall set the value to\n\\\"Always-on PDU session required\\\"; or  \nb\\) the requested PDU session shall not be an always-on PDU session and:  \n1\\) if the UE included the Always-on PDU session requested IE, the SMF\nshall include the Always-on PDU session indication IE in the PDU SESSION\nMODIFICATION COMMAND message and shall set the value to \\\"Always-on PDU\nsession not allowed\\\"; or  \n2\\) if the UE did not include the Always-on PDU session requested IE,\nthe SMF shall not include the Always-on PDU session indication IE in the\nPDU SESSION MODIFICATION COMMAND message.  \nFor a PDN connection established when in S1 mode, upon an inter-system\nchange from S1 mode to N1 mode, if the network-requested PDU session\nmodification procedure is triggered by a UE-requested PDU session\nmodification procedure, a UE-requested PDU session modification\nprocedure has not been successfully performed yet, the UE supports EDC\nand the network allows the use of EDC, then the SMF shall include the\nExtended protocol configuration options IE in the PDU SESSION\nMODIFICATION COMMAND message with the EDC usage allowed indicator.  \nFor a PDN connection established when in S1 mode, upon an inter-system\nchange from S1 mode to N1 mode, if the network-requested PDU session\nmodification procedure is triggered by a UE-requested PDU session\nmodification procedure, a UE-requested PDU session modification\nprocedure has not been successfully performed yet, the UE supports EDC\nand the network requires the use of EDC, then the SMF shall include the\nExtended protocol configuration options IE in the PDU SESSION\nMODIFICATION COMMAND message with the EDC usage required indicator.  \nIf a QoS flow for URLLC is created in a PDU session and the SMF has not\nprovided the Always-on PDU session indication IE with the value set to\n\\\"Always-on PDU session required\\\" in the UE-requested PDU session\nestablishment procedure or a network-requested PDU session modification\nprocedure for the PDU session, the SMF shall include the Always-on PDU\nsession indication IE in the PDU SESSION MODIFICATION COMMAND message\nand shall set the value to \\\"Always-on PDU session required\\\".  \nFor a PDN connection established when in S1 mode, upon an inter-system\nchange from S1 mode to N1 mode, if the network-requested PDU session\nmodification procedure is triggered by a UE-requested PDU session\nmodification procedure and a UE-requested PDU session modification\nprocedure has not been successfully performed yet, the PDU session is a\nsingle access PDU session over 3GPP access with IP PDU session type, and\nthe SMF determines to provide the protocol description for UL PDU set\nhandling to the UE, the SMF may include the Protocol description IE in\nthe PDU SESSION MODIFICATION COMMAND message.  \nIf the value of the RQ timer is set to \\\"deactivated\\\" or has a value of\nzero, the UE considers that RQoS is not applied for this PDU session and\nremove the derived QoS rule(s) associated with the PDU session, if any.  \nIf the network-requested PDU session modification procedure is triggered\nby a UE-requested PDU session modification procedure, the SMF shall set\nthe PTI IE of the PDU SESSION MODIFICATION COMMAND message to the PTI of\nthe PDU SESSION MODIFICATION REQUEST message received as part of the\nUE-requested PDU session modification procedure.  \nIf the network-requested PDU session modification procedure is triggered\nby a UE-requested PDU session modification procedure and the UE has\nincluded the Requested MBS container IE in the PDU SESSION MODIFICATION\nREQUEST message with the MBS operation set to \\\"Join multicast MBS\nsession\\\", the SMF:  \na\\) shall include the TMGI for the multicast MBS session IDs that the UE\nis allowed to join, if any, in the Received MBS container IE, shall set\nthe MBS decision to \\\"MBS join is accepted\\\" for each of those Received\nMBS information, may include the MBS start time to indicate the time\nwhen the multicast MBS session starts, and shall include the MBS\nsecurity container in each of those Received MBS information if security\nprotection is applied for that multicast MBS session and the control\nplane security procedure is used as specified in annex W.4.1.2 in\n3GPP TS 33.501 \\[24\\], and shall use separate QoS flows dedicated for\nmulticast by including the Authorized QoS flow descriptions IE if no\nseparate QoS flows dedicated for multicast exist or if the SMF wants to\nestablish new QoS flows dedicated for multicast;  \nNOTE 1: The network determines whether security protection applies or\nnot for the multicast MBS session as specified in 3GPP TS 33.501 \\[24\\].  \nb\\) shall include the TMGI for multicast MBS session IDs that the UE is\nrejected to join, if any, in the Received MBS container IE, shall set\nthe MBS decision to \\\"MBS join is rejected\\\" for each of those Received\nMBS information, shall set the Rejection cause for each of those\nReceived MBS information with the reason of rejection and, if the\nRejection cause is set to \\\"multicast MBS session has not started or\nwill not start soon\\\", may include an MBS back-off timer value; and  \nc\\) may include in the Received MBS container IE the MBS service area\nfor each multicast MBS session and include in it the MBS TAI list, the\nNR CGI list or both, that identify the service area(s) for the local MBS\nservice;  \nNOTE 2: For an multicast MBS session that has multiple MBS service\nareas, the MBS service areas are indicated to the UE using MBS service\nannouncement as described in 3GPP TS 23.247 \\[53\\], which is out of\nscope of this specification.  \nin the PDU SESSION MODIFICATION COMMAND message. If the UE has set the\nType of multicast MBS session ID to \\\"Source specific IP multicast\naddress\\\" in the Requested MBS container IE for certain multicast MBS\nsession(s) in the PDU SESSION MODIFICATION REQUEST message, the SMF\nshall include the Source IP address information and Destination IP\naddress information in the Received MBS information together with the\nTMGI for each of those multicast MBS sessions.  \nNOTE 3: Including the Source IP address information and Destination IP\naddress information in the Received MBS information in that case is to\nallow the UE to perform the mapping between the requested multicast MBS\nsession ID and the provided TMGI.  \nNOTE 4: In SNPN, TMGI is used together with NID to identify an MBS\nSession.  \nIf:  \na\\) the SMF wants to remove joined UE from one or more multicast MBS\nsessions; or  \nb\\) the network-requested PDU session modification procedure is\ntriggered by a UE-requested PDU session modification procedure and the\nUE has included the Requested MBS container IE in the PDU SESSION\nMODIFICATION REQUEST message with the MBS operation set to \\\"Leave\nmulticast MBS session\\\",  \nthe SMF shall include the multicast MBS session IDs that the UE is\nremoved from, if any, in the Received MBS container IE in the PDU\nSESSION MODIFICATION COMMAND message and shall set the MBS decision to\n\\\"Remove UE from multicast MBS session\\\" for each of those Received MBS\ninformation. The SMF may include the updated MBS service area in each of\nthe Received MBS information, if any. The SMF may delete the QoS flows\nassociated for the multicast by including the Authorized QoS flow\ndescriptions IE in the PDU SESSION MODIFICATION COMMAND message. If the\nUE is removed from multicast MBS session due to the MBS session release,\nthe SMF shall set the Rejection cause to \\\"multicast MBS session is\nreleased\\\". The SMF shall include the Rejection cause for each of the\nReceived MBS information, if any, and set its value with the reason of\nremoving the UE from the corresponding multicast MBS session.  \nNOTE 5: based on operator\\'s policy, e.g. after a locally configured\ntime period, the SMF is allowed to trigger the removal of joined UE from\nan multicast MBS session when the UE moves outside all the MBS service\narea(s) of that multicast MBS session.  \nIf the SMF wants to update the MBS security information of an multicast\nMBS session that the UE has joined, the SMF shall include the\ncorresponding multicast MBS session ID and the MBS security container in\nthe Received MBS container IE in the PDU SESSION MODIFICATION COMMAND\nmessage, and shall set the MBS Decision to \\\"MBS security information\nupdate\\\" in the Received MBS information.  \nIf the SMF wants to update the MBS service area of an multicast MBS\nsession that the UE has joined, the SMF shall include the corresponding\nmulticast MBS session ID and the updated MBS service area in the\nReceived MBS container IE in the PDU SESSION MODIFICATION COMMAND\nmessage, and shall set the MBS decision to \\\"MBS service area update\\\"\nin the Received MBS information.  \nNOTE 6: The MBS service area of an multicast MBS session is also allowed\nto be updated to the UE using the MBS service announcement as described\nin 3GPP TS 23.247 \\[53\\], which is out of scope of this specification.  \nIf the network needs to update ATSSS parameters (see subclause 5.2.4 of\n3GPP TS 24.193 \\[13B\\]), the SMF shall include the ATSSS container IE\nwith the updates of ATSSS parameters in the PDU SESSION MODIFICATION\nCOMMAND message.  \nIf the network-requested PDU session modification procedure is not\ntriggered by a UE-requested PDU session modification procedure, the SMF\nshall set the PTI IE of the PDU SESSION MODIFICATION COMMAND message to\n\\\"No procedure transaction identity assigned\\\".  \nIf the selected SSC mode of the PDU session is \\\"SSC mode 3\\\" and the\nSMF requests the relocation of SSC mode 3 PDU session anchor with\nmultiple PDU sessions as specified in 3GPP TS 23.502 \\[9\\], the SMF\nshall include 5GSM cause #39 \\\"reactivation requested\\\", in the PDU\nSESSION MODIFICATION COMMAND message, and may include the PDU session\naddress lifetime in a PDU session address lifetime parameter in the\nExtended protocol configuration options IE of the PDU SESSION\nMODIFICATION COMMAND message. If the selected SSC mode of the PDU\nsession is \\\"SSC mode 3\\\", the S-NSSAI or the mapped S-NSSAI associated\nwith the PDU session needs to be replaced and the SMF determines that\nthe PDU session needs to be re-established on the alternative S-NSSAI,\nthe SMF shall include the Alternative S-NSSAI IE and 5GSM cause\n#39 \\\"reactivation requested\\\" in the PDU SESSION MODIFICATION COMMAND\nmessage. If the selected SSC mode of the PDU session is \\\"SSC mode 3\\\",\nthe S-NSSAI which has been replaced is available and the SMF determines\nthat the PDU session needs to be re-established on the S-NSSAI which has\nbeen replaced, the SMF shall include and 5GSM cause #39 \\\"reactivation\nrequested\\\" and include the S-NSSAI which has been replaced in the PDU\nSESSION MODIFICATION COMMAND message.  \nNOTE 7: The relocation of SSC mode 3 PDU session anchor with multiple\nPDU sessions can also be initiated by the SMF in case of the SMF is\nrequested by the AMF to release the PDU session due to the network slice\ninstance of the PDU session is changed as specified in\nsubclause 5.15.5.3 of 3GPP TS 23.501 \\[8\\].  \nThe SMF shall send the PDU SESSION MODIFICATION COMMAND message, and the\nSMF shall start timer T3591 (see example in figure 6.3.2.2.1).  \nNOTE 8: If the SMF requests the relocation of SSC mode 3 PDU session\nanchor with multiple PDU sessions as specified in 3GPP TS 23.502 \\[9\\],\nthe reallocation requested indication indicating whether the SMF is to\nbe reallocated or the SMF is to be reused is provided to the AMF.  \nIf the control plane CIoT 5GS optimization is enabled for a PDU session\nand the IP header compression configuration IE was included in the PDU\nSESSION ESTABLISHMENT REQUEST message or the PDU SESSION MODIFICATION\nREQUEST message, and the SMF supports control plane CIoT 5GS\noptimization and IP header compression for control plane CIoT 5GS\noptimization, the SMF may include the IP header compression\nconfiguration IE in the PDU SESSION MODIFICATION COMMAND message to\nre-negotiate IP header compression configuration associated to the PDU\nsession.  \nIf the control plane CIoT 5GS optimization is enabled for a PDU session\nand the Ethernet header compression configuration IE was included in the\nPDU SESSION ESTABLISHMENT REQUEST message or the PDU SESSION\nMODIFICATION REQUEST message, and the SMF supports control plane CIoT\n5GS optimization and Ethernet header compression for control plane CIoT\n5GS optimization, the SMF may include the Ethernet header compression\nconfiguration IE in the PDU SESSION MODIFICATION COMMAND message to\nre-configure Ethernet header compression configuration associated with\nthe PDU session.  \nIf the network-requested PDU session modification procedure is\nassociated with C2 authorization procedure, the SMF shall send the PDU\nSESSION MODIFICATION COMMAND message by including the Service-level-AA\ncontainer IE containing:  \na\\) the service-level-AA response with the value of C2AR field set to\nthe \\\"C2 authorization was successful\\\";  \nb\\) if a payload is provided from the UAS-NF, the service-level-AA\npayload with the value set to the payload; and  \nc\\) if a payload type associated with the payload is provided from the\nUAS-NF, the service-level-AA payload type with the value set to the\npayload type; and  \nd\\) if the CAA-level UAV ID is provided from the UAS-NF, the\nservice-level device ID set to the CAA-level UAV ID.  \nNOTE 9: The C2 authorization payload in the service-level-AA payload can\ninclude one, some or all of the pairing information for C2\ncommunication, and the pairing information for direct C2 communication,  \nNOTE 9A: The C2 authorization payload in the service-level-AA payload\ncan include the security information for C2 session as specified in TS\n33.256 \\[24B\\].  \nIf the service-level-AA procedure is triggered for the established PDU\nsession for UAS services with re-authentication purpose, and the SMF is\nprovided by the UAS-NF with the successful UUAA-SM result, the SMF shall\ntransmit a PDU SESSION MODIFICATION COMMAND message to the UE, where the\nPDU SESSION MODIFICATION COMMAND message shall include the\nService-level-AA container IE containing:  \na\\) the service-level-AA response with the value of SLAR field set to\n\\\"Service level authentication and authorization was successful\\\";  \nb\\) if received the CAA-level UAV ID from the UAS-NF, the service-level\ndevice ID with the value set to the CAA-level UAV ID;  \nc\\) if received a payload from the UAS-NF, the service-level-AA payload\nwith the value set to the payload; and  \nd\\) if received a payload type associated with the payload, the\nservice-level-AA payload type with the value set to the payload type.  \nIf the SMF needs to provide new ECS configuration information to the UE\nand the UE has indicated support for ECS configuration information\nprovisioning in the PDU SESSION ESTABLISHMENT REQUEST message or while\nin S1 mode, then the SMF may include the Extended protocol configuration\noptions IE in the PDU SESSION MODIFICATION COMMAND message with:  \n\\- at least one of ECS IPv4 Address(es), ECS IPv6 Address(es), ECS\nFQDN(s);  \n\\- at least one associated ECSP identifier;and  \n\\- optionally, spatial validity conditions associated with the ECS\naddress;  \nNOTE 10: The IP address(es), FQDN(s), or both are associated with the\nECSP identifier and replace previously provided ECS configuration\ninformation associated with the same ECSP identifier, if any.  \nIf the SMF needs to provide DNS server address(es) to the UE and the UE\nhas provided the DNS server IPv4 address request, the DNS server IPv6\naddress request or both of them, in the PDU SESSION ESTABLISHMENT\nREQUEST message or a PDU SESSION MODIFICATION REQUEST message, then the\nSMF shall include the Extended protocol configuration options IE in the\nPDU SESSION MODIFICATION COMMAND message with one or more DNS server\nIPv4 address(es), one or more DNS server IPv6 address(es) or both of\nthem.  \nIf the SMF needs to trigger EAS rediscovery and the UE has indicated\nsupport of the EAS rediscovery in the PDU SESSION ESTABLISHMENT REQUEST\nmessage or the PDU SESSION MODIFICATION REQUEST message, then the SMF\nshall include the Extended protocol configuration options IE in the PDU\nSESSION MODIFICATION COMMAND message:  \na\\) with the EAS rediscovery indication without indicated impact; or  \nb\\) with the following:  \n1\\) one or more EAS rediscovery indication(s) with impacted EAS IPv4\naddress range, if the UE supports EAS rediscovery indication(s) with\nimpacted EAS IPv4 address range;  \n2\\) one or more EAS rediscovery indication(s) with impacted EAS IPv6\naddress range, if the UE supports EAS rediscovery indication(s) with\nimpacted EAS IPv6 address range;  \n3\\) one or more EAS rediscovery indication(s) with impacted EAS FQDN, if\nthe UE supports EAS rediscovery indication(s) with impacted EAS FQDN; or  \n4\\) any combination of the above.  \nWhen UE has requested P-CSCF IPv6 address or P-CSCF IPv4 address and the\nSMF has provided P-CSCF address(es) during the PDU session establishment\nprocedure, if the network-requested PDU session modification procedure\nis triggered for P-CSCF restoration, the SMF shall include the P-CSCF IP\naddress(es) in the Extended protocol configuration options IE in the PDU\nSESSION MODIFICATION COMMAND message as specified in subclause 5.8.2.2\nof 3GPP TS 23.380 \\[54\\].  \nIf the S-NSSAI or the mapped S-NSSAI of the PDU session needs to be\nreplaced and the SMF determines that the PDU session needs to be\nretained, the SMF shall include the Alternative S-NSSAI IE in the PDU\nSESSION MODIFICATION COMMAND message. If the S-NSSAI which has been\nreplaced is available and the SMF determines that the PDU session needs\nto be retained, the SMF include S-NSSAI which has been replaced in the\nPDU SESSION MODIFICATION COMMAND message.  \nIf the SMF includes the authorized QoS flow descriptions and the SMF\ndetermines to provide the N3QAI to the UE, the SMF shall include the\nN3QAI IE in the PDU SESSION MODIFICATION COMMAND message.  \nIf the PDU session was a single access PDU session established over 3GPP\naccess with IP PDU session type and based on operator policy the SMF\ndetermines to provide the protocol description for UL PDU set handling\nto the UE, the SMF may include the Protocol description IE in the PDU\nSESSION MODIFICATION COMMAND message.  \n![](media/image1.emf)  \nFigure 6.3.2.2.1: Network-requested PDU session modification procedure  \n\\* \\* \\* \\* End of change \\* \\* \\* \\*"], "summary": ["Change Request 6229, with a revision of 2, impacts version 18.6.0 and is targeted for release 18. The CR, titled \"Update UL PDU Set handling when inter-system change,\" was sourced from Nokia and forwarded to TSG C1. The reason for the change is to address the need for the UE and SMF to remember and maintain protocol descriptions when an inter-system mode change occurs from N1 mode to S1 mode to EPS during UL PDU session establishment for XR in 5GS. The summary of the change involves updating the Stage 3 specification to ensure the maintenance of protocol descriptions associated with PDU sets in such scenarios. Failure to approve this change would result in the inability to handle UL PDU sets during inter-system mode changes. The affected clauses are 6.1.4.1 and 6.3.2.2. This CR aims to enhance the coordination between 5GSM and ESM with the N26 interface and improve the network-requested PDU session modification procedure initiation."], "embeddings": [[-0.008711831, 0.02212757, -0.022879556, 0.06412675, -0.0028099455, 0.03404734, -0.035775304, 0.04425514, 0.01441572, -0.010087804, 0.025583502, -0.024959516, 0.02470352, -0.020383604, -0.0016159685, 0.023743538, -0.031263392, 0.0009574814, 0.0120237665, -0.00773185, 0.017343663, 0.011655773, 0.028143452, 0.035423312, 0.01587169, 0.02473552, 0.00026724482, 0.007787849, -0.019407623, 0.018415643, -0.021439584, 0.027167471, 0.029151434, 0.006335877, -0.0308634, -0.013055746, 0.035167318, 0.043999143, -0.040735207, -0.009679812, -0.011727772, -0.0015559697, -0.0016359682, 0.058014873, 0.010967786, -0.03436733, -0.06396676, 0.013559736, -0.008991825, 0.03388734, -0.019663617, -0.046495095, -0.018735636, -0.013047746, 0.023199549, -0.025903497, 0.013591736, 0.090430245, -0.013151744, -0.02518351, 0.019519622, 0.0026699482, -0.021999571, -0.012559756, -0.014303722, 0.033343352, -0.035455313, -0.03407934, -0.0040419213, -0.0147197135, -0.04739108, -0.0067118695, 0.019343624, 0.008367837, 0.028591445, -0.013271742, 0.03763127, 0.07404656, 0.029647423, -0.033791345, -0.0068198675, 0.05865486, 0.0037179277, -0.026383488, 0.033791345, -0.0054958933, -0.01133578, -0.07417456, 0.010199802, 0.0040999204, 0.011359779, 0.02358354, 0.0014289722, -0.014023728, 0.0039219237, 0.022751559, -0.0021479581, -0.0053198966, -0.012503757, -0.0016009689, -0.008123842, -0.0028959438, 0.04422314, -0.003029941, 0.026671482, 0.014199724, 0.0020899593, 0.007099862, -0.009863808, 0.108157896, -0.012975748, -0.013207743, -0.0070758625, 0.010255801, -0.020079609, -0.05244698, 0.00022999552, -0.004583911, -0.009199821, 0.025263509, 0.035615306, 0.0065118736, -0.0046599093, -0.01587169, -0.060254827, 0.028143452, 0.013855731, -0.033119354, 0.0121277645, -0.020943593, -0.01236776, -0.0127517525, -0.03759927, -0.011111784, 0.017327663, 0.029743422, -0.024015533, -0.019231627, -0.0106637925, 0.00821584, -0.014831712, -0.03347135, 0.05862286, 0.0017389662, 0.0051199007, 0.024431525, 0.038335256, 0.016095687, -0.007819848, 0.050111026, -0.048447058, -0.029263431, -0.011295781, 0.0027239472, 0.042911164, 0.01337574, -0.014279722, -0.0017539659, -0.0359673, 0.014047727, 0.016543679, 0.020319605, -0.0005444894, -0.011207782, 0.020415602, -0.0041479194, -0.006787868, 0.0012639754, -0.016191686, 0.022383565, -0.013479738, 0.0072358595, -0.0044359136, -0.009543815, 0.009751811, -0.018367643, 0.016135687, -0.0060918815, 0.0050759013, -0.00015774694, -0.008303839, 0.028975436, -0.00721586, 0.0083758375, 0.018127648, -0.012399759, -0.012415758, -0.028191453, -0.008575833, -0.013079746, 0.017647658, 0.026399488, 0.041343197, -0.0025859498, -0.008559833, -0.0027999457, -0.007967846, -0.005707889, -0.03134339, 0.010463797, 0.019663617, 0.014215724, -0.032751363, -0.018863633, -0.0046719094, 0.007103862, 0.015759693, 0.006519873, 0.015623696, -0.0074278554, -0.027023476, -0.02879944, 0.045407116, 0.027135473, 0.006491874, 0.0026599483, 0.007499854, -0.010095804, 0.0056278906, -0.023935534, 0.06537473, -0.026079493, 0.016863672, -0.01695967, -0.04831906, -0.017151667, -0.015703695, -0.001647968, -0.027935456, -0.023279548, 0.019471621, 0.019327624, -0.024335528, -0.006371876, 0.009399817, 0.0046399096, 0.007971845, -0.010615794, -0.024943516, -0.023791537, -0.021775577, 0.03143939, -0.0044439137, -0.040543213, -0.0063958755, 0.03795126, 0.01745566, 0.09369418, 0.006075882, -0.008335838, 0.00773185, -0.003391934, -0.013623735, 0.020303605, 0.010311799, 0.035295315, 0.006775868, -0.005951884, -0.006439875, 0.0017759654, 0.01494371, 0.03179138, 0.0065318733, 0.007551853, -0.003235937, -0.015743693, 0.027423467, 0.019151628, 0.0030579406, -0.037471272, 0.015047708, 0.004523912, -0.032239374, -0.01386373, -0.017583659, 0.0042839167, 0.030111415, 0.019631619, 0.0016839673, -0.012055766, -0.031471387, 0.028623443, 0.00042549174, -0.012015766, -0.0070278635, 0.013431739, -0.020719597, -0.020079609, 0.0077478494, -0.0034839322, -0.008791829, -0.009479816, 0.02777546, -0.00082698395, -0.0047639073, 0.011423778, 0.020767596, 0.01335974, 0.00063148775, -0.008343838, -0.00056898897, -0.013735733, -0.021295587, -0.001132978, -0.0024759518, 0.0053158966, 0.014799712, 0.0025019513, -0.04527912, 0.006535873, 0.06287878, -0.047647074, -0.030399408, -0.035199314, -0.014015728, -0.011967767, 0.027855458, 0.006547873, 0.0027199471, -0.01184777, -0.0011379779, -0.0128557505, -0.0075478535, 0.007991845, 0.02678348, 0.0001333724, -0.006839867, 0.0412152, -0.022431564, -0.00033599348, -0.0042599174, 0.04591911, 0.045087125, -0.025295509, -0.035743304, 0.028223451, 0.00030949397, 0.0012169763, -0.02255956, 0.008135842, 0.008927827, 0.013175744, -0.014767713, 0.0056838896, -0.037183277, 0.031199394, 0.010495796, -0.011087785, 0.007303858, 0.026047494, 0.0009129823, -0.020767596, 0.051710993, -0.009911807, 0.063038774, 0.0077918484, -0.029263431, -0.012495757, -0.016111687, -0.046975087, 0.028079454, -0.006939865, 0.030143414, -0.015759693, 0.0014149725, -0.01899163, -0.016623678, 0.014023728, 0.024031533, -0.03382334, -0.023199549, 0.039231237, 0.04742308, -0.009351818, -0.015103706, 0.01700767, 0.009575814, 0.012263762, -0.018895634, 0.02367954, 0.015639696, 0.0054158946, -0.018591639, -0.0030639404, 0.03289536, 0.038367253, -0.0050199023, 0.018911632, -0.018639637, 0.01235176, -0.012055766, -0.012431758, -0.023327546, -0.013535737, 0.0042839167, -0.040383216, 0.00078948465, -0.019247625, 0.0018239645, -0.0257595, -0.005247898, 0.022271568, -0.03340735, 0.045599114, 0.011943768, -0.003955923, -0.03967923, -0.04012722, -0.018767634, -0.02518351, 0.027007475, -0.029983418, 0.0121277645, -0.02315155, 0.026303489, 0.03801526, -0.017583659, 0.04227118, -0.018815635, -0.017583659, 0.0064518745, -0.016111687, 0.0056758896, 0.024399526, 0.051551, 0.03143939, -0.021359585, 0.018575639, 0.0027459466, -0.014095726, 0.003185938, 0.0063518765, -0.005051902, -0.01495171, 0.0074118557, 0.014263723, -0.033183355, -0.027103473, -0.025119511, -0.009343819, 0.0019499621, 0.011031786, -0.01806365, 0.008043843, -0.01647968, 0.0050679017, -0.021263586, -0.02979142, -0.029935418, 0.027663462, -0.023999533, 0.010911788, 0.0154717, 0.004063921, 0.025791498, -0.02777546, -0.014135725, -0.042399175, 0.011303781, 0.015759693, -0.03177538, 0.027855458, 0.040543213, -0.020463603, 0.035391312, -0.0074438555, -0.0308314, -0.021455582, 0.0124397585, 0.016415682, -0.00027849458, -0.050175026, -0.018479642, -0.011015786, -0.0011099784, 0.013799732, -0.0029279431, -0.010607794, -0.014679715, 0.0024759518, 0.00976781, 0.026623482, -0.020847594, 0.01439972, -0.013703734, -0.00019387124, -0.00047274082, 0.01798365, -0.037919264, 0.0006944865, 0.016495679, -0.009687812, -0.0068198675, -0.008639832, -0.006235879, -0.023743538, 0.013631735, 0.010055805, 0.004843906, -0.0120237665, -0.036799286, 0.022959555, 0.026031494, 0.0003859925, -0.0069238655, -0.027967457, 0.028255451, 0.0031779383, -0.011015786, 0.024895515, 0.006119881, 0.047295082, -0.02779146, 0.042911164, 0.0019349623, -0.00360993, 0.011271781, 0.0019739617, 0.020383604, 0.0031679384, 0.020175608, -0.010479797, -0.013183744, -0.0015749694, -0.007659851, -0.002005961, 0.023807537, 0.00062298786, 0.03199938, -0.018703636, -0.006079882, 0.021215588, 0.032831363, -0.020447602, -0.009735811, 0.00021199588, -0.0007439855, -0.0066598705, -0.047615074, -0.009127823, -0.0154556995, 0.02876744, -0.03859125, -0.008119842, -0.0057878876, 0.04003122, -0.050527018, 0.009967806, 0.023023553, 0.022991553, 0.001338974, 0.009159822, -0.0123357605, -0.0012719752, -0.026575483, 0.0020519602, 0.0041439193, 0.035423312, 0.020479603, 0.016127687, 0.019247625, -0.005099901, 0.023311546, -0.0020799595, -0.023311546, -0.00063798757, -0.020175608, 0.006543873, -0.0069718645, 0.016815674, 0.020655598, -0.0072038597, 0.01179177, -0.009863808, 0.01691167, 0.009063824, -0.006547873, 0.009511815, -0.019279625, 0.0050599016, -0.01647968, -0.037503272, 0.0022919555, 0.0256795, 0.007451855, 0.0154157, -0.0049679033, -0.029087435, 0.03740727, -0.0012479757, 0.012743752, -0.016199686, -0.008083843, -0.019135628, 0.02159958, 0.0152477035, 0.0023919535, -0.0046039107, 0.028623443, -0.0720626, 0.025951495, 0.06841467, -0.008575833, -0.00718786, -0.034559328, 0.021279586, -0.0075958525, 0.037695266, 0.00080798427, 0.009183821, 0.0151437055, -0.0206076, 0.01908763, -0.017183665, -0.0038639249, -0.029119434, 0.037663266, -0.020911593, 0.007291858, -0.016831674, 0.059934836, -0.019487621, 0.036255296, 0.0079638455, -0.0021779577, 0.009855809, -0.004839906, -0.012191763, 0.007499854, -0.0033179354, -0.011559775, -0.013959729, -0.0023539541, 0.0016899671, 0.0013029746, 0.013095746, -0.016879672, -0.056926895, 0.0049599037, 0.04006322, -0.028367449, 0.025487505, -0.012695753, 0.077310495, -0.019839615, -0.008999825, 0.038719248, 0.03795126, 0.006939865, 0.035199314, -0.02673548, 0.0045679114, -0.0049079047, 0.025135512, -0.014255723, -0.027871458, 0.02777546, 0.003753927, 0.00875983, -0.025247509, -0.030655405, -0.015863692, 0.02623949, -0.0030659405, -0.008895827, -0.0046639093, 0.01591169, -0.027935456, -0.023471544, 0.0013089746, -0.020159608, -0.025935495, 0.029231431, 0.007267859, -0.0359993, -0.0012009767, -0.029391428, -0.015175705, -0.0043919147, -0.031215394, -0.013423739, 0.003657929, 0.018703636, 0.016511679, -0.013703734, 0.0052798972, -0.02367954, -0.031839382, -0.006119881, -0.025471505, 0.01237576, 0.028591445, -0.00154297, 0.019247625, 0.025519503, 0.0038999242, 0.016167685, 0.008663831, -0.001855964, -0.008335838, -0.00875183, -0.00873583, -0.008103843, -0.0114957765, -0.010631793, 0.03388734, -0.0026299488, -0.022783557, -0.02516751, -0.016767673, -0.023951534, -0.018191647, -0.019871613, 0.038687248, 0.00875183, 0.0308634, 0.0066158716, -0.004943904, -0.03350335, -0.00010531045, -0.009983806, 0.007955845, -0.03137539, -0.027567465, -0.016215684, 0.0044919127, 0.022319566, 0.0031979377, 0.013951729, 0.010015805, -0.015839692, 0.015615696, -0.004735908, 0.0021199589, 0.023967534, 0.037215278, 0.0056758896, 0.009127823, 0.033663347, -8.7623295e-05, 0.011375779, -0.013999728, 0.014863711, 0.012087765, -0.02884744, 0.0094158165, 0.040735207, 0.010215801, -0.052222986, 0.006543873, -0.009863808, -0.0205596, 0.05548692, -0.03558331, -0.0205916, -0.006267878, 0.0055478923, 0.03743927, 0.019663617, 0.018159647, -0.0072358595, 0.043711152, -0.009895808, -0.0019309624, 0.038239256, 0.04988703, 0.0074878545, -0.0074918545, 0.01336774, 0.0019599618, 0.016047688, 0.00615588, 0.01439972, -0.028399449, 0.02876744, -0.025839498, -0.0015219704, -0.0016219685, 0.015127706, -0.025087513, -0.027231472, 0.0108717885, -0.014023728, 0.031231392, -0.049183045, -0.013463738, 0.017087668, 0.0024899517, -0.010431797, 0.015303702, -0.0006579872, -0.017679656, 0.014687714, -0.006463874, 0.018319644, -0.019887613, -0.0062918775, 0.027343469, -0.0047639073, -0.017359663, -0.0053918953, 0.0072558587, -0.024047533, -0.010367799, 0.01958362, 0.019647619, 0.0028599445, -0.0464631, -0.039199237, 0.030399408, 0.021791577, -0.03230337, -0.010407798, -0.017887652, -0.02267156, -0.018815635, 0.01595169, -0.025151512, -0.022847556, -0.0054718936, 0.0027919458, -0.032095376, 0.02311955, -0.015015708, -0.01647968, -0.021695578, 0.0005709889, 0.0039779227, 0.016135687, 0.019199627, -0.0104557965, -0.0043879147, 0.021535581, -0.024975514, -0.00308194, 0.010207801, -0.0032219375, 0.0011079785, -0.014191724, -0.009199821, 0.0024979515, -0.02265556, 0.014095726, -0.012759752, 0.00071298616, -0.022143569, -0.017615657, -0.03238337, -0.014695714, -0.0069238655, 0.01747166, 0.00308994, -0.0018589639, 0.031183394, -0.017359663, -0.0019269625, 0.017887652, 0.022431564, 0.010119803, -0.026399488, 0.012519756, 0.040927205, -0.024591522, 0.0048639053, 0.036895283, -0.010887789, 0.00021399584, -0.045151122, 0.0064118756, -0.029103434, 0.0031979377, 0.017391661, -0.021295587, -0.004057921, 0.038719248, -0.009583814, 0.020783596, -0.027503466, 0.014079726, 0.009199821, 0.02115159, 0.012935748, -0.0063758763, 0.0013969728, 0.036319293, -0.018287644, 0.011695772, 0.0028359448, -0.022927554, -0.02471952, 0.015087707, 0.03292736, -0.0256795, -0.01490371, -0.00718786, 0.021983573, -0.027487466, 0.014855711, -0.033119354, -0.00065698725, -0.0205756, -0.034239333, -0.006435875, -0.005691889, 0.01184777, -0.048415057, 0.04271917, -0.00718786, -0.007659851, -0.027983457, 0.011551775, -0.04153519, -0.0360313, -0.0016319683, 0.015335702, 0.014655715, -0.026095493, 0.015791694, -0.0047719073, 0.041311197, 0.0030639404, 0.00052648975, 0.014111726, -0.016399682, -0.021887574, 0.003397934, -0.012527756, 0.008319838, 0.022207567, 0.01283975, -0.016687676, -0.015823692, -0.03134339, -0.009375818, 0.0015779693, -0.021823576, -0.013175744, 0.0037659267, -0.0047999066, -0.007979845, -0.039391235, 0.009815809, -0.0031079396, -0.034847323, 0.03177538, 0.025071513, 0.031071397, -0.0014609717, -0.0048799054, 0.03555131, -0.025919497, -0.043935146, -0.016415682, -0.044063143, 0.021743577, 0.01286375, -0.015615696, -0.027679462, 0.006239879, 0.05094301, -0.01598369, 0.0021859575, 0.0020519602, 0.008003845, -0.008183841, 0.011927769, -0.0154317, -0.013759732, -0.025951495, 0.037503272, 0.0029039436, -0.0031119394, 0.0007024864, 0.0007519854, 0.021551581, -0.00096448127, -0.003129939, -0.015863692, 0.020767596, 0.035167318, 0.016511679, -0.023343546, 0.014983709, 0.010895789, 0.040479213, 0.025855497, 0.0042559174, 0.00566789, 0.0048279064, 0.02161558, 0.016279684, -0.007163861, 0.026607484, -0.026415486, 0.029503427, -0.0023219548, 0.047519077, 0.004363915, -0.033055358, -0.008967826, -0.016719675, -0.0117037725, 0.036383294, -0.0019419623, -0.023423545, -0.03347135, -0.021343585, 0.009359818, -0.04207918, -0.007047863, -0.05487893, -0.0036359294, 0.045087125, -0.015583697, -0.020383604, -0.028431447, 0.0043319156, -0.0052718977, 0.021663578, -0.008115842, -0.04892705, 0.013487738, 0.0070278635, -0.048799053, 0.004063921, 0.028207451, -0.0025339508, 0.0031139394, -0.02679948, 0.008591833, 0.01905563, 0.00042299178, -0.006883866, -0.01854364, -0.00977581, 0.015327702, 0.0075438535, -0.02884744, -0.0050559016, 0.026895477, 0.003039941, 0.005307897, -0.015447699, -0.002931943, -0.02521551, 0.017199665, -0.022703558, 0.02415953, -0.015575698, -0.038239256, 0.012135764, 0.012271762, 0.021487582, -0.026575483, -0.010895789, -0.003907924, -0.013855731, -0.022143569, 0.020927593, -0.017055668, -0.0125437565, -0.016087687, -0.006935865, -0.008887827, -0.014639716, -0.035647307, 0.0032039378, -0.011975767, 0.017439662, -0.0017359663, 0.009735811, 0.00978381, 0.007319858, 0.0026979477, 0.007459855, -0.006103881, -0.0019619619, -0.012087765, -0.046079103, -0.02782346, -0.0033579348, -0.017903652, -0.0048799054, 0.004017922, -0.036191296, -0.006543873, 0.005195899, -0.0028879438, -0.0042439173, -0.012951748, -0.015663696, 0.009591813, 0.03196738, -0.020143608, 0.026559483, -0.011159783, -0.018207647, 0.097406104, -0.0010689793, -0.019887613, -0.021919575, 0.021119589, -0.01283175, 0.033567347, 0.004683909, 0.014055727, 0.020959593, 0.012207762, 0.01439972, 0.0023999533, -0.02004761, 0.0004419914, -0.007655851, 0.018927632, -0.00773585, 0.011759771, -0.0012539757, -0.009687812, 0.014287722, -0.0055238926, -0.010551795, 0.0046599093, 0.028399449, 0.00308594, -0.019823615, -0.010135803, -0.0034059337, 0.012247762, -0.014663715, 0.038303256, 0.002465952, -0.024111532, 0.044607133, 0.013055746, 0.028607445, 0.0045919106, -0.02116759, -0.006999864, 0.03971123, 0.006319877, 0.006571872, -0.008799829, 0.020175608, -2.6593234e-05, 0.01287975, 0.010343799, -0.0057358886, -0.009303819, -0.018159647, 0.013295742, -0.009423817, 0.016159685, 0.0015579697, -0.018207647, 0.009799809, 0.0048759053, -0.0023799536, 0.017567659, 0.008059843, 0.030415408, 0.044127144, -0.014039727, -0.010983787, 0.0016239685, -0.0051838993, -0.0026399486, 0.018191647, -0.010879789, -0.007151861, -0.016639676, -0.0050119027, -0.019951612, -0.004057921, 0.02323155, 0.009719811, -0.025519503, -0.014479718, -0.012527756, -0.014647716, 0.021279586, -0.0048079067, -0.008423836, 0.018303644, -0.007947845, 0.019967612, 0.018175647, 0.0106637925, -0.040159218, 0.01334374, 0.0045559113, 0.0102478005, -0.012471758, -0.014471719, 0.030303411, 0.015791694, -0.014063726, 0.0037399272, 0.0020819595, 0.024319528, 0.005195899, -0.011687773, 0.0055918912, 0.0051798993, -0.003495932, 0.0021419583, 0.0029599424, -0.001596969, 0.0022039572, 0.001855964, 0.002161958, -0.0022979553, -0.016119687, -0.016367681, 0.0047639073, 0.015935691, 0.02003161, -0.03494332, -0.037727267, -0.0005189899, 0.023919536, -0.0014009727, -0.00016599677, -0.020671599, -0.009223821, -0.00976781, 0.029679423, 0.027951457, -0.018287644, 0.00014299722, -0.022047572, 0.009143822, 0.027407467, -0.02366354, 0.02518351, -0.014847712, 0.0008534834, -0.0069678645, 0.02358354, -0.0030059416, 0.010271801, 0.0097278105, -0.023807537, 0.008007844, -0.044063143, -0.0019269625, 0.017071668, 0.004887905, 0.019119628, 0.011271781, 0.02623949, -0.009039824, 0.045951106, 0.013783732, 0.012895749, -0.034655325, -0.0038939244, -0.02779146, 0.01336774, -0.015175705, 0.011751772, 0.008399837, -0.0055958913, 0.013095746, 0.0049639037, -0.063198775, -0.04323116, -0.033247355, 0.020735597, 0.024511524, -0.010391798, 0.022703558, 0.00045349117, -0.0013479738, 0.009951807, 0.008631832, 0.0154077, -0.02419153, -0.0037919262, -0.012039766, -0.004415914, 0.010463797, 0.035071317, 0.002265956, 0.03143939, -0.024479523, -0.015367702, 0.005711889, -0.0033679346, 0.012767752, 0.0061478806, 0.0051558996, 0.018143646, -0.00670387, -0.013703734, -0.0023839537, 0.011503777, 0.02670348, -0.0031719382, 0.017359663, 0.0048239063, 0.015831692, -0.009647813, -0.019519622, -0.02113559, -0.005307897, -0.017215665, -0.0046159104, 0.005099901, 0.0031679384, 0.006491874, 0.006051882, 0.0045999107, -0.030463409, 0.006879866, -0.017695656, -0.011895768, -0.01643168, 0.00154397, 0.006123881, -0.01803165, 0.010239801, 0.0058078873, -0.0016569678, -0.0029619425, -0.012175763, -0.00014449719, 0.014863711, 0.0033819342, 0.006007883, 0.013231743, -0.00079998444, 0.0054878932, 0.009031825, -0.007907846, 0.011935768, 0.003503932, 0.0059398846, -0.018655637, 0.0010849789, -0.0032039378, 0.0027059475, -0.034687325, -0.00037724266, 0.014111726, 0.0076958505, -0.011415778, 0.00056848896, 0.034719326, -0.023455543, 0.01132778, -0.008511835, -0.010167803, 0.011375779, 0.010183802, 0.02884744, 0.03407934, -0.0034099338, -0.029055435, 0.010311799, -0.019119628, -0.014135725, -0.013087746, -0.016055688, -0.012167764, 0.009887808, 0.0027059475, -0.037759267, -0.018479642, 0.0037599269, 0.0041359197, -0.00616388, -0.013615736, 0.010119803, -0.0050079026, -0.020895595, -0.0026079493, 0.010023805, 0.0015799693, 0.05043102, -0.0122317625, 0.0010179802, 0.016135687, -0.01234376, -0.008975825, -0.007631852, -0.012175763, 0.03964723, -0.00977581, 0.011487776, -0.004891905, -0.010919788, -0.032991357, 0.0018109648, 0.002931943, 0.015207704, 0.00926382, 6.50378e-06, 0.0019769615, -0.011759771, 0.013959729, 0.014103726, 0.007043863, -0.007467855, -0.009215821, -0.02164758, -0.017727656, -0.01803165, -0.024511524, 0.01643168, -0.014255723, 0.02876744, 0.009719811, 0.0025499505, 0.019471621, -0.01081579, -0.0013119745, 0.0005774888, -0.0102878, 0.011527776, -0.051519, -0.0019819615, -0.0033779345, -0.0049239043, -0.021311585, 0.013431739, 0.007375857, -0.0052278982, 0.020655598, -0.006319877, -0.011887769, -0.0014059726, 0.021311585, 0.008887827, -0.013111745, 0.0057838876, 0.010863788, 0.017327663, -0.018911632, -0.0031719382, -0.027983457, -0.0029599424, -0.030591406, 0.0005549892, 0.0010009805, 0.0122317625, 0.008075843, 0.003499932, -0.018335644, -0.00309194, 0.020671599, -0.019327624, -0.001493971, 0.027023476, 0.014887711, 0.011679773, -0.003235937, -0.016399682, 0.006619871, 0.0068718665, -0.027567465, 0.015639696, -0.014663715, 0.015159706, 0.0012309761, 0.013447738, -0.011159783, -0.006439875, -0.004831906, 0.0008089843, -0.025007514, -0.016039688, -0.007575853, 0.009735811, 0.0114957765, 0.0052198987, -0.018639637, -0.028639443, -0.00925582, -0.023615541, -0.020863594, -0.035167318, 0.0023279549, -0.0035639307, -0.010639793, 0.010471797, 0.0033119356, -0.026863478, 0.0129597485, 0.0022179568, 0.0040279217, 0.038079258, -0.0025839498, 0.023743538, -0.006267878, -0.0039999224, -0.019919613, -0.0020119608, -0.016063688, -0.012671754, 0.014751714, 0.006651871, -0.00016112186, 0.015375701, -0.0112877805, -0.030431408, 0.030319411, -0.02519951, -0.009159822, 0.0005434894, 0.009799809, -0.02313555, -0.00050049025, -0.007847847, -0.02006361, 0.025791498, 0.024319528, 0.014967709, 0.017311664, -0.010999786, -0.011879769, -0.042783167, -0.0030699403, 0.0118157705, 0.03647929, -0.0052078986, 0.00031499387, -0.012791751, -0.01699167, -0.00023774538, 0.016495679, 0.0124397585, 0.007447855, -0.01079979, -0.027951457, -0.019199627, 0.00059748837, 0.02108759, -0.014359721, -0.014695714, 0.0006504874, 0.007115862, 0.0005439894, -0.010423797, -0.007831848, 0.019487621, 0.0021279587, 0.0032499367, 0.023455543, -0.012767752, -0.0024959515, -0.010127803, 0.007887847, 0.008663831, 0.018159647, -0.024799518, -0.014815712, -0.007247859, -0.0032659366, -0.0008689831, 0.015583697, 0.018367643, 0.010967786, 0.00773585, 0.003287936, 0.012511757, -0.029599424, -0.0103517985, -0.0026479485, -0.014479718, -0.008527834, -0.006747869, 0.021823576, -0.033023357, -0.000976981, 0.0025119511, 0.013279742, -0.0010459797, -0.0016609677, -0.0016549678, -0.00074948545, 0.0016209685, 0.010687793, 0.07174261, -0.012799751, 0.014007728, -0.0052638976, 0.018367643, 0.0009949807, -0.005759888, 0.011375779, 0.008023844, -0.0097278105, 0.02108759, -0.012407759, 0.004219918, 0.016327683, 0.006795868, -0.031519387, -0.0056278906, 0.0025539503, -0.015567698, 0.00025387006, -0.021023592, -0.001078979, 0.017535659, 0.0075718528, -0.0067598685, 0.006955865, 0.0069638644, 0.001181977, 0.004275917, 0.0026479485, 0.018127648, 0.019647619, 0.004371915, 0.018895634, -0.012055766, -0.00095598144, 0.004015922, -0.007895847, 0.003555931, -0.016719675, 0.012383759, 0.01391973, -0.012623754, -0.014583716, 0.0053838952, -0.026127493, -0.006803868, -0.008615833, 0.00019412122, -0.010503796, -0.0019389623, 0.007895847, -0.0014589716, 0.0016849672, 0.006071882, 0.007527854, 0.011927769, 0.001803965, -0.00721586, 0.009343819, -0.0023979533, -0.022799557, -0.020863594, -0.02001561, -0.008099843, -0.0038839246, 0.0012429758, 0.0046599093, 0.0151357055, -0.010031805, 0.029151434, -0.02462352, 0.020671599, -0.014031727, -0.015263704, -0.0029199433, 0.021791577, -0.0022319567, 0.01697567, -0.0045439117, 0.0055718916, -0.00030749402, -0.00021374585, 0.014223724, -0.012167764, 0.021183588, 0.019871613, 0.016687676, 0.0102798, 0.024991514, -0.006239879, 0.010183802, 0.009983806, -0.02879944, -0.01804765, -0.0059078853, -0.010215801, -0.018207647, -0.006651871, -0.0034559327, -0.0011439777, 0.0039699227, 0.021231588, 0.008079843, 0.026655482, 0.0019259625, 0.023551542, 0.00014074726, 0.017215665, -0.001648968, -0.009119823, 0.008487835, -0.0030139415, 0.01806365, 0.013751733, 0.0064598746, 0.008279839, 0.0010679793, 0.00565589, -0.013559736, -0.0041239196, 0.020399604, 0.017775655, -0.0052758977, -0.018191647, -0.0025999495, 0.0077478494, -0.007511854, 0.00668787, -0.017423661, 0.012487757, 0.003555931, -0.007099862, -0.02108759, -0.022799557, -0.014295722, -0.026031494, 0.013271742, 0.023055552, 0.023791537, 0.00875183, -0.004783907, 0.0013349741, -0.006643871, 0.01748766, 0.002777946, -0.033631347, 0.0023819536, -0.0017129667, -0.023391545, 0.00359393, -0.015095707, 0.014311722, 0.003761927, 0.0071758605, -0.0124397585, -0.0044559133, 0.016119687, -0.0028099455, -0.0036179298, -0.013335741, -0.010831789, 0.024271527, -0.0043559154, 0.02004761, 0.0026579483, 0.009719811, 0.0012649754, 0.012487757, -4.7186582e-05, -0.0013549736, -0.019151628, -0.024463525, -0.008647832, -0.0033279352, 0.0015499699, 0.01587969, 0.010655792, -0.010487796, -0.017375663, -0.010487796, 0.0034179336, -0.011215782, 0.010255801, -0.0031239393, 0.00084048364, 0.032095376, -0.009295819, 0.0205916, -0.0024399527, -0.0151437055, 0.01179177, -0.008151841, -0.0025679502, -0.0040939203, 0.004013922, -0.0015039708, 0.0028079455, -0.00823184, 0.011111784, 0.006231879, 0.010087804, -0.016223684, 0.0005994883, 0.0068158675, 0.014727714, -0.0061478806, -0.0018229645, 0.026063493, -0.026175492, -0.044575132, -0.0008279839, 0.011663773, 0.0049239043, -0.0041799187, 0.007159861, 0.007355857, -0.0069198655, 0.003865925, 0.0024139532, -0.007819848, 0.0052918973, 0.017615657, -0.004571911, -0.0012919749, 0.01849564, -0.013311741, -0.0025599503, -0.01439972, -0.0033579348, -0.014759713, -0.009591813, 0.022527562, -0.020175608, 0.031087397, -0.0153437015, -0.005327896, -0.0026439487, 0.029215433, -0.019791616, -0.013567736, -0.008319838, 0.016511679, 0.00027399466, 0.01179977, -0.0011559775, -0.020831594, -0.012007766, -0.00927182, -2.6561984e-05, -0.002213957, 0.0008699831, -0.00976781, -0.009543815, 0.011071784, 0.009327819, 0.006907866, 0.0063478765, -0.0031199395, 0.012143764, 0.00064548745, -0.016215684, 0.018783635, -0.0008359837, 0.014175724, -0.02004761, -0.0028979436, -0.0018229645, 0.011103784, 0.027887458, -0.010215801, -0.00667187, 0.0029559426, 0.016895672, 0.011111784, -0.008583833, -0.0039259237, 0.007839847, -0.012743752, -0.013511738, 0.006311877, -0.008263839, 0.015047708, 0.032159373, 0.0050759013, -0.012767752, 0.024559522, 0.018111648, 0.024495523, -0.012215762, -0.013543737, 0.005971884, -0.010159803, 0.0038219257, 0.009639813, 0.0015029708, 0.0065518725, 0.0059958836, -0.025471505, 0.010855789, 0.010703792, -0.0066558705, 0.009335819, -0.01801565, -0.01598369, -0.017887652, 0.0041559194, -0.0042879167, 0.0040339218, -0.015527698, -0.0073918565, 0.005243898, 0.02159958, -0.012775752, -0.0028939438, -0.007371857, -0.0020799595, 0.0026999475, -0.0017219665, 0.011503777, -0.029727422, 0.00054948934, -0.011359779, 0.021919575, -0.0032139376, -0.012119764, 0.005299897, -0.0031599386, -0.0073278574, -0.03343935, 0.0022759559, -0.0024879517, -0.025519503, 0.01700767, 0.010527795, -0.022463564, -0.011023786, 0.01910363, 0.022703558, 0.009639813, 0.021839576, 0.0054718936, -0.013111745, -0.006071882, -0.00566789, 0.01748766, -0.017231666, 0.0065638726, -0.010087804, -0.00085248344, -0.0154556995, -0.0006954865, 0.00046449096, -0.014727714, 0.008075843, -0.001797965, -0.025119511, -0.0005244898, 0.005691889, -0.009951807, -0.017071668, -0.01799965, -0.00617588, 0.0005704889, -0.0011689772, -0.031471387, 0.008999825, 0.012663754, 0.029119434, 0.0033139356, 0.016527679, 0.0027079473, -0.013599736, -0.019679617, -0.01803165, 0.017087668, 0.010911788, -0.0017029669, -0.009127823, -0.021535581, 0.009007825, -0.00051124004, 0.0048159063, -0.008351837, -0.0041799187, -0.017775655, 0.0063598766, 0.018239645, 0.0041519194, -0.007351857, -0.011455777, 0.018895634, 0.0034599327, -0.02516751, -0.0029019436, -0.0018099648, 0.014479718, -0.011631774, 0.025967496, -0.006799868, -0.0008024844, 0.017199665, 0.029935418, 0.027423467, 0.013807732, -0.01439172, 0.009103823, 0.007451855, -0.0008279839, 0.032719363, 0.008003845, 0.019807614, 0.003647929, 0.0029039436, 0.005199899, -0.011671773, 0.0064118756, -0.007615852, 0.0016909671, 0.0027899458, -0.000822484, -0.009591813, 0.011167783, -0.020351604, 0.006779868, -0.0043079164, -0.0036959283, -0.01899163, 0.005847886, 0.03459133, 0.020351604, -0.013263742, 0.02012761, -0.023743538, -0.0018099648, 0.01598369, -0.017391661, -0.0026419486, -0.0065038735, -0.010503796, -0.016047688, 0.0021299587, -0.0058598863, -0.02217557, 0.00026524483, -0.010119803, -0.0036259296, 0.013303742, 0.008679831, 0.009847809, -0.031023396, 0.0110797845, 0.021455582, -0.04022322, 0.0010114803, 0.006947865, -0.013791732, 0.008319838, -0.006007883, 0.0095198145, 0.00031224394, 0.011423778, 0.0016629677, -0.0024619522, -0.012975748, 0.0063078776, -0.006639871, -0.01700767, -0.0008949826, 0.012151764, -0.0041439193, 0.0060998816, -0.0095198145, -0.0011729772, -0.018943632, -0.008463835, -0.00054198946, 0.0050759013, 0.010311799, -0.0076958505, -0.0013949729, -0.002983942, 0.022767557, 0.0034559327, 0.0006634871, 0.0048719053, -0.0077798488, -0.0046959086, -0.010967786, 0.03391934, 0.022223568, -0.024047533, 0.009583814, -0.0022739558, 0.0047239084, -0.01441572, 0.026959475, -0.0011259781, -0.0008274839, 0.003235937, -0.03289536, -0.029695423, -0.044063143, -0.021407584, 0.010519795, 0.0046519097, -0.017343663, 0.0033219354, -0.005707889, -0.011351779, 0.035615306, 0.014751714, -0.0012829751, -0.0053678956, -0.011975767, -0.0026339488, 0.015679695, -0.0119197685, -0.0014269722, -0.0062198793, 0.0038339256, 0.008951826, 0.008895827, 0.0256955, -0.015479699, -0.0011989766, 0.02151958, -0.01691167, 0.03143939, 0.0024279528, -0.008575833, -0.008383837, 0.018095648, -0.0057838876, -0.010855789, -0.0042439173, 0.010583795, -0.0039499234, -0.00097048114, -0.0011339779, 0.0039179237, -0.023407545, 0.009007825, 0.0036439293, -0.0020469602, -0.006439875, 0.0014699714, -8.118592e-05, -0.0027579465, -0.007655851, 0.002985942, 0.0015249704, 0.005359896, -0.0004582411, 0.006123881, -0.022575561, -0.0020469602, -0.005875886, 0.019263625, 0.0022399565, 0.009591813, -0.0051758992, 0.026575483, 0.002931943, -0.00411192, 0.0019289625, 0.0033099356, -0.015807692, -0.013567736, -0.006599872, -0.00668387, -0.003699928, -0.0077758487, 0.01075979, 0.0007659851, -0.0018289645, 0.018591639, -0.020783596, -0.012423758, 0.017407661, -0.011903768, -0.031567387, 0.0058918856, -0.023519542, 0.0038339256, 0.033215355, 0.017839653, -0.0016689675, 0.025647502, 0.021775577, -0.010727791, 0.0004529912, 0.017807653, 0.020543601, 0.0051558996, 0.008775829, 0.0026299488, 0.009127823, -0.019887613, 0.02115159, -0.022255568, 0.012791751, 0.0028899438, 0.004379915, -0.003193938, -0.0014089727, -0.013943729, 0.00721586, -0.02316755, -0.009639813, -0.020143608, 0.02110359, 0.004423914, -0.007007864, -0.006783868, -0.030559406, -0.009159822, 0.019599618, 0.008055843, -0.0042599174, 0.0038819246, -0.0155596975, -0.0042919167, -0.013463738, 0.007819848, 0.029951418, -0.01801565, 0.004419914, 0.0011899768, 0.0066078715, 0.0060998816, -0.032095376, -0.022703558, -0.0077798488, 0.0015289703, 0.009471816, 0.012095765, 0.015839692, 0.021679578, 0.007087862, -0.012703753, -0.019151628, 0.007143861, 0.027135473, -0.0056318906, 0.00076748506, 0.007787849, 0.024847517, 0.01595169, 0.01849564, -0.024271527, -0.009447817, -0.007239859, -0.01852764, -0.0011689772, -0.026383488, -0.0033119356, -0.014759713, -0.0028039454, 0.024879517, -0.02207957, -0.030463409, -0.013839731, -0.0023199548, 0.006383876, 0.010599794, 0.0057878876, 0.00615988, -0.005871886, -0.0003544931, 0.0005504893, -0.02012761, -0.0029399428, 0.002625949, -0.0014599717, -0.035871305, 0.007631852, -0.009351818, 0.0049199043, -0.035199314, 0.015271703, 0.0053318962, 0.011983767, -0.020831594, -1.3116933e-05, -0.0009609813, 0.01806365, -0.021743577, -0.0033779345, 0.015823692, -0.02011161, 0.0036159297, 0.005719889, -0.0019509621, 0.0097278105, -0.0019509621, 0.010255801, -0.0053758956, -0.0154717, 0.004275917, -0.0015889691, 0.014663715, -0.015159706, 0.012511757, -0.0117037725, -0.004219918, 0.0077798488, -0.012671754, 0.012415758, -0.013271742, -0.006987864, 0.009111823, -0.014183724, 0.008855828, -0.017231666, 0.013935729, 0.0016009689, 0.0010989787, 0.00977581, -0.016383681, -0.006999864, -0.007447855, -0.013415739, -0.032447368, -0.016279684, 0.007883847, 0.013103745, -0.0013859731, 0.0127517525, 0.007107862, -0.017631657, 0.001646968, 0.006571872, 0.0060638823, 0.0046159104, -0.019375624, 0.012551756, 0.014551717, -0.011751772, 0.00359393, 0.027055474, -0.006943865, -0.018351642, 0.0050119027, -0.0021779577, 0.0046559097, 0.013303742, 0.0024939515, -0.01231976, 0.011167783, -0.0031119394, 0.010103804, -0.0005924885, 0.005379895, 0.004575911, 0.0035179316, 0.0030079416, 0.0019169628, -0.012295761, -0.013943729, -0.017087668, 0.027487466, -0.0126477545, -0.0017629657, 0.007351857, -0.0017239664, 0.023807537, -0.0022719558, -0.008535834, 0.010671793, -0.024015533, 0.005043902, -0.017807653, -0.0024539523, -0.029119434, 0.0038479252, 0.013631735, -0.028639443, -0.0047239084, 0.0015079707, -0.014567717, 0.005555892, -0.017631657, 0.011167783, -0.00025774498, 0.0130637465, 0.049087048, 0.0008069843, -0.023007553, 0.010695792, 0.0010319799, -0.012159764, 0.008927827, -0.014535718, 0.02371154, -0.0045639114, 0.02316755, 0.02164758, -0.012151764, -0.003349935, -0.0007134861, 0.006723869, 0.028159453, 0.0018689637, -0.0058438866, -0.002163958, 0.01899163, 0.013671734, -0.019375624, 0.013567736, -0.024255529, 0.011367779, -0.0038099259, -0.0052078986, 0.007915846, 7.537354e-05, 0.010615794, -0.009503815, -0.0039979224, 0.004575911, -0.0016299683, 0.015639696, -0.023071552, -0.017167667, -0.011983767, -0.00925582, -0.00013937229, 0.017375663, 0.0078038485, -0.01080779, -0.0052718977, 0.010191802, 0.009367818, -0.0039419234, -0.017743655, 0.008059843, -0.013455738, -0.020463603, -0.012183763, 0.013079746, 0.001849964, 0.0046519097, -0.023263548, -0.019823615, -0.011047785, 0.013847731, -0.0002624949, 0.0007064863, 0.025391506, 0.013839731, 0.012687753, 0.0005804887, -0.008247839, -0.0118157705, 0.007095862, -0.0024059531, -0.010135803, 0.008607833, -0.005451894, -0.0051558996, -0.0152397035, 0.018367643, 0.023791537, 0.01283175, 0.02827145, -0.0076758508, -0.034303334, 0.009495815, -0.014255723, -0.0126477545, 0.0021979574, -0.016687676, -0.00022524562, -0.0050839013, -0.027375467, 0.018479642, 0.008695831, -0.013143744, -0.0011499777, -0.012111764, -0.00042074182, -0.0047199083, -0.0077438494, -0.0011039785, 0.017087668, 0.018559638, 0.01806365, 0.021967573, -0.008391837, 0.020719597, 0.0022799557, -0.009455816, 0.003491932, -0.004999903, -0.021743577, 0.03462333, -0.019455621, -0.009431817, -0.007163861, 0.025039513, -0.024063533, -0.0013549736, -0.010943787, 0.014255723, -0.039551232, 0.010463797, 0.006423875, -0.008847828, 0.0074838544, -0.010735791, -0.033311352, -0.0068598664, -0.014055727, 0.0012269762, -0.009807809, -0.0015549698, 0.0019599618, -0.014287722, 0.0072838585, -0.006535873, 0.008095843, -0.008439836, -0.008975825, 0.0049279043, 0.012503757, -0.00718786, -0.024031533, -0.031839382, 0.025615502, 0.0034899323, -0.020431602, -0.0039259237, 0.0002829945, -0.01082379, 0.010551795, 0.0076478515, -0.0018249645, -0.01897563, 0.004983903, 0.006723869, -0.008551834, 0.006211879, 0.016511679, -0.0029139433, 0.004263917, 0.009239821, -0.0019749617, 0.0042919167, -0.001803965, -0.0057798875, -0.010167803, -0.0044119144, -0.021855576, 0.017647658, -0.018255645, 0.013023747, 0.018575639, 0.0053438963, 0.003193938, -0.0036239296, -0.007155861, 0.012223762, -0.0025619501, -0.006235879, -0.018783635, 0.016383681, 0.013111745, -0.0034239334, -0.011463777, -0.019871613, -0.016375681, 0.026607484, 0.0152477035, -0.01184777, 0.0068118675, -0.019423623, 0.0010549795, 0.009423817, -0.02884744, -0.007895847, -0.008107842, -0.003703928, 0.023759538, -0.006267878, 0.0050039026, 0.022959555, -0.011983767, -0.0058358866, 0.008183841, 0.018287644, -0.01079979, 0.00616388, -0.0113917785, -0.022143569, 0.0024399527, 0.008095843, -0.017391661, 0.0020899593, -0.0022359565, 0.01806365, -0.009503815, 0.0026839478, -0.013655734, -0.009599813, 0.010311799, 0.013519737, -0.013119745, 0.006287878, -0.0025439505, 0.017215665, -0.00875183, -0.025823498, -0.01902363, -0.0010419798, 0.00013599735, 0.00083148386, -0.010095804, 0.013455738, -0.013255742, 0.00462391, -0.0036279294, -0.02105559, 0.013183744, -0.01387173, -0.014159725, -0.0038419254, 0.011751772, -0.017423661, -0.016511679, 0.0039299238, -0.019407623, 0.00082998385, 0.0059918836, -0.008247839, -0.002209957, -0.024447525, 0.008599833, 0.0078038485, -0.029439427, 0.032063376, -0.0023539541, -0.014287722, -0.00033574348, 0.008599833, -0.009927807, 0.0018459641, 0.0006074882, 0.008111842, -0.003813926, -0.013623735, 0.014807712, -0.002105959, -0.024815518, 0.010519795, 0.018831633, 0.015327702, -0.013239742, -0.0011399778, 0.0036299294, -0.011023786, -0.0029719423, 0.0017179666, 0.006951865, 0.015119706, -0.01910363, 0.015863692, -0.00011168533, -0.0030519406, 0.017151667, -0.0074838544, 0.0010029805, 0.020143608, -0.0011619774, 0.01646368, -0.011087785, 0.020287605, 0.012063766, 0.0150397075, -0.009639813, 0.0038979242, 0.009023825, -0.000308244, -0.029471427, -0.0049719033, 0.005243898, -0.0050719013, 0.036799286, -0.0150397075, 0.0005364896, -0.008135842, 0.0070718625, 0.008655832, 0.0035399313, -0.007343857, 0.0070678624, -0.009919807, -5.612391e-05, -0.006067882, -0.016735675, 0.0046479097, -0.02471952, 0.022383565, -0.00019162128, 0.022751559, -0.001802965, 0.006443875, -0.0062998775, 0.013847731, 0.00669187, 0.021935573, 0.0036679287, -0.009375818, -0.015375701, -0.012079765, 0.0024619522, 0.0007914846, 0.007951845, 0.0055318926, -0.0047719073, 0.014591716, -0.007299858, 0.009407817, 0.03395134, -0.0049079047, -0.010063805, 0.028719442, 0.0067678685, 0.004783907, 0.0017259665, 0.020975592, -0.007291858, 0.015839692, 0.0022359565, 0.0063558766, -0.020623598, 0.007267859, -0.0023779538, 0.025247509, 0.01587169, 0.007467855, 0.009847809, -0.0073398575, -0.013799732, -0.0021179589, 0.012463758, 0.0031059396, -0.006367876, 0.013039746, 0.009887808, 0.018351642, -0.0017699656, 0.0006879866, 0.023887536, 0.01179177, -0.008187841, -0.009127823, 0.03705528, -0.004999903, -0.0016569678, -0.003289936, 0.037311275, 0.0024859516, -0.013535737, 0.013087746, 0.009871808, 0.002879944, 0.014303722, -0.027327469, 0.0017449661, 0.01694367, -0.011903768, 0.006959865, -0.0065598725, -0.0020639598, 0.01231976, 0.003909924, 0.0035799304, -0.015647696, -0.00875983, -0.013551736, 0.008991825, -0.03142339, -0.030399408, -0.0027659463, 0.0024339526, -0.009367818, 0.0024999515, -0.01339974, -0.013255742, 0.018383643, 0.006067882, -0.021263586, -0.01599969, -0.0017149666, -0.008123842, 0.0017859653, 0.014535718, 0.016831674, -0.026351487, -0.01908763, 0.010191802, 0.00875983, 0.011647774, 0.031247392, -0.012135764, 0.01132778, -0.0154237, 0.0030679405, 0.008303839, -0.0041999184, -0.0013409739, -0.015767694, 0.013143744, 0.020239606, 0.010087804, 0.006787868, -0.00668387, 0.009287819, -0.00097098114, 0.010007805, -0.008607833, -0.019167628, 0.0022199568, -0.006747869, -0.0076718507, -0.013039746, -0.004065921, 0.016063688, -0.0041759186, -0.01587969, 0.010775791, -0.0074958545, -0.018895634, -0.0154397, 0.009095823, 0.0029719423, -0.016655676, -0.004003922, -0.0014479719, -0.006111881, -0.017279664, 0.010839789, 0.026063493, 0.03295936, 0.008187841, -0.010543795, -0.008527834, -0.005971884, -0.002621949, 0.0152397035, -0.0064038755, -0.0037459272, -0.009231821, -0.0112877805, -0.005875886, 0.0048599057, 0.014015728, 0.027935456, 0.0050599016, 0.010543795, 0.0028379448, -0.010151803, -0.011887769, 0.007607852, -0.013703734, 0.027711462, 0.0067198696, 0.019711617, -0.0014729714, 0.00034849322, -0.041343197, 0.007951845, -0.006019883, 0.0077958484, 0.010151803, -0.012295761, 0.00924782, 0.007419856, 0.022319566, 0.0025579503, -0.00037449272, 0.019871613, -0.015735693, 0.025391506, -0.0127517525, 0.019231627, 0.055742916, -0.020895595, 0.021375585, -0.008103843, 0.010415797, 0.027535465, 0.0027879458, 0.0027199471, -0.010687793, 0.00049799035, -0.028255451, -0.014855711, 0.00019137128, 0.0029639425, -0.010591794, -0.013015747, -0.013127745, 0.0073838565, -0.009919807, -0.009103823, 0.0062038796, -0.007007864, -0.0020979592, -0.010015805, 0.0012309761, 0.014687714, -0.031535387, -0.016399682, 0.011647774, -0.03436733, 0.01337574, -0.0046559097, 0.008455835, 0.035071317, 0.00042324179, 0.0057798875, -0.011095785, 0.014695714, -0.007471855, -0.00010606044, 0.001081979, -0.011303781, -0.012695753, 0.00061448803, -0.020303605, -0.019871613, 0.007143861, -0.0010119803, 0.047551077, -0.0019449622, 0.00029574425, -0.010047805, -0.005403895, -0.008991825, 0.007927846, -0.017071668, -0.019919613, 0.0032519368, 0.016783673, -0.008607833, -0.00024237028, -0.00617988, 0.0082718395, 0.028431447, -0.0050039026, 0.0029159433, -0.016879672, -0.020255607, 0.018815635, -0.0026459487, -0.0058078873, -0.005743888, 0.0011799771, 0.0009389818, 0.008319838, -0.0032679364, -0.0035099317, 0.0022039572, -0.0021279587, -0.0051239002, 0.0057238885, -0.016639676, -0.008703831, -0.002111959, 0.012207762, -0.009383817, -0.023183549, -0.008047843, -0.019375624, 0.016719675, -0.02315155, -0.004159919, 0.016687676, -0.0076238518, -0.01391173, -0.011487776, -0.012695753, 0.0035759306, -0.00058598863, -0.019967612, -0.02774346, -0.014607716, -0.0043079164, 0.00066398707, 0.015215704, 0.013119745, 0.035231315, 0.010583795, -0.0050239023, 0.019983612, 0.02011161, 0.0022439563, 0.014263723, -0.003039941, 0.004831906, 0.019327624, 0.0028039454, -0.0037159277, 0.016767673, 0.03795126, -0.010855789, 0.0042519174, -0.021375585, -0.0042919167, 0.0046639093, 0.009383817, -0.0016129686, -0.0050079026, 0.006783868, 0.00872783, -0.012479758, 0.00056698895, 0.008279839, 0.000821984, 0.0041919183, 0.022511562, -0.016239684, -0.015519698, -0.0025399507, -0.0017859653, 0.0026179492, 0.0360633, -0.014567717, 0.020703597, 0.007559853, -0.01795165, -0.017119667, 0.0054958933, 0.006731869, 0.014991709, -0.00773185, -0.012551756, -0.0043479153, -0.009151822, 3.503057e-05, -0.0004069921, 0.017247666, 0.01745566, 0.007059863, -0.00029199434, 0.017071668, 0.0075358534, 0.0025859498, 0.017135667, 0.004791907, 0.0018849634, 0.0033839343, 0.011679773, 0.003039941, 0.002469952, 0.015503699, 0.0069638644, -0.016231684, -0.017375663, 0.017711656, 0.026959475, 0.0027699461, 0.025823498, 0.017551659, -0.0010179802, 0.018175647, 0.010423797, 0.004527912, -0.0014059726, 0.037663266, -0.01750366, -0.0118077705, 0.012815751, 0.012399759, 0.007867847, -0.01133578, -0.00872783, -0.008831828, 0.0037479273, 0.016607678, 0.0003849925, -0.011991767, 0.008143841, 0.017567659, 0.01703967, 0.006067882, 0.013103745, 0.00874383, 0.014167724]]}